{"id":"2BCfkBRHmbhytY8nm9spZ4inpFkqHBsLKs6LqzTxwmhuxSvfYzGLsd","title":"nixCraft: Linux Tips, Hacks, Tutorials, And Ideas In Blog Format (RSS/FEED)","displayTitle":"Dev - NixCraft","url":"https://www.cyberciti.com/atom/atom.xml","feedLink":"https://www.cyberciti.biz/atom/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":3,"items":[{"title":"How to install KSH on FreeBSD","url":"https://www.cyberciti.biz/faq/how-to-install-ksh-kornshell-on-freebsd/","date":1741045859,"author":"Vivek Gite","guid":373,"unread":true,"content":"<p>nstalling KSH (KornShell) on FreeBSD can be done with either FreeBSD ports or the pkg command. The ports collection will download the KSH source code, compile it, and install it on the system. The pkg method is easier, and it will download a pre-compiled binary package. Hence, it is recommended for all users. KornShell (KSH) has a long history, and many older Unix systems and scripts rely on it. As a result, KSH remains relevant for maintaining and supporting legacy infrastructure. Large enterprises, especially those with established Unix-based systems, continue to use KSH for scripting and system administration tasks. Some industries where KSH is still commonly used include finance and telecommunications. While Bash has become the dominant shell in many Linux distributions, KSH still holds a significant presence in Unix-like environments, particularly in legacy systems. Therefore, installing KSH and practicing with it is worthwhile if you plan to work in such environments.</p>","contentLength":988,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Sed Tutorial: Learn Text Editing with Syntax & Examples","url":"https://www.cyberciti.biz/faq/linux-sed-command-tutorial-for-text-editing-with-syntax-examples/","date":1740995227,"author":"Vivek Gite","guid":372,"unread":true,"content":"<p>ed is an acronym for \"stream editor.\" A stream refers to a source or destination for bytes. In other words, sed can read its input from standard input (stdin), apply the specified edits to the stream, and automatically output the results to standard output (stdout). Sed syntax allows an input file to be specified on the command line. However, the syntax does not directly support output file specification; this can be achieved through output redirection or editing files in place while making a backup of the original copy optionally. Sed is one of the most powerful tools on Linux and Unix-like systems. Learning it is worthwhile, so in this tutorial, we will start with the sed command syntax and examples.</p>","contentLength":711,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to tell if FreeBSD needs a Reboot using kernel version check","url":"https://www.cyberciti.biz/faq/freebsd-determine-if-a-system-reboot-is-necessary/","date":1740348443,"author":"Vivek Gite","guid":371,"unread":true,"content":"<p>eeping your FreeBSD server or workstation updated is crucial for security and stability. However, after applying updates, especially kernel updates, you might wonder, \"Do I need to reboot my system?\" Let's simplify this process and provide a straightforward method for determining whether a reboot is necessary using the CLI, shell script, and ansible playbook.</p>","contentLength":361,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}