{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":75,"items":[{"title":"More Apple Silicon Updates For Linux 6.15 Help M1/M2 Plus iPad / iPod / iPhone","url":"https://www.phoronix.com/news/Apple-Silicon-DT-3-Linux-6.15","date":1741520902,"author":"Michael Larabel","guid":767,"unread":true,"content":"<article>Already queued ahead of the Linux 6.15 merge window opening later this month are DeviceTree support for Apple's T2 SoCs as well as other DeviceTree additions set to be mainlined. A third round of DeviceTree patches were sent out on Sunday morning to the Linux kernel mailing list for the upcoming v6.15 cycle...</article>","contentLength":311,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ALGOL 68 Compiler Front-End Not Being Merged Into GCC At This Point","url":"https://www.phoronix.com/news/ALGOL-68-No-GCC-2025","date":1741520122,"author":"Michael Larabel","guid":766,"unread":true,"content":"<article>ALGOL 68 is an imperative programming language that's more than a half-century old and went on to inspire and influence other programming languages. It has its place in programming language history but a recently published compiler front-end for ALGOL 68 has been decided for now at least not to be upstreamed into the GNU Compiler Collection (GCC)...</article>","contentLength":351,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"America's Justice Department Still Wants Google to Sell Chrome","url":"https://tech.slashdot.org/story/25/03/09/0232250/americas-justice-department-still-wants-google-to-sell-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741520040,"author":"EditorDavid","guid":188,"unread":true,"content":"Last week Google urged the U.S. government not to break up the company — but apparently, it didn't work.\nIn a new filing Friday, America's Justice Department \"reiterated its November proposal that Google be forced to sell its Chrome web browser,\" reports the Washington Post, \"to address a federal judge finding the company guilty of being an illegal monopoly in August.\"\n\nThe government also kept a proposal that Google be banned from paying other companies to give its search engine preferential placement on their apps and phones. At the same time, the government dropped its demand that Google sell its stakes in AI start-ups after one of the start-ups, Anthropic AI, argued that it needed Google's money to compete in the fast-growing industry. \n\nThe government's final proposal \"reaffirms that Google must divest the Chrome browser — an important search access point — to provide an opportunity for a new rival to operate a significant gateway to search the internet, free of Google's monopoly control,\" Justice Department lawyers wrote in the filing... Judge Amit Mehta, of the U.S. District Court for the District of Columbia, who had ruled that Google held an illegal monopoly, will decide on the final remedies in April. \n The article quotes a Google spokesperson's response: that the Justice Department's \"sweeping\" proposals \"continue to go miles beyond the court's decision, and would harm America's consumers, economy and national security.\"","contentLength":1461,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel NPU Firmware Files Upstreamed To linux-firmware.git","url":"https://www.phoronix.com/news/Intel-NPU-Firmware-Upstream","date":1741519366,"author":"Michael Larabel","guid":765,"unread":true,"content":"<article>For two years now the Intel IVPU accelerator driver has been part of the mainline kernel for supporting the Neural Processing Unit (NPU) that's part of the Core Ultra \"Meteor Lake\" CPUs and newer. Only this week though was the firmware for the Intel NPUs now upstreamed to the linux-firmware.git repository...</article>","contentLength":309,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is America Closer to Ending Daylight Saving Time?","url":"https://news.slashdot.org/story/25/03/09/0359219/is-america-closer-to-ending-daylight-saving-time?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741509240,"author":"EditorDavid","guid":187,"unread":true,"content":"U.S. president Donald Trump called Daylight Saving Time \"very costly to our nation\" and \"inconvenient\" in December. Today the Washington Post remembers he'd vowed his Republican party would use their \"best efforts\" to eliminate it. \n\nBut it's still proving to be politically difficult...\n\nPolls have shown that most Americans oppose the time shifts but disagree on what should replace them... [U.S. political leaders] also say they are grappling with whether the nation should permanently move the clocks forward one hour, an idea championed by lawmakers on the coasts who say it would allow for more sunshine during the winter, or remain on year-round standard time, which is favored by neurologists who say it aligns with our circadian rhythms. That decision would rest with Congress, not the president. The split often reflects regional, not political, differences, based on where time zones fall; a year-round \"spring forward\" would mean winter sunrises that could creep past 9 a.m. in cities such as Indianapolis and Detroit, prompting many local lawmakers to oppose the idea... \n\n[A 2022 Senate vote to make Daylight Saving Time permanent] awoke a new lobbying effort from advocates such as the American Academy of Sleep Medicine, which warned that year-round daylight saving time would be unhealthy, citing risks such as higher rates of obesity or metabolic dysfunction. Some researchers warned of a condition dubbed \"social jetlag,\" saying that internal body clocks and rhythms would be persistently misaligned if human clocks were permanently set forward an hour. The concerted resistance from the health groups — which some congressional aides jokingly referred to as \"Big Sleep\" — helped kill the measure in the House and has contributed to a stalemate over how to proceed... \n Today, roughly two-thirds of Americans want to end the clock changes, polls show. But even those Americans don't agree on what should come next. An October 2023 YouGov poll found that 33 percent of respondents wanted year-round daylight saving time, 23 percent wanted permanent standard time, and 9 percent had no preference. The remainder weren't sure or preferred to remain on the current system... The political fight is far from over, with Trump allies such as Sen. Tommy Tuberville (R-Alabama) pledging to keep pushing for year-round daylight saving time. Some congressional Republicans also have privately called for a hearing in front of the House Energy and Commerce Committee, with hopes of advancing the Sunshine Protection Act.\n","contentLength":2532,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: Grand Central Dispatch, Once and for All (3/9/2025)","url":"https://hackernoon.com/3-9-2025-techbeat?source=rss","date":1741504257,"author":"Techbeat","guid":658,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/jay9thakur\">@jay9thakur</a> [ 5 Min read ] \n Beginners face a choice: acquire foundational knowledge or await further simplification. <a href=\"https://hackernoon.com/why-natural-language-coding-isnt-for-everyoneyet\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/zbruceli\">@zbruceli</a> [ 5 Min read ] \n What is diffusion large language model LLM, and why it matters. In the context of Inception Labs releasing Mercury Coder. <a href=\"https://hackernoon.com/what-is-a-diffusion-llm-and-why-does-it-matter\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/dhruvam\">@dhruvam</a> [ 23 Min read ] \n Inspired by Google’s Applied CS with Android, this adaptation for Flutter provides an interactive way to understand Arrays, HashSets, and HashMaps. <a href=\"https://hackernoon.com/heres-how-to-learn-data-structures-the-fun-way-with-flutter\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kitcast\">@kitcast</a> [ 7 Min read ] \n Discover how data visualization transforms raw data into actionable insights for tech companies, driving better decisions and competitive advantage. <a href=\"https://hackernoon.com/the-power-of-data-visualization-for-tech-companies-is-your-strategy-up-to-par\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kfamyn\">@kfamyn</a> [ 20 Min read ] \n Master Swift Grand Central Dispatch in iOS: learn thread/queue interplay, sync vs async execution, QoS, and deadlock pitfalls via practical exercises. <a href=\"https://hackernoon.com/grand-central-dispatch-once-and-for-all\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/salkimmich\">@salkimmich</a> [ 5 Min read ] \n Explore how relicensing and forks are reshaping open source. Dr.Dawn Foster's research unveils challenges, governance shifts, and the resilience of communities. <a href=\"https://hackernoon.com/open-source-isnt-deadits-just-forked\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hayday\">@hayday</a> [ 4 Min read ] \n Is the rise of vibe coding also the end of software engineering? How will vibeware change the nature of the software entrepreneur, and the meaning of work? <a href=\"https://hackernoon.com/vibe-coding-a-new-system-of-the-world\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/coldware\">@coldware</a> [ 3 Min read ] \n With Cardano (ADA), XRP, and Solana (SOL) all gaining momentum, the focus now shifts to the groundbreaking developments expected to unfold at the White House <a href=\"https://hackernoon.com/cardano-xrp-and-coldware-set-to-rock-march-7th\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/thefrogsociety\">@thefrogsociety</a> [ 20 Min read ] \n Research has revealed that a shocking amount of modern design was created with only half the population in mind.  <a href=\"https://hackernoon.com/one-would-think-the-world-was-built-just-as-much-for-women-as-it-is-for-men\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/anaumova2502\">@anaumova2502</a> [ 4 Min read ] \n Over-engineering feels like smart planning—until it slows you down. Learn how to spot the signs, avoid common traps, and keep your code simple, scalable, and ma <a href=\"https://hackernoon.com/the-hidden-cost-of-over-engineering-and-how-to-stop-yourself\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/scottdclary\">@scottdclary</a> [ 13 Min read ] \n \"Be realistic\" is a common advice, but it's often backward, says the author. <a href=\"https://hackernoon.com/unreasonable-goals-are-actually-easier-to-achieve-heres-why\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ishanpandey\">@ishanpandey</a> [ 5 Min read ] \n Meet six women reshaping crypto in 2025. From education to AI, discover how they’re driving innovation, inclusivity, and the future of blockchain. <a href=\"https://hackernoon.com/women-who-are-reshaping-crypto-in-2025-meet-the-disruptors\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/arvindtoorpu\">@arvindtoorpu</a> [ 6 Min read ] \n Migrating our SQL Server databases to AWS RDS saved us about 30% in overall costs and eliminated much of the routine manual maintenance via automation.  <a href=\"https://hackernoon.com/sql-server-to-aws-rds-migration-the-good-the-bad-and-everything-in-between\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/brianwaustin\">@brianwaustin</a> [ 4 Min read ] \n Social media in 2025 is a battle between humans and the machines, and we are losing. <a href=\"https://hackernoon.com/the-internet-is-worse-than-ever-but-were-too-addicted-to-leave\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 4 Min read ] \n We need diplomatic relations anchored by the same principles that have made Bitcoin revolutionary: transparency, verification, and immutability. <a href=\"https://hackernoon.com/maybe-trump-and-zelenskyy-should-try-blockchain-diplomacyat-least-it-would-keep-them-honest\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/omnidirectional\">@omnidirectional</a> [ 5 Min read ] \n Panopticus enhances 3D object detection for edge AI, optimizing omnidirectional camera perception while balancing accuracy &amp; latency on resource-limited devices <a href=\"https://hackernoon.com/this-ai-model-gives-edge-devices-eyes-on-the-back-of-their-heads\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/raviteja.ganta\">@raviteja.ganta</a> [ 13 Min read ] \n Transformers explained: The secret technology behind ChatGPT and how it’s reshaping AI chatbots worldwide.\n <a href=\"https://hackernoon.com/inside-transformers-the-hidden-tech-behind-llms-and-chatbots-like-chatgpt\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/benoitmalige\">@benoitmalige</a> [ 5 Min read ] \n Stay calm under stress with these 6 simple techniques. Breathe better, think clearer, and take control.  <a href=\"https://hackernoon.com/stay-calm-in-stressful-situations-with-these-6-proven-techniques\">Read More.</a></p>","contentLength":3165,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ignoring Protests, Christie's Holds AI Art Auction, Makes Big Money","url":"https://slashdot.org/story/25/03/09/0132251/ignoring-protests-christies-holds-ai-art-auction-makes-big-money?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741498440,"author":"EditorDavid","guid":186,"unread":true,"content":"As Christie's auction house planned the first-ever auction dedicated to AI-generated art works, over 5,600 people signed an online letter urging them to cancel it. \"Many of the artworks you plan to auction were created using AI models that are known to be trained on copyrighted work without a license,\" the letter complained. \n\"These models, and the companies behind them, exploit human artists, using their work without permission or payment to build commercial AI products that compete with them. Your support of these models, and the people who use them, rewards and further incentivizes AI companies' mass theft of human artists' work.\" CNET reports that the signers \"range from illustrators to authors to art therapists to cinematographers, from countries all across the globe.\" \n\nChristie's ignored them all and held the auction anyways. So what happened when it was over on Wednesday morning?\n\nMore than 30 lots attracted hundreds of bids and brought in $728,784, Christie's reports. And there's a generational twist: The auction house says 37% of registrants were completely new to Christie's, and 48% of bidders were millennials or members of Gen Z... The highest price in the sale was $277,200 for a work by Refik Anadol titled Machine Hallucinations — ISS Dreams — A. It used a data set of more than 1.2 million images taken from the International Space Station and satellites. \n\n\nARTnews reports that the auction actually brought in more than Christie's had expected:\nThe sale, which made up of 34 lots, had an 82 percent sell through rate... While some digital artists, including Beeple, championed the sale, others decried it as emblematic of the ongoing struggle between human artistry and machine-driven innovation. The results, however, suggest that AI art — controversial as it may be — is carving a firm place in the market.","contentLength":1852,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reddit and Digg Cofounders Plan Relaunch of 'Human-Centered' Digg With AI Innovations","url":"https://tech.slashdot.org/story/25/03/08/2252242/reddit-and-digg-cofounders-plan-relaunch-of-human-centered-digg-with-ai-innovations?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741485540,"author":"EditorDavid","guid":185,"unread":true,"content":"\"The early web was fun,\" Reddit co-founder Alexis Ohanian posted Wednesday on X.com. \"It was weird. It was community-driven. It's time to rebuild that. \n\n\"Which is why Kevin Rose and I just bought back Digg.\" \n\nThe amount of that purchase is \"undisclosed,\" reports CNBC:\n\nThe deal is backed by venture capital firms True Ventures, where Rose is a partner, and Ohanian's Seven Seven Six.... The company said in a release that it aims to differentiate itself in the social media market by \"focusing on AI innovations designed to enhance the user experience and build a human-centered alternative....\" Rose said in a post on X that he and Ohanian \"dreamed up features that weren't even possible with yesterday's tech.\" \n\n\"We're bringing more transparency and community partnership,\" according to Rose's post, \"unlike anything you've seen, plus AI that unlocks creativity without sanitizing the human element. The timing is finally right to reimagine what's possible.\" \n\n\"I really disliked you for a long time,\" Ohanian tells Rose in their joint announcement video. (To which a cheery Rose responds, \"Rightfully so.\") \n\nBut in the video Ohanian also says that today \"Our perspective on the world has shifted a lot. You don't want to live in the past, but now we actually have the technology to make better, healthier community experiences.\" (\"Old Rivals, New Vision,\" says a post on Digg's X.com account, urging readers to \"Sign up to get early access when invites go live.\") \n\nAnd Digg.com now just displays this teasing catchphrase. \"The front page of the internet, now with superpowers.\" (At the top of the page there's also a link to watch Diggnation Live at SXSW.) \n\nWhile valued at $160 million dollars in 2008, Digg's plummeting traffic led to its brand and web site being acquired in 2012 by tech incubator Betaworks for about $500,000, according to CNBC...","contentLength":1861,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Free Software Foundation Rides To Defend AGPLv3 Against Neo4j License Add-ons","url":"https://news.slashdot.org/story/25/03/08/0613217/free-software-foundation-rides-to-defend-agplv3-against-neo4j-license-add-ons?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741480740,"author":"EditorDavid","guid":184,"unread":true,"content":"This week the Free Software Foundation \"backed a lone developer's brave effort to overturn a pivotal court ruling that threatens to undermine the AGPLv3 — the foundation's GNU Affero General Public License, version 3,\" reports the Register. \n\n\"At stake is the future of not just the AGPLv3, but the FSF's widely used GNU Public License it is largely based on, and the software covered by those agreements.\"\n\n A core tenet of the GPL series is that free software remains free forever, and this is woven into the licenses' fine print. This ongoing legal battle is a matter of whether people can alter those licenses and redistribute code as they see fit in a non-free way, or if they must stick to the terms of an agreement that says the terms cannot be changed...\nIf the Ninth Circuit upholds the [original district court] ruling, it's likely to create a binding precedent that would limit one of the major freedoms that AGPLv3 and other GPL licenses aim to protect — the ability to remove restrictions added to GPL licensed code. \n\n\n\"Neo4j appended an additional nonfree commercial restriction, the Commons Clause, to a verbatim version of the GNU AGPLv3 in a version of its software...\" according to an FSF announcement this week. \"The FSF's position on such confusing licensing practices has always been clear: the GNU licenses explicitly allow users to remove restrictions incompatible with the four freedoms.\" (You can read their amicus brief here.) \n\nThanks to Slashdot reader jms00 for sharing the news.","contentLength":1513,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New DOJ proposal still calls for Google to divest Chrome, but allows for AI investments","url":"https://techcrunch.com/2025/03/08/new-doj-proposal-still-calls-for-google-to-divest-chrome-but-allows-for-ai-investments/","date":1741471460,"author":"Anthony Ha","guid":370,"unread":true,"content":"<p>The US Department of Justice is still calling for Google to sell its web browser Chrome, according to a Friday court filing.&nbsp; The DOJ first proposed that Google should sell Chrome last year, under then-President Joe Biden, but it seems to be sticking with that plan under the second Trump administration. The department is, however, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Snack Makers Are Removing Fake Colors From Processed Foods","url":"https://science.slashdot.org/story/25/03/08/033219/snack-makers-are-removing-fake-colors-from-processed-foods?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741469640,"author":"EditorDavid","guid":182,"unread":true,"content":"\"PepsiCo is launching a new product, Simply Ruffles Hot &amp; Spicy, which uses natural ingredients like tomato powder and red chile pepper instead of artificial dyes,\" reports Bloomberg. But it's part of a larger trend:\n\nIn one of the final acts of President Joe Biden's administration, the U.S. Food and Drug Administration banned Red No. 3, effective in January 2027 for food, one of a handful of synthetic colors that have become something of a symbol of all that is wrong with the American food system and the ultraprocessed foods that dominate it. Putting Red No. 3 aside, the rest of the colors remain legal, and they're used in tens of thousands of supermarket and convenience-store products in the United States, according to NielsenIQ data. The recent campaign against them became one of the pillars of the \"Make America Healthy Again\" movement championed by Health and Human Services Secretary Robert F. Kennedy Jr. The criticism follows what health advocates have been saying for years: The synthetic colors add nothing to taste, nutritional value or shelf life but make unhealthy foods more visually appealing. Worst of all, there are concerns that the dyes may be carcinogenic or trigger hyperactivity in some kids. \n[Ian Puddephat, vice president of research and development for food ingredients at PepsiCo] says PepsiCo is \"on a mission to get them out of the portfolio as much as we can\"... PepsiCo has a dozen brands, including Simply, that don't have the artificial dyes, and the company is working to pull them out of an additional eight brands in the next year. \nOther companies are trying too, according to the article. Though Ironically, \"the supply chain for colors like a radish's red or annatto's orange is not as robust as that for Red No. 40 or Yellow No. 6.\"\n\n But there's also been some success stories:\n\nIn 2016, Kraft Heinz Foods Co. announced that it'd made good on an earlier promise to get artificial dyes out of its recipe — and apparently, nobody noticed. \"We just haven't told that story,\" says Carlos Abrams-Rivera, Kraft Heinz's CEO. (The lack of artificial dyes is more prominent on the boxes now...)\n \nThanks to long-time Slashdot schwit1 for haring the article.","contentLength":2202,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Undocumented 'Backdoor' Found In Chinese Bluetooth Chip Used By a Billion Devices","url":"https://hardware.slashdot.org/story/25/03/08/2027216/undocumented-backdoor-found-in-chinese-bluetooth-chip-used-by-a-billion-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741466040,"author":"EditorDavid","guid":181,"unread":true,"content":"\"The ubiquitous ESP32 microchip made by Chinese manufacturer Espressif and used by over 1 billion units as of 2023 contains an undocumented 'backdoor' that could be leveraged for attacks,\" writes BleepingComputer. \n\"The undocumented commands allow spoofing of trusted devices, unauthorized data access, pivoting to other devices on the network, and potentially establishing long-term persistence.\"\n\nThis was discovered by Spanish researchers Miguel Tarascó Acuña and Antonio Vázquez Blanco of Tarlogic Security, who presented their findings yesterday at RootedCON in Madrid. \"Tarlogic Security has detected a backdoor in the ESP32, a microcontroller that enables WiFi and Bluetooth connection and is present in millions of mass-market IoT devices,\" reads a Tarlogic announcement shared with BleepingComputer. \"Exploitation of this backdoor would allow hostile actors to conduct impersonation attacks and permanently infect sensitive devices such as mobile phones, computers, smart locks or medical equipment by bypassing code audit controls....\" \n\n\n\nTarlogic developed a new C-based USB Bluetooth driver that is hardware-independent and cross-platform, allowing direct access to the hardware without relying on OS-specific APIs. Armed with this new tool, which enables raw access to Bluetooth traffic, Targolic discovered hidden vendor-specific commands (Opcode 0x3F) in the ESP32 Bluetooth firmware that allow low-level control over Bluetooth functions. In total, they found 29 undocumented commands, collectively characterized as a \"backdoor,\" that could be used for memory manipulation (read/write RAM and Flash), MAC address spoofing (device impersonation), and LMP/LLCP packet injection. \n\nEspressif has not publicly documented these commands, so either they weren't meant to be accessible, or they were left in by mistake.\n \nThanks to Slashdot reader ZipNada for sharing the news.","contentLength":1889,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google scrubs mentions of ‘diversity’ and ‘equity’ from responsible AI team webpage","url":"https://techcrunch.com/2025/03/08/google-scrubs-mentions-of-diversity-and-equity-from-responsible-ai-team-webpage/","date":1741464508,"author":"Kyle Wiggers","guid":369,"unread":true,"content":"<p>Google has quietly updated the webpage for its Responsible AI and Human Centered Technology (RAI-HCT) team, the team charged with conducting research into AI safety, fairness, and explainability, to scrub mentions of “diversity” and “equity.” A previous version of the page used language such as “marginalized communities,” “diverse,” “underrepresented groups,” and “equity” to describe the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":483,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Judge allows authors’ AI copyright lawsuit against Meta to move forward","url":"https://techcrunch.com/2025/03/08/judge-allows-authors-ai-copyright-lawsuit-against-meta-to-move-forward/","date":1741464305,"author":"Anthony Ha","guid":368,"unread":true,"content":"<p>A federal judge is allowing an AI-related copyright lawsuit against Meta to move forward, although he dismissed part of the suit. In Kadrey vs. Meta, authors including Richard Kadrey, Sarah Silverman, and Ta-Nehisi Coates have alleged that Meta has violated their intellectual property rights by using their books to train its Llama AI models, and […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":416,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"America Lost 22% of Its Butterflies Within Two Decades","url":"https://science.slashdot.org/story/25/03/08/0523212/america-lost-22-of-its-butterflies-within-two-decades?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741462440,"author":"EditorDavid","guid":180,"unread":true,"content":"Butterflies \"are vanishing from U.S. landscapes at an alarming rate,\" reports CBS News:\n\n\nA comprehensive study, published Thursday in the journal Science, found that 22% of butterflies in the United States disappeared between 2000 and 2020... The researchers behind the Science study used data from more than 12.6 million butterflies spanning 342 individual species, drawing from 76,000 surveys across 35 nationwide monitoring programs. Funded by the U.S. Geological Survey, the study was the first to integrate such a vast dataset, its authors said. \n\nThe findings revealed that 33% of butterfly species have experienced significant population declines over the past two decades, with 107 out of the 342 species examined losing more than half of their population — including 22 species that declined by more than 90%. Meanwhile, only 3% of species showed population increases... \n\nUltimately, the butterfly decline is part of a larger global trend of insect population loss, with insects declining by about 1-2% annually, the study's authors said. Butterflies play an essential role in ecosystems, pollinating flowers, crops, and other plants. Their decline could have far-reaching impacts on plant reproduction and the health of ecosystems. \nJust three months ago the U.S. Fish and Wildlife Service said America's western migratory populations of monarch butterflies had declined by more than 95% since the 1980s, putting them \"at greater than 99% chance of extinction by 2080.\" (America's eastern migratory population were estimated to have declined by approximately 80%.) \n\nThis latest study found that one factor is climate change, according to CBS News, which reduces food sources, disrupts breeding cycles and increases habitat stress. (Another factor is pesticide use, which fortunately can be adjusted with various policy interventions and farming practices.) \n\nAnd one of the study's co-authors tells CBS News that \"the things we do in our own backyards actually make a difference.\" They recommend allowing backyard to \"grow wild\" with native plants (and reducing pesticide use) — even creating \"habitat spaces\" for insects like small piles of brush. \"Even simple actions — like leaving a strip of wildflowers or planting species that support pollinators — can provide crucial resources for butterflies and other insects.\"","contentLength":2341,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to Deploy Go + Templ + HTMX + TailwindCSS to Production","url":"https://hackernoon.com/how-to-deploy-go-templ-htmx-tailwindcss-to-production?source=rss","date":1741460418,"author":"4rkal","guid":657,"unread":true,"content":"<p>In this article, I will be showing you how to deploy the GoTTH stack (Go Templ htmx tailwind) to production.</p><p>\\\nI recently created my very own cryptocurrency exchange aggregator called <a href=\"https://cyphergoat.com/\">cyphergoat</a>; it finds you the best rate to swap your crypto from different partnered exchanges.</p><ol><li><p>An API that interacts with exchanges. Written in go and uses gin.</p></li><li><p>The Web UI is written in go and uses a combination of HTML, HTMX, tailwindcss, CSS, and Javascript in templ templates. Aka the GoTTH stack. It interacts with the API in order to find rates etc.</p></li></ol><p>\\\nWhat is extremely cool with this stack and setup is that we are able to produce  with everything included for each part and ship it to the server. On the webui side, this is possible since the HTML is compiled into go code using templ and then shipped with the binary.</p><p>\\\nIn this article, I will be going through my setup to make it easier for you to make something like this.</p><p>I am using a Debian 12 server which will expose my application via Cloudflare tunnels. All of the static files are being served via nginx and the API and website binaries are ran as systemd services.</p><p>\\\nIn this guide, I will show you how I set this up.</p><p>I have a single folder on my dev machine called cyphergoat: It contains:</p><p>\\\nThe API folder houses the API source code. The web houses the website source code.</p><p>\\\nAnd the builds houses all of the builds that are deployed to the server.</p><p>The first real challenge comes with setting up tailwindcss correctly.</p><p>\\\nIn my web project, I have a static folder specifically for static files. Inside of it, I have two files:</p><pre><code>/web\n    styles.css\n    tailwind.css\n</code></pre><p>\\\nThe  simply contains:</p><p>\\\nThe tailwind.css file is where tailwind-cli will save its stuff.</p><p>\\\nTo build the tailwind stuff, I simply run:</p><pre><code>npx @tailwindcss/cli -i ./static/styles.css -o ./static/tailwind.css --watch\n</code></pre><p>(assuming you have tailwind-cli installed)</p><p>\\\nIn my header.templ file (the header of all the pages), at the top I have:</p><pre><code>&lt;link href=\"/static/tailwind.css\" rel=\"stylesheet\"&gt;\n\n&lt;link href=\"/static/styles.css\" rel=\"stylesheet\"&gt;\n</code></pre><p>\\\nAnd the files are being served using Echo’s e.Static (in my main.go file).</p><pre><code>func main(){\ne := echo.New()\n\ne.Use(middleware.Logger())\ne.Use(middleware.Recover())\ne.Use(middleware.Secure())\n\n\ne.Static(\"/static\", \"static\") // Serves content from static folder.\n\n// Rest of the handlers\n}\n</code></pre><p>On my server side, I have a Debian 12 vm running on proxmox.</p><p>\\\nIn my users home directory, I have a folder with the following contents:</p><pre><code>cyphergoat/\n├── api\n├── static/\n└── web\n</code></pre><p>The static folder contains all of the static files (including tailwind.css and styles.css), and the  and  are the binaries.</p><p>\\\nI then have two systemd services for these executables:</p><p>The <code>/etc/systemd/system/cg-api.service</code></p><pre><code>[Unit]\nDescription=CypherGoat API\nAfter=network.target\n\n[Service]\nUser=arkal\nGroup=www-data\nWorkingDirectory=/home/arkal/cyphergoat\nExecStart=/home/arkal/cyphergoat/api\nRestart=always\nRestartSec=1\n\n[Install]\nWantedBy=multi-user.target\n</code></pre><p>\\\nAnd <code>/etc/systemd/system/cg-web.service</code></p><pre><code>[Unit]\nDescription=CypherGoat Web\nAfter=network.target\n\n[Service]\nUser=arkal\nGroup=www-data\nWorkingDirectory=/home/arkal/cyphergoat\nExecStart=/home/arkal/cyphergoat/web\n\n\n[Install]\nWantedBy=multi-user.target\n</code></pre><p>Both are owned by the group  (this is probably not necessary for the API) in order to make it easier to serve them via nginx.</p><p>The website is communicating with the API, but I still need to make the web-ui accessible.</p><p>\\\nI have set up an nginx site with the following configuration: <code>/etc/nginx/sites-available/cg</code></p><pre><code>server {\n    server_name cyphergoat.com;\n\n    location / {\n        proxy_pass http://127.0.0.1:4200;\n        proxy_set_header Host $host;\n        proxy_set_header X-Real-IP $remote_addr;\n        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n        proxy_set_header X-Forwarded-Proto $scheme;\n    }\n\n    location /static/ {\n        alias /var/www/static/;\n        expires 30d;\n    }\n\n    # Optional robots.txt\n    location = /robots.txt {\n        root /var/www/static;\n        access_log off;\n        log_not_found off;\n    }\n\n    listen 80;\n}\n</code></pre><p>I have also set up certbot to have an SSL cert.</p><p>\\\nYou can set certbot by running:</p><pre><code>sudo apt install certbot python3-certbot-nginx -y\n</code></pre><pre><code>sudo certbot --nginx -d cyphergoat.com\n</code></pre><p>I am currently making my website accessible using Cloudflare pages. It is an extremely easy-to-use port-forwarding solution.</p><p>\\\nTo do this, you will need a Cloudflare account and a domain pointed to Cloudflare.</p><p>\\\nUnder  click on  and then </p><p>\\\nOnce created, you should <code>Install and run a connector</code>; follow the instructions on the page for your specific setup.</p><p>\\\nAfter the connector is running, you should click on the  tab and .</p><p>\\\nNow, you should see something like this:  </p><p>\\\nFill in the info as I have. The service type should be , and the URL should be  or </p><p>\\\nObviously, there is no reason to make your API publicly accessible when deploying your website.</p><p>In order to deploy my binaries, I went ahead and created a quick bash script:</p><pre><code>cd api\ngo build -o ../builds/ .\n\ncd ../web\n\ntempl generate &amp;&amp; go build -o ../builds/web cmd/main.go\n\ncd ..\nrsync -urvP ./builds/ user@SERVER:/home/user/cyphergoat\nrsync -urvP ./web/static user@SERVER:/home/user/cyphergoat/\nrsync -urvP ./api/coins.json user@SERVER:/user/user/cyphergoat/\n</code></pre><p>The script will build the API, generate the templ files build the WebUI, and then send everything over to my server (including the static folder).</p><p>\\\nI then ssh into my server:</p><p>\\\nAnd then restart the services.</p><p><code>sudo systemctl restart cg-api cg-web</code></p>","contentLength":5501,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Here's Why Your AI Has Bad Humor","url":"https://hackernoon.com/heres-why-your-ai-has-bad-humor?source=rss","date":1741460407,"author":"Chenuli J.","guid":656,"unread":true,"content":"<p>Have you ever asked an AI model to tell you a joke and received something painfully unfunny? Something like:</p><blockquote><p>Why do programmers prefer dark mode? Because light attracts bugs!</p></blockquote><p>\\\nMore often than not, these so-called jokes generated by AI are weird and extremely predictable. The reason? It’s a machine! They do not have a human context— all it sees are patterns in the data they have been trained on, and when we ask them to tell a joke, they stitch together words based on probabilities rather than actual wit or comedic timing.</p><p>\\\nThis is not rocket science for someone who works with AI, but it’s interesting to see <strong>what makes it the way it is</strong>. With that understanding, you might also figure out how to <strong>“ask“ AI models for better jokes</strong>.</p><h3><strong>AI “learns“ what a joke looks like</strong></h3><p>An AI model (say, GPT or a joke-telling bot) isn't born with a sense of humor. Instead, it learns from thousands of joke examples scraped from books, websites, and conversations. But instead of  humor like we do, it recognizes statistical patterns.</p><p>\\\nHere's an oversimplified look at how an AI model might process joke structures (completely different code, just for your understanding):</p><pre><code>import random\nsetup = [\"Why did the chicken cross the road?\", \"What do you get when you mix AI with a comedian?\", \"Why don't programmers like nature?\"]\npunchline = [\"To get to the other side!\", \"A neural network with bad timing!\", \"Too many bugs.\"]\nprint(random.choice(setup) + \" \" + random.choice(punchline))\n\n# NOTE: This is oversimplified for easier understanding.\n# Real AI models don't just randomly select from pre-written jokes.\n# They use neural networks with billions of parameters to predict \n# the most likely next words based on patterns in their training data.\n</code></pre><p>\\\nSee the problem? It recognizes the  of a joke: first comes the set-up, and second comes the punchlines; it doesn't understand why a joke is funny.</p><h3><strong>AI predicts the next words, not the funniest ones</strong></h3><p>Outputs of AI models, whether humorous or not, s<strong>olely operate on statistical probability</strong>. Large language models like GPT often work by predicting the most statistically likely next word(s). That's great for autocomplete and basic text generation, but terrible for original humor.</p><p>\\\nFor example, if the AI generates the setup: “Why did the chicken cross the road?”</p><p>\\\nIt predicts common responses for the punchline. Since \"To get to the other side\" is the most statistically probable answer, it will often generate that— even though it's the least funny.</p><pre><code>from collections import Counter\n\njokes_dataset = [\"To get to the other side!\", \"Because it was programmed to!\", \"To escape the AI overlords!\"]\nprobabilities = Counter(jokes_dataset)\n\n# chooses the most frequent joke\nprint(probabilities.most_common(1)[0][0])\n</code></pre><p>That’s why they are really predictable and repetitive.</p><h3>AI lacks context and world knowledge</h3><p>Humor, unlike usual text generation, is deeply tied to emotions, human experiences, and cultures. Sad to say, they are the exact things AI fundamentally doesn’t grasp. Even with models trained on vast amounts of data, AI struggles when it comes to:</p><ul><li>Sarcasm: \"Oh great, another AI-generated joke!\"</li><li>Wordplay &amp; Puns: \"An AI walks into a bar… and fails the Turing test.\"</li><li>Social Awareness: \"Why did the AI go to therapy? Because it couldn't process its feelings.\"</li></ul><p>\\\nEven though AI can recognize common joke formats, it doesn't  why something is funny. As a consequence, they try too hard to be funny.</p><pre><code>attempts = [\"I'm hilarious, trust me!\", \"Why did the algorithm break up? It lost its spark!\", \"What's an AI's favorite drink? Java.\"]\nprint(random.choice(attempts))\n</code></pre><p>\\\nAnd then again, who to blame? These are machines trained on not-so-lawfully obtained data. The last thing AI engineers would want to happen is being sued for training AI models on data extracted from stand-up comedians.</p><p>To get better jokes from an AI, you’ve got to be specific. Tell it the style you want (maybe like Louis CK’s dark humor or Chandler Bing’s sarcasm), set the scene, and let it know what kind of humor you’re after. It wouldn’t make it 50 times better, but at least it wouldn’t be so plain and stiff.</p><p>\\\nThat’ll give AI a framework within which to work. Because right now, without context and an understanding of human emotions, all it can do is guess the punchline— usually in the most predictable, robotic way possible.</p><p>\\\nThat’s just 700 words, no summary is needed. See you next time!</p>","contentLength":4424,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Migration to Coldware (COLD)","url":"https://hackernoon.com/the-migration-to-coldware-cold?source=rss","date":1741459438,"author":"Coldware","guid":655,"unread":true,"content":"<p>\\\nThe blockchain space is rapidly evolving, with new projects emerging to address existing challenges and push the boundaries of what decentralized technology can achieve. Solana (SOL), one of the leading blockchain networks, has been a favorite among developers due to its speed and scalability. However, recent issues with network congestion and centralized governance have caused many to reassess their involvement with Solana. As a result, some Solana developers are considering migrating to , a rising blockchain that promises to address many of Solana’s shortcomings with its innovative Layer 1 blockchain solution.</p><p>\\\nSeveral Solana developers are now looking toward Coldware (COLD) as a promising alternative. Coldware’s ability to offer a fully decentralized network, combined with its innovative Layer 1 blockchain, makes it an attractive option for developers seeking a more secure and scalable environment. Solana’s ongoing issues with network congestion and centralization have made many developers reconsider their options, and Coldware’s decentralized nature and focus on scalability provide the perfect solution.</p><p>\\\nAdditionally, Coldware’s focus on , such as integrating blockchain with IoT and physical infrastructure, further sets it apart from Solana (SOL). As more industries look to implement blockchain solutions, Coldware’s approach to decentralized physical infrastructure networks (DePin) could become a key differentiator in the blockchain space.</p><h2>Coldware (COLD) Presents a Decentralized Solution</h2><p> is rapidly gaining attention for its decentralized Layer 1 blockchain, which aims to overcome the limitations faced by Solana (SOL). Coldware’s approach is built around its Mobile Litenodes, a unique innovation that allows individuals to participate in consensus and validation from mobile devices. This decentralized and mobile-first solution ensures that Coldware’s network remains scalable and efficient, even during periods of high traffic.\\</p><p>The ability for Coldware (COLD) to scale effectively through decentralized participation gives it a significant advantage over Solana (SOL). While Solana developers have faced challenges with network congestion and governance, Coldware’s decentralized architecture provides a viable alternative that could attract developers looking for a more sustainable and decentralized platform.</p><h3>Solana (SOL) Faces Scalability and Centralization Issues</h3><p> (SOL) has long been recognized for its high throughput and low transaction costs. However, as its popularity grew, so did the network congestion, particularly during periods of peak demand. Solana’s network, while fast, has suffered from slowdowns and outages, leading to frustrations among developers and users. These scalability issues are compounded by the increasing centralization of the network, which has raised concerns about the long-term sustainability and true decentralization of the platform.</p><p>\\\nSolana developers are now facing a dilemma: continue with Solana (SOL), despite its ongoing issues, or explore alternatives that promise more scalability and decentralization.</p><h3>The Migration to Coldware (COLD)</h3><p>As Solana developers look for alternatives, many are considering migrating to Coldware (COLD) for its decentralized and scalable solution. The transition to  could offer developers the opportunity to build more secure and efficient applications without the constraints of Solana’s current limitations. Coldware’s innovative approach to scalability and decentralization provides an appealing option for developers seeking to avoid the issues faced by Solana’s centralized network.\\</p><p>The growing interest in Coldware (COLD) among Solana developers is a testament to the network’s potential. As more developers migrate to Coldware’s platform, its ecosystem will continue to grow, further cementing its place as a leader in the blockchain space.</p><h3>Final Thoughts: Coldware (COLD) Is Poised to Lead the Next Era of Blockchain</h3><p>While Solana (SOL) has been a dominant player in the blockchain space, its ongoing issues with scalability and decentralization have prompted many developers to seek alternatives. Coldware (COLD) is quickly emerging as the next big thing, with its decentralized Layer 1 blockchain providing a solution to the limitations faced by Solana. As more developers make the switch,  is set to become a major player in the blockchain industry, offering a more secure, scalable, and decentralized platform for the future of blockchain technology.</p><p>\\\nFor more information on the Coldware (COLD) Presale:&nbsp;</p><p>Join and become a community member:&nbsp;\\</p><p>:::info\n<em>This article is published under HackerNoon’s&nbsp;&nbsp;program. Do your own research before making any financial decisions.</em></p>","contentLength":4719,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sam Bankman-Fried Gives a Jailhouse Interview, Seeking a Pardon","url":"https://yro.slashdot.org/story/25/03/08/183254/sam-bankman-fried-gives-a-jailhouse-interview-seeking-a-pardon?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741458840,"author":"EditorDavid","guid":179,"unread":true,"content":"Sam Bankman-Fried — one of the largest donors to the Democratic Party — \"was convicted of fraud, sentenced to 25 years in prison and mostly went silent,\" reports the Wall Street Journal. \"Until recently...\"\n\n\nNow, from behind bars at the Metropolitan Detention Center in Brooklyn, Bankman-Fried is orchestrating an extraordinary public-relations blitz that looks very much like a campaign to make the most audacious trade of his career: support for President Trump's agenda in return for a presidential pardon... \n\nThere is little downside to Bankman-Fried's long-shot effort to secure a pardon. As the appeal that he filed last year works its way through the courts, Bankman-Fried, 33, is staring down a prison sentence that could extend until his 50s... The crowning touch of his campaign came on Thursday, when Bankman-Fried gave a jailhouse interview to \"The Tucker Carlson Show,\" which was released on social-media channels including X and YouTube. Appearing on video in a brown jumpsuit, he criticized Washington bureaucrats and crypto regulators — and suggested that he went to prison out of political retribution... [Carlson's title for the interview? \"Sam Bankman-Fried on Life in Prison With Diddy, and How Democrats Stole His Money and Betrayed Him.\"]\n\n \n\nThe interview hadn't been approved by the Federal Bureau of Prisons, according to a person familiar with the matter. Bankman-Fried spoke with Carlson through a link that is typically used by inmates to communicate with their lawyers, the person said. After the interview, Bankman-Fried was placed in solitary confinement, but he was out by Friday afternoon, according to a person familiar with the matter... Bankman-Fried is trying to highlight in media appearances and in any interaction with Trump's team that FTX customers are set to be made whole with interest through the bankruptcy proceedings — at least in dollar terms. Many of those creditors remain furious that they missed out on bitcoin's rally since November 2022. \nBankman-Fried \"wants to set the record straight on his political beliefs, which he believes have been misconstrued,\" according to the article. \"While he has given heavily to Democrats, he has also donated to Republican causes, including the contribution of millions to a group supporting Senator Mitch McConnell.\" \n\nBut the New York Times, citing \"people with knowledge\" of his pardon-seeking efforts, reported that \"So far, the push does not appear to have gained traction.\"","contentLength":2479,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PayFi Revolution on the Horizon","url":"https://hackernoon.com/payfi-revolution-on-the-horizon?source=rss","date":1741458241,"author":"Coldware","guid":654,"unread":true,"content":"<p>\\\nThe crypto market is filled with potential and uncertainty, especially when considering the futures of established blockchains like Cardano (ADA) and emerging players like Coldware (COLD). </p><p>\\\nWhile Cardano has remained one of the most popular altcoins, its dominance is facing a serious challenge as  unveils its innovative PayFi ecosystem. This new approach to decentralized finance (DeFi) could shake up the market, as whales begin to shift their attention away from ADA in favor of Coldware’s promise of bigger returns.</p><h2>Whales Betting on Bigger Returns: The Future of Coldware’s COLD Token</h2><p>As whales begin to bet on Coldware’s ecosystem, there is growing confidence that the project could outperform ADA in terms of returns. Coldware’s presale success, already raising over $1.3 million, signals that the market is ready for this new, scalable, decentralized platform. With major institutional investors eyeing the project, the potential for a  token price increase is considerable.</p><p>\\\nThe focus on scalability, real-world applications, and decentralized finance makes Coldware a more attractive option for investors looking to maximize their returns. As the project continues to expand its ecosystem, Coldware’s market position is likely to strengthen, challenging Cardano’s dominance in the space.</p><h2>Coldware's PayFi Ecosystem: A New Era for Decentralized Finance</h2><p>Coldware (COLD) has made a bold move by launching its PayFi ecosystem — a decentralized finance platform integrated with IoT technologies. This move places Coldware at the cutting edge of blockchain innovation. The PayFi ecosystem allows users to engage in financial services, from lending to borrowing, all within a decentralized network that utilizes Coldware’s scalable blockchain.</p><p>\\What sets Coldware apart from Cardano (ADA) and others is its  and the integration of physical infrastructure with blockchain technology. Coldware’s ecosystem allows for decentralized applications (dApps) to interact seamlessly with IoT devices, enabling a wide range of industries to adopt blockchain solutions without relying on centralized intermediaries.</p><p>\\\nCardano (ADA) has long been a go-to cryptocurrency for those seeking a balance of security, scalability, and decentralization. However, its growth has often been overshadowed by market volatility and the slow pace of its development. Despite recent surges in price and widespread institutional interest, Cardano (ADA) faces a critical juncture. The question arises: can  continue to maintain its dominance, or will newer platforms like Coldware (COLD) steal the spotlight?</p><p>\\\nThe Cardano ecosystem has been relatively stable, but challenges regarding scalability and its adoption by developers are starting to emerge. The whales who were initially lured by Cardano’s promises are now on the lookout for something more scalable and efficient. Coldware’s launch of its PayFi ecosystem is set to disrupt the crypto space and could attract institutional investors who are looking for real-world applications in the decentralized finance sector.</p><p>While Cardano (ADA) has built a solid foundation in the blockchain space, Coldware’s introduction of the PayFi ecosystem marks the beginning of a new era in decentralized finance. Coldware’s focus on scalability and its integration with IoT networks present a unique value proposition that could propel it ahead of ADA in the coming months. The whales’ growing interest in  token suggests that Coldware is poised to challenge ADA’s dominance.</p><p>As Coldware’s PayFi ecosystem continues to gain traction, ADA’s market position faces a serious challenge. Coldware’s ability to offer scalable, real-world blockchain solutions makes it a worthy contender in the fight for decentralized finance supremacy. With whales betting on Coldware’s success and its growing ecosystem, it’s clear that  is the blockchain to watch in 2025.</p><p>:::info\n<em>This article is published under HackerNoon’s&nbsp;&nbsp;program. Do your own research before making any financial decisions.</em></p>","contentLength":4029,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Week in Review: OpenAI could charge $20K a month for an AI agent","url":"https://techcrunch.com/2025/03/08/week-in-review-openai-could-charge-20k-a-month-for-an-ai-agent/","date":1741457100,"author":"Cody Corrall","guid":367,"unread":true,"content":"<p>Welcome back to Week in Review. This week we’re looking at OpenAI potentially charging $20,000 a month for a specialized AI agent, the unexpected return of early-internet darling Digg, a company genetically engineering mice to have mammoth-like fur, and more! Let’s do this. OpenAI could charge up to $20,000 per month for specialized AI “agents.” […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":424,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Open Source Initiative: AI Debate Roils Board Elections?","url":"https://news.slashdot.org/story/25/03/08/0652240/open-source-initiative-ai-debate-roils-board-elections?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741455240,"author":"EditorDavid","guid":178,"unread":true,"content":"The Open Source Initiative's Board of Directors election \"has become embroiled in controversy...\" writes Steven J. Vaughan-Nichols at The New Stack. \n\n\"The real issue is the community's opposition to the open source AI definition (OSAID), which the organization released last October,\" he adds — but \"the election process has been criticized because the OSI has refused to accept the candidacy of Debian developer Luke Faraone, citing a missed application deadline.\"\nFaraone claims they submitted their application around 9 p.m. PST on Feb. 17, while the OSI maintains the deadline was 11:59 p.m. UTC (3:59 p.m. PST) on the same day. \n\nThe dispute has raised a firestorm about the clarity of communication regarding deadlines and time zones. Critics argue that the deadline's time zone was not clearly specified on the OSI's public-facing website. Tracy Hinds, chair of OSI, acknowledged this oversight but stated that full members received multiple emails with the correct time zone information. \"Everyone who is qualified to run for elections (full members of OSI) received emails with the time zone,\" wrote Hinds, in an email to The New Stack. \"The public-facing web page did not have the time zone, and we've now updated it for clarity going forward. \n\n\"Extending the deadline would be unfair to the other candidates....\" \nOn LinkedIn, Bruce Perens, one of the OSI's founders wrote, \"Open Source Initiative invents rule at the last minute to deny opposition candidate's nomination for their board election.\" \nThere are three board sets up for election in March, the article points out. \"Two well-known figures in the open source world — Richard Fontana, Red Hat's principal commercial counsel and a former OSI board member, and [Bradley] Kuhn, policy fellow and hacker-in-residence at the Software Freedom Conservancy — are running on a joint platform of repealing the open source AI definition.\" \n\nIn a blog post Faraone promised a similar platform (also supporting a repeal of the definition) — had their candidacy not been rejected.","contentLength":2047,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Wine Releases Framework Mono 6.14 In Taking Over The Mono Project","url":"https://www.phoronix.com/news/Wine-Framework-Mono-6.14","date":1741454892,"author":"Michael Larabel","guid":764,"unread":true,"content":"<article>Last year Microsoft donated the Mono Project to Wine for its stewardship under the WineHQ umbrella. Today marks the Framework Mono 6.14 release as the first major Mono release in five years and the first under the WineHQ organization...</article>","contentLength":236,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"WebAssembly on Kubernetes: What You Need to Know","url":"https://hackernoon.com/webassembly-on-kubernetes-what-you-need-to-know?source=rss","date":1741453203,"author":"Nicolas Fränkel","guid":653,"unread":true,"content":"<p>Like a couple of innovative technologies, different people have different viewpoints on where WebAssembly fits the technology landscape.</p><blockquote><p>WebAssembly (also called Wasm) is certainly the subject of much hype right now. But what is it? Is it the JavaScript Killer? Is it a new programming language for the web? Is it (as we like to say) the next wave of cloud compute? We’ve heard it called many things: a better eBPF, the alternative to RISC V, a competitor to Java (or Flash), a performance booster for browsers, a replacement for Docker.</p></blockquote><p>\\\nIn this post, I'll stay away from these debates and focus solely on how to use WebAssembly on Kubernetes.</p><h2>My Approach and the Use Case</h2><p>Unlike regular programming languages, you don't write WebAssembly directly: you write code that generates WebAssembly. At the moment, Go and Rust are the main source languages. I know Kotlin and Python are working toward this objective. There might be other languages I'm not aware of.</p><p>\\\nI've settled on Rust for this post because of my familiarity with the language. In particular, I'll keep the same code across three different architectures:</p><ul><li>Regular Rust-to-native code as the baseline</li><li>Rust-to-WebAssembly using a WasmEdge embedded runtime</li><li>Rust-to-WebAssembly using an external runtime</li></ul><p>\\\nDon't worry; I'll explain the difference between the two last approaches later.</p><p>\\\nThe use case should be more advanced than Hello World to highlight the capabilities of WebAssembly. I've implemented an HTTP server mimicking a single endpoint of the excellent <a href=\"https://httpbin.org/\">httpbin</a> API testing utility. The code itself is not essential as the post is not about Rust, but in case you're interested, you can find it on <a href=\"https://github.com/ajavageek/wasm-kubernetes/blob/master/src/main.rs\">GitHub</a>. I add a field to the response to explicitly return the underlying approach, respectively , , or .</p><h2>Baseline: Regular Rust-to-native</h2><p>For the regular native compilation, I'm using a multistage Docker file:</p><pre><code>FROM rust:1.84-slim AS build                                             #1\n\nRUN &lt;&lt;EOB                                                                #2\n  apt-get update\n  apt-get install -y musl-tools musl-dev\n  rustup target add aarch64-unknown-linux-musl                           #3\nEOB\n\nWORKDIR /native\n\nCOPY native/Cargo.toml Cargo.toml\n\nWORKDIR /\n\nCOPY src src\n\nWORKDIR /native\n\nRUN RUSTFLAGS=\"-C target-feature=+crt-static\" cargo build --target aarch64-unknown-linux-musl --release #4\n\nFROM gcr.io/distroless/static                                            #5\n\nCOPY --from=build /native/target/aarch64-unknown-linux-musl/release/httpbin httpbin #6\n\nENTRYPOINT [\"./httpbin\"]\n</code></pre><ol><li>Start from the latest Rust image</li><li>Install the necessary toolchain to cross-compile</li><li>I could potentially use , but after reading <a href=\"https://labs.iximiuz.com/tutorials/pitfalls-of-from-scratch-images\">this</a>, I prefer to use distroless</li><li>Copy the executable from the previous compilation phase</li></ol><p>\\\nThe final  image weighs 8.71M, with its base image  taking 6.03M of them.</p><p>The main idea behind WebAssembly is that it's secure because it can't access the host system. However, we must open a socket to listen to incoming requests to run an HTTP server. WebAssembly can't do that. We need a runtime that provides this feature and other system-dependent capabilities. It's the goal of WebAssembly System Interface.</p><blockquote><p>The WebAssembly System Interface (WASI) is a group of standards-track API specifications for software compiled to the W3C WebAssembly (Wasm) standard. WASI is designed to provide a secure standard interface for applications that can be compiled to Wasm from any language, and that may run anywhere—from browsers to clouds to embedded devices.</p></blockquote><p>\\\nThe specification <a href=\"https://wasi.dev/interfaces#wasi-02\">v0.2</a> defines the following system interfaces:</p><ul></ul><p>\\\nA couple of runtimes already implement the specification:</p><p>\\\nI had to choose without being an expert in any of these. I finally decided on WasmEdge because of its focus on the Cloud.</p><p>\\\nWe must intercept code that calls with system APIs and redirect them to the runtime. Instead of runtime interception, the Rust ecosystem provides a patch mechanism: we replace code that calls system APIs with code that calls WASI APIs. We must know which dependency calls which system API and hope a patch exists for our dependency version.</p><pre><code>[patch.crates-io]\ntokio = { git = \"https://github.com/second-state/wasi_tokio.git\", branch = \"v1.36.x\" }  #1-2\nsocket2 = { git = \"https://github.com/second-state/socket2.git\", branch = \"v0.5.x\" }    #1\n\n[dependencies]\ntokio = { version = \"1.36\", features = [\"rt\", \"macros\", \"net\", \"time\", \"io-util\"] }     #2\naxum = \"0.8\"\nserde = { version = \"1.0.217\", features = [\"derive\"] }\n</code></pre><ol><li>Patch the  and  crates with WASI-related calls</li><li>The latest  crate is 1.43, but the latest (and only) patch is v1.36. We can't use the latest version because there's no patch.</li></ol><p>\\\nWe must change the Dockerfile to compiler WebAssembly code instead of native:</p><pre><code>FROM --platform=$BUILDPLATFORM rust:1.84-slim AS build\n\nRUN &lt;&lt;EOT bash\n    set -ex\n    apt-get update\n    apt-get install -y git clang\n    rustup target add wasm32-wasip1                                      #1\nEOT\n\nWORKDIR /wasm\n\nCOPY wasm/Cargo.toml Cargo.toml\n\nWORKDIR /\n\nCOPY src src\n\nWORKDIR /wasm\n\nRUN RUSTFLAGS=\"--cfg wasmedge --cfg tokio_unstable\" cargo build --target wasm32-wasip1 --release &lt;2&gt;&lt;3&gt;\n</code></pre><ol><li>We must activate the  flag, as well as the  one, to successfully compile to WebAssembly</li></ol><p>\\\nAt this stage, we have two options for the second stage:</p><ul><li><p>Use the WasmEdge runtime as a base image:</p></li></ul><pre><code>  FROM --platform=$BUILDPLATFORM wasmedge/slim-runtime:0.13.5\n\n  COPY --from=build /wasm/target/wasm32-wasip1/release/httpbin.wasm /httpbin.wasm\n\n  CMD [\"wasmedge\", \"--dir\", \".:/\", \"/httpbin.wasm\"]\n</code></pre><p>\\\n  From a usage perspective, it's pretty similar to the native approach.</p><ul><li><p>Copy the WebAssembly file and make it a runtime responsibility:</p></li></ul><pre><code>  FROM scratch\n\n  COPY --from=build /wasm/target/wasm32-wasip1/release/httpbin.wasm /httpbin.wasm\n\n  ENTRYPOINT [\"/httpbin.wasm\"]\n</code></pre><p>\\\n  It's where things get interesting.</p><p>\\\nThe  approach is slightly better than the  one, but the  is the leanest since it contains only a single Webassembly file.</p><h2>Running the Wasm image on Docker</h2><p>Not all Docker runtimes are equal, and to run Wasm workloads, we need to delve a bit into the Docker name. While Docker, the company, created Docker as the product, the current reality is that containers have evolved beyond Docker and now answer to specifications.</p><blockquote><p>The <strong>Open Container Initiative</strong> is an open governance structure for the express purpose of creating open industry standards around container formats and runtimes.</p><p>\\\n  Established in June 2015 by Docker and other leaders in the container industry, the OCI currently contains three specifications: the Runtime Specification (runtime-spec), the Image Specification (image-spec) and the Distribution Specification (distribution-spec). The Runtime Specification outlines how to run a “filesystem bundle” that is unpacked on disk. At a high-level an OCI implementation would download an OCI Image then unpack that image into an OCI Runtime filesystem bundle. At this point the OCI Runtime Bundle would be run by an OCI Runtime.</p></blockquote><p>\\\nFrom then on, I'll use the proper terminology for OCI images and containers. Not all OCI runtimes are equal, and far from all of them can run Wasm workloads: OrbStack, my current OCI runtime, can't, but <a href=\"https://docs.docker.com/desktop/features/wasm/\">Docker Desktop can</a>, as an  feature. As per the documentation, we must:</p><ul><li>Use  for pulling and storing images</li></ul><p>\\\nFinally, we can run the above OCI image containing the Wasm file by selecting a Wasm runtime, Wasmedge, in my case. Let's do it:</p><pre><code>docker run --rm -p3000:3000 --runtime=io.containerd.wasmedge.v1 ghcr.io/ajavageek/wasm-kubernetes:runtime\n</code></pre><p>\\\n<code>io.containerd.wasmedge.v1</code> is the current version of the Wasmedge runtime. You must be authenticated with GitHub if you want to try it out.</p><pre><code>curl localhost:3000/get\\?foo=bar | jq\n</code></pre><p>\\\nThe result is the same as for the native version:</p><pre><code>{\n  \"flavor\": \"runtime\",\n  \"args\": {\n    \"foo\": \"bar\"\n  },\n  \"headers\": {\n    \"accept\": \"*/*\",\n    \"host\": \"localhost:3000\",\n    \"user-agent\": \"curl/8.7.1\"\n  },\n  \"url\": \"/get?foo=bar\"\n}\n</code></pre><p>\\\nWasi on Docker Desktop allows you to spin up an HTTP server that behaves like a regular native image! Even better, the image size is as tiny as the WebAssembly file it contains:</p><h2>Running the Wasm Image on Kubernetes</h2><p>Now comes the fun part: your favorite Cloud provider(s) isn't using Docker Desktop. Despite this, we can still run WebAssembly workloads on Kubernetes. For this, we need to understand a bit about the not-too-low levels of what happens when you run a container, regardless of whether it's from an OCI runtime or Kubernetes.</p><p>\\\nThe latter executes a process; in our case, it's . Yet,  is only an orchestrator of other container processes. It detects the \"flavor\" of the container and calls the relevant executable. For example, for \"regular\" containers, it calls  via a . The good thing is that we can install other shims dedicated to other container types, such as Wasm. The following illustration, taken from  the <a href=\"https://wasmedge.org/docs/develop/deploy/intro/\">Wasmedge website</a>, summarizes the flow:</p><p>Despite some of the <a href=\"https://learn.microsoft.com/en-us/azure/aks/use-wasi-node-pools\">mainstream</a><a href=\"https://www.spinkube.dev/docs/install/azure-kubernetes-service/\">Cloud providers</a> offering Wasm integration, none of them provide such a low-level one. I'll continue on my laptop, but Docker Desktop doesn't offer a direct integration either: it's time to be creative. For example, <a href=\"https://minikube.sigs.k8s.io/\">minikube</a> is a full-fledged Kubernetes distribution that creates an intermediate Linux virtual machine within a Docker environment. We can SSH into the VM and configure it to our heart's content. Let's start by installing .</p><p>\\\nNow, we start  with the  driver and specify a profile to enable differently configured VMs. We unimaginatively call this profile .</p><pre><code>minikube start --driver=docker --container-runtime=containerd -p=wasm\n</code></pre><p>\\\nDepending on whether you have already installed  and whether it has already downloaded its images, starting can take a few seconds to dozens of minutes. Be patient. The output should be something akin to:</p><pre><code>😄  [wasm] minikube v1.35.0 on Darwin 15.1.1 (arm64)\n✨  Using the docker driver based on user configuration\n📌  Using Docker Desktop driver with root privileges\n👍  Starting \"wasm\" primary control-plane node in \"wasm\" cluster\n🚜  Pulling base image v0.0.46 ...\n❗  minikube was unable to download gcr.io/k8s-minikube/kicbase:v0.0.46, but successfully downloaded docker.io/kicbase/stable:v0.0.46@sha256:fd2d445ddcc33ebc5c6b68a17e6219ea207ce63c005095ea1525296da2d1a279 as a fallback image\n🔥  Creating docker container (CPUs=2, Memory=12200MB) ...\n📦  Preparing Kubernetes v1.32.0 on containerd 1.7.24 ...\n    ▪ Generating certificates and keys ...\n    ▪ Booting up control plane ...\n    ▪ Configuring RBAC rules ...\n🔗  Configuring CNI (Container Networking Interface) ...\n🔎  Verifying Kubernetes components...\n    ▪ Using image gcr.io/k8s-minikube/storage-provisioner:v5\n🌟  Enabled addons: storage-provisioner, default-storageclass\n🏄  Done! kubectl is now configured to use \"wasm\" cluster and \"default\" namespace by default\n</code></pre><p>\\\nAt this point, our goal is to install on the underlying VM:</p><ul><li>Wasmedge to run Wasm workloads</li><li>A shim to bridge between  and </li></ul><p>\\\nWe can install Wasmedge, but I found nowhere to download the shim. In the <a href=\"https://wasmedge.org/docs/develop/deploy/cri-runtime/containerd\">next step</a>, we will build both. We first need to install Rust:</p><pre><code>curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh\n</code></pre><p>\\\nThe script likely complains that it can't execute the downloaded binary:</p><pre><code>Cannot execute /tmp/tmp.NXPz8utAQx/rustup-init (likely because of mounting /tmp as noexec).\nPlease copy the file to a location where you can execute binaries and run ./rustup-init.\n</code></pre><p>\\\nFollow the instructions:</p><pre><code>cp /tmp/tmp.NXPz8utAQx/rustup-init .\n./rustup-init\n</code></pre><p>\\\nProceed with the default installation by pressing the  button. When it's finished, source your current shell.</p><p>\\\nThe system is ready to build Wasmedge and the shim.</p><pre><code>sudo apt-get update\nsudo apt-get install -y git\n\ngit clone https://github.com/containerd/runwasi.git\n\ncd runwasi\n./scripts/setup-linux.sh\n\nmake build-wasmedge\nINSTALL=\"sudo install\" LN=\"sudo ln -sf\" make install-wasmedge\n</code></pre><p>\\\nThe last step requires configuring the  process with the shim. Insert the following snippet in the <code>[plugins.\"io.containerd.grpc.v1.cri\".containerd.runtimes]</code> section of the <code>/etc/containerd/config.toml</code> file:</p><pre><code>        [plugins.\"io.containerd.grpc.v1.cri\".containerd.runtimes.wasmedgev1]\n          runtime_type = \"io.containerd.wasmedge.v1\"\n</code></pre><p>\\\nRestart  to load the new config.</p><pre><code>sudo systemctl restart containerd\n</code></pre><p>\\\nOur system is finally ready to accept Webassembly workloads. Users can deploy a Wasmedge  with the following manifest:</p><pre><code>apiVersion: node.k8s.io/v1\nkind: RuntimeClass\nmetadata:\n  name: wasmedge                                                         #1\nhandler: wasmedgev1                                                      #2\n---\napiVersion: v1\nkind: Pod\nmetadata:\n  name: runtime\n  labels:\n    arch: runtime\nspec:\n  containers:\n    - name: runtime\n      image: ghcr.io/ajavageek/wasm-kubernetes:runtime\n  runtimeClassName: wasmedge                                             #3\n</code></pre><ol><li>Wasmedge workloads should use this name</li><li>Handler to use. It should be the last segment of the section added in the TOML file, , <code>containerd.runtimes.wasmedgev2</code></li><li>Point to the runtime class name we defined just above</li></ol><p>\\\nI used a single  instead of a full-fledged  to keep things simple.</p><p>\\\nNotice the many levels of indirection:</p><ol><li>The  refers to the  runtime class name</li><li>The  runtime class points to the  handler</li><li>The  handler in the TOML file specifies the <code>io.containerd.wasmedge.v1</code> runtime type</li></ol><p>To compare the approaches and test our work, we can use the  addon and <a href=\"https://www.vcluster.com/\">vCluster</a>. The former offers a single access point for all three workloads, , , and , while vCluster isolates workloads from each other in their virtual cluster.</p><p>\\\nLet's start by installing the addon:</p><pre><code>minikube -p wasm addons enable ingress\n</code></pre><p>\\\nIt deploys an Nginx Ingress Controller in the  namespace:</p><pre><code>💡  ingress is an addon maintained by Kubernetes. For any concerns contact minikube on GitHub.\nYou can view the list of minikube maintainers at: https://github.com/kubernetes/minikube/blob/master/OWNERS\n💡  After the addon is enabled, please run \"minikube tunnel\" and your ingress resources would be available at \"127.0.0.1\"\n    ▪ Using image registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.4.4\n    ▪ Using image registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.4.4\n    ▪ Using image registry.k8s.io/ingress-nginx/controller:v1.11.3\n🔎  Verifying ingress addon...\n🌟  The 'ingress' addon is enabled\n</code></pre><p>\\\nWe must create a dedicated virtual cluster to deploy the  later.</p><pre><code>helm upgrade --install runtime vcluster/vcluster --namespace runtime --create-namespace  --values vcluster.yaml\n</code></pre><p>\\\nWe will define the , the , and their related  in each virtual cluster. We need vCluster to synchronize the  with the Ingress Controller. Here's the configuration to achieve this:</p><pre><code>sync:\n  toHost:\n    ingresses:\n      enabled: true\n</code></pre><p>\\\nThe output should be similar to:</p><pre><code>Release \"runtime\" does not exist. Installing it now.\nNAME: runtime\nLAST DEPLOYED: Thu Jan 30 11:53:14 2025\nNAMESPACE: runtime\nSTATUS: deployed\nREVISION: 1\nTEST SUITE: None\n</code></pre><p>\\\nWe can amend the above manifest with the  and  to expose the :</p><pre><code>apiVersion: v1\nkind: Service\nmetadata:\n  name: runtime\nspec:\n  type: ClusterIP                                                        #1\n  ports:\n    - port: 3000                                                         #1\n  selector:\n    arch: runtime\n---\napiVersion: networking.k8s.io/v1\nkind: Ingress\nmetadata:\n  name: runtime\n  annotations:\n    nginx.ingress.kubernetes.io/use-regex: \"true\"                        #2\n    nginx.ingress.kubernetes.io/rewrite-target: /$2                      #2\nspec:\n  ingressClassName: nginx\n  rules:\n    - host: localhost\n      http:\n        paths:\n          - path: /runtime(/|$)(.*)                                      #4\n            pathType: ImplementationSpecific                             #4\n            backend:\n              service:\n                name: runtime\n                port:\n                  number: 3000\n</code></pre><ol><li>Expose the  inside the cluster</li><li>Nginx-specific annotations to handle path regular expression and rewrite it</li></ol><p>\\\nNginx will forward all requests starting with  to the  service, removing the prefix. To apply the manifest, we first connect to the previously created virtual cluster:</p><pre><code>11:53:21 info Waiting for vcluster to come up...\n11:53:39 done vCluster is up and running\n11:53:39 info Starting background proxy container...\n11:53:39 done Switched active kube context to vcluster_embed_embed_vcluster_runtime_runtime_wasm\n- Use `vcluster disconnect` to return to your previous kube context\n- Use `kubectl get namespaces` to access the vcluster\n</code></pre><p>\\\nNow, apply the manifest:</p><pre><code>kubectl apply -f runtime.yaml\n</code></pre><p>\\\nWe do the same with the  and the  pods, barring the  as they are \"regular\" images.</p><p>\\\nThe final deployment diagram is the following:</p><p>The final touch is to tunnel to expose services:</p><pre><code>✅  Tunnel successfully started\n\n📌  NOTE: Please do not close this terminal as this process must stay alive for the tunnel to be accessible ...\n\n❗  The service/ingress runtime-x-default-x-runtime requires privileged ports to be exposed: [80 443]\n🔑  sudo permission will be asked for it.\n🏃  Starting tunnel for service runtime-x-default-x-runtime.\nPassword:\n</code></pre><p>\\\nLet's request the lightweight container that uses the Wasmedge runtime:</p><pre><code>curl localhost/runtime/get\\?foo=bar | jq\n</code></pre><p>\\\nWe get the expected output:</p><pre><code>{\n  \"flavor\": \"runtime\",\n  \"args\": {\n    \"foo\": \"bar\"\n  },\n  \"headers\": {\n    \"user-agent\": \"curl/8.7.1\",\n    \"x-forwarded-host\": \"localhost\",\n    \"x-request-id\": \"dcbdfde4715fbfc163c7c9098cbdf077\",\n    \"x-scheme\": \"http\",\n    \"x-forwarded-for\": \"10.244.0.1\",\n    \"x-forwarded-scheme\": \"http\",\n    \"accept\": \"*/*\",\n    \"x-real-ip\": \"10.244.0.1\",\n    \"x-forwarded-proto\": \"http\",\n    \"host\": \"localhost\",\n    \"x-forwarded-port\": \"80\"\n  },\n  \"url\": \"/get?foo=bar\"\n}\n</code></pre><p>\\\nWe should get similar results with the other approaches, with different  values.</p><p>In this post, I showed how to use Webassembly on Kubernetes with the Wasmedge runtime. I created three flavors for comparison purposes: , , and . The first two are \"regular\" Docker images, while the latter contains only a single Wasm file, which makes it very lightweight and secure. However, we need a dedicated runtime to run it.</p><p>\\\nRegular managed Kubernetes services don't allow configuring an additional shim, such as the Wasmedge shim. Even on my laptop, I had to be creative to make it happen. I had to use Minikube and put much effort into configuring its intermediate virtual machine to run Wasm workloads on Kubernetes. Yet, I managed to run all three images inside their virtual cluster, exposed outside the cluster by an Nginx Ingress Controller.</p><p>\\\nNow, it's up to you to decide whether the extra effort is worth the 10x reduction of image size and the improved security. I hope the future will improve the support so that the pros outweigh the cons.</p><p>\\\nThe complete source code for this post can be found on GitHub.</p>","contentLength":18825,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"9 US AI startups have raised $100M or more in 2025","url":"https://techcrunch.com/2025/03/08/9-us-ai-startups-have-raised-100m-or-more-in-2025/","date":1741453200,"author":"Rebecca Szkutak","guid":366,"unread":true,"content":"<p>Last year was a monumental year for the AI industry in the U.S. and beyond. There were 49 startups that raised funding rounds worth $100 million or more in 2024, per our count at TechCrunch. Three companies raised more than one “mega-round” last year, and seven companies raised rounds at $1 billion or larger. How […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":387,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The PlumTree Algorithm (PTA) in the Solana Gossip Protocol: Some Thoughts","url":"https://hackernoon.com/the-plumtree-algorithm-pta-in-the-solana-gossip-protocol-some-thoughts?source=rss","date":1741452304,"author":"0xwizzdom","guid":652,"unread":true,"content":"<p>&nbsp;A message sent to nodes in the network to depict the availability of data each node requires.</p><p>\\\n: This is a message sent to a node that queries for the data specified in the&nbsp;&nbsp;message.</p><p>\\\n: A&nbsp;&nbsp;of a graph is a subset of the graph that connects all its vertices with the minimum number of edges without forming any cycles.</p><p>Blockchain is gaining massive attention as support for cryptocurrencies due to the rapid growth of memecoins and the celebrated launch of cryptocurrencies. However, one key challenge in blockchain networks is the efficient propagation of messages between nodes, which leads to communication resource consumption. In traditional gossip protocol, a key problem plaguing it is the latency issue—a node must wait for the next cycle to transmit a message.</p><p>\\\nThe Plumtree algorithm is designed to reduce latency and redundancy in message transmission, particularly in peer-to-peer networks and distributed systems where reliable and fast message dissemination is important. It can achieve this by finding the shortest path to send the message to the next node in the&nbsp;. By doing this, each node participates in forwarding messages without relying on a central source.</p><p>\\\nThis article delves into the implementation of the Plumtree algorithm in the Solana network and its role in increasing the speed of message propagation in the network. Furthermore, a comparison between Plumtree and GossipSub, a gossip-based epidemic broadcast algorithm used in Ethereum.</p><p>In Solana, a gossip-based block propagation method is as follows: when a node receives a new block, it sends a&nbsp;&nbsp;message to other nodes in the network. This broadcast includes information about the new block, such as the block header, transaction data, state changes, and other metadata like compressed data, etc. Upon receiving the&nbsp;&nbsp;message, the receiving node checks if it already has the block in its ledger history. When the nodes check its history and have no record of that block, it sends a&nbsp;&nbsp;request back to the broadcasting node, querying for the block data.</p><p>\\\nWhen the node receives the data of the queried block, it verifies it and adds it to the network. This ensures that the node does not share the block data with every other node in the network repeatedly.</p><p>The plum is a fruit of the Prunus species,&nbsp;, a genus of trees that also includes peach, cherry, nectarine, almond, and apricot trees. Plums have a lot of health benefits. They contain a lot of nutrients, are rich in antioxidants, promote bone health, and help lower blood sugar. China and Romania are the two largest plum producers.</p><p>The main sources of inspiration for the Plumtree algorithm are as follows:</p><ul><li>The flowering of the plum trees in the early spring.</li><li>The transformation of the pollinated flowers to plums.</li><li>The plums drop before maturity by 20–30% due to various reasons or diseases, such as diseases caused by plant viruses.</li><li>The plums have a shelf life of around 2–6 weeks, even when they are stored at 0 °C.</li></ul><p>\\\nThe Plumtree algorithm implements these sources of inspiration as follows: the positions of the flowers and the positions of the plums are represented as matrices; the dropping of the plums before maturity is represented by a&nbsp;&nbsp;(FT), and the shelf life of the plums after they are collected is represented by a&nbsp;&nbsp;(RT). The two thresholds lead to the development of three types of equations to update the positions of the flowers.</p><p>Plumtree is a broadcast method that combines tree-based and gossip-based approaches to reduce redundancy while maintaining high message reliability. In a tree-based broadcast, each node transmits and improves efficiency by forwarding messages only in a tree-based manner. It also uses gossip-based links between nodes to properly handle inter-node failures.</p><p>\\\nIn a tree-based broadcast, a tree consisting of all participant nodes is constructed, and messages are transmitted only along the tree, which reduces the redundancy of messages. However, if the number of nodes increases or decreases or if a network failure occurs, the tree becomes incomplete, and a message may not reach all nodes. For instance, the block is broadcasted, and a&nbsp;&nbsp;is constructed using the Plumtree algorithm. In subsequent broadcasts, the constructed tree is used. If the exchange of&nbsp;&nbsp;and&nbsp;&nbsp;messages is omitted, the blocks are not sent directly to the child nodes of the tree and hence fail.</p><p>In Gossip-based broadcast, when a node attempts to broadcast a message, the node randomly selects nodes to send the message. The node that receives the message for the first time repeats this process to send the message, which not only provides high scalability but also makes the system more resistant to network inadequacies and node failures. </p><p>\\\nFor instance, when a node broadcasts a message, it randomly chooses a node to send it to. The node that receives the message for the first time repeats this process. This property allows the system to respond flexibly to network failures and increases or decreases in the number of nodes.</p><p>\\\nThe following approaches are utilized in the Gossip-based broadcast to disseminate data:</p><ul><li>: In this approach, once a message is received, it is sent to the neighboring nodes immediately.</li><li>: In this approach, when a node receives a message, it sends the message identifier to the neighboring nodes. If the node has not received the message, it makes a pull request to the neighboring nodes.</li><li>: Once a node has not received a message, it makes a query to its neighboring nodes—&nbsp;on recently received messages to update its state with that particular message.</li></ul><p>\\\nPlumtree uses a combination of an Eager push mechanism for sending a small number of messages and a Lazy push mechanism for assisting transmission.</p><p>Solana utilizes a peer-to-peer communication approach combined with a Plumtree tree-inspired algorithm, allowing for efficient dissemination of data throughout the network of nodes without depending on a central source. This structure enables messages within the network to be disseminated hierarchically, with nodes directly interacting and making each node in the network operate autonomously in relaying messages to the subsequent node in the tree.</p><p>A spanning tree structure is constructed using the Plumtree algorithm for the nodes in the Solana network, allowing for a more scalable approach to broadcasting information throughout the network. In basic terms, every node shares messages with its direct neighbors, who in turn, propagate the information across the spanning tree.</p><p>The differences between the Plumtree algorithm and GossipSub used for information broadcasting in Solana and Ethereum, respectively, include:</p><ul><li>Solana Tree-based PTA uses a&nbsp;&nbsp;approach where nodes are connected in a hierarchical manner where the parent node is connected to the child node. The focus is on building an optimal routing path over time through message duplication handling, while GossipSub utilizes&nbsp;, where nodes subscribe to specific topics related to validator duties and communication within the Ethereum network. These overlays self-optimize to find the shortest path for message dissemination.</li></ul><ul><li>Solana Tree-based PTA uses&nbsp;&nbsp;but focuses on handling message redundancy by downgrading peers with suboptimal message paths, while in GossipSub, messages are disseminated via a&nbsp;<strong>random epidemic broadcast</strong>.</li></ul><p>In this article, we examined the Plumtree algorithm in Solana's Gossip Protocol, highlighting its tree-based and gossip-based approach to efficient message dissemination. We also compared it with Ethereum’s GossipSub, noting its differences.</p>","contentLength":7548,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rayhunter: A Cheap New Tool from EFF to Detect Cellular Spying","url":"https://mobile.slashdot.org/story/25/03/08/0346250/rayhunter-a-cheap-new-tool-from-eff-to-detect-cellular-spying?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741451640,"author":"EditorDavid","guid":177,"unread":true,"content":"Equuleus42 (Slashdot reader #723) brings word that the Electronic Frontier Foundation (EFF) is sharing a new tool for fighting back against cellphone surveillance by Stingray cell-site simulators. \n\n Android Authority reports:\n\n\"Rayhunter\" uses an open-source software package designed to look for evidence of IMSI catchers in action, running on an old Orbic Speed RC400L mobile hotspot. The great thing about that choice is that you can pick one up for practically nothing — we're seeing them listed for barely over $10 on Amazon, and you can find them even cheaper on eBay. There's an installation script for Macs and Linux to automate getting set up, but once the Orbic is flashed with the Rayhunter software, it should be ready go, collecting data about sketchy-looking \"cell towers\" it picks up. \n\nRight now, much of the use of IMSI catchers is still shrouded in mystery, with the groups who regularly employ them extremely hesitant to disclose their methods. As a result, a big focus of this EFF project is just getting more info on how and where these are actually used, giving protestors a better sense of the steps they'll need to take if they want to protect their privacy.\n","contentLength":1186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Chevy Silverado EV vs Rivian R1T: How two EVs handled the iconic Mint 400 off-road race","url":"https://techcrunch.com/2025/03/08/chevy-silverado-ev-vs-rivian-r1t-how-two-evs-handled-the-iconic-mint-400-off-road-race/","date":1741451450,"author":"Emme Hall","guid":365,"unread":true,"content":"<p>Something special went down in the desert outside of Las Vegas this weekend: two EVs took on the Mint 400 for the first time. Since the Mint 400 launched back in 1969, vehicles in this iconic desert endurance race have been powered by dead dinosaurs. Spectators and race participants alike are used to the smell […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":380,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How I Made Autonomous Vehicle AI 40% Faster Without Losing Accuracy","url":"https://hackernoon.com/how-i-made-autonomous-vehicle-ai-40percent-faster-without-losing-accuracy?source=rss","date":1741451403,"author":"Vineeth Reddy Vatti","guid":651,"unread":true,"content":"<p><strong>Autonomous vehicles need to see the world fast and with precision.</strong> But real-time perception is tough when your model is drowning in millions of LiDAR points and high-res images. The solution? <strong>Sensor fusion, model quantization, and a sprinkle of TensorRT acceleration.</strong></p><p>Let me walk you through how I optimized a <strong>multi-modal perception model</strong> to run 40% faster while keeping it sharp enough to dodge pedestrians and parked cars.</p><h2><strong>The Bottleneck: A Million Points, A Million Problems</strong></h2><p>Autonomous vehicles rely on , each with strengths and weaknesses. LiDAR excels at , but it spits out <strong>millions of points per second</strong>. Cameras provide  but lack depth. Fusing both in a single pipeline means balancing .</p><h3><strong>Problem 1: The Lag Between LiDAR and Camera Data</strong></h3><p>By the time LiDAR finishes scanning, the camera has already captured a new frame. This misalignment means object positions don’t match.</p><p> I used  with  to adjust LiDAR points dynamically. Here’s a snippet of how it works in Python:</p><pre><code>import numpy as np\n\nclass EgoMotionCompensation:\n    def __init__(self, initial_pose, process_noise, measurement_noise):\n        self.state = initial_pose  \n        self.P = np.eye(5) * 0.01\n        self.Q = np.diag(process_noise)\n        self.R = np.diag(measurement_noise)\n\n    def predict(self, dt):\n        # Unpack state\n        x, y, yaw, vx, vy = self.state\n        x_pred = x + vx * dt\n        y_pred = y + vy * dt\n        yaw_pred = yaw \n        self.state = np.array([x_pred, y_pred, yaw_pred, vx, vy])\n        F = np.eye(5)\n        F[0, 3] = dt\n        F[1, 4] = dt\n        self.P = F @ self.P @ F.T + self.Q\n\n    def update(self, measurement):\n        #measurement = [x_meas, y_meas, yaw_meas]\n        H = np.array([\n            [1, 0, 0, 0, 0],\n            [0, 1, 0, 0, 0],\n            [0, 0, 1, 0, 0]\n        ])\n        z = np.array(measurement)\n        y_err = z - H @ self.state\n        S = H @ self.P @ H.T + self.R\n        K = self.P @ H.T @ np.linalg.inv(S)\n        self.state += K @ y_err\n        I = np.eye(5)\n        self.P = (I - K @ H) @ self.P\n\n    def apply_correction(self, lidar_points, dt):\n        #predict and update using IMU/odometry\n        self.predict(dt)\n        #Suppose we have a measurement from the IMU or odometry\n        #assume partial measurement [x_meas, y_meas, yaw_meas]\n        measurement = [self.state[0], self.state[1], self.state[2]]\n        self.update(measurement)\n\n        x, y, yaw, _, _ = self.state\n        cos_yaw, sin_yaw = np.cos(yaw), np.sin(yaw)\n        transformed = []\n        for px, py, pz in lidar_points:\n            #rotate and translate\n            x_new = (px * cos_yaw - py * sin_yaw) + x\n            y_new = (px * sin_yaw + py * cos_yaw) + y\n            transformed.append((x_new, y_new, pz))\n        return np.array(transformed)\n</code></pre><p>This tweak <strong>reduced misalignment by 85%</strong>, boosting object detection accuracy.</p><h3><strong>Problem 2: Sensor Fusion: Making LiDAR and Cameras Play Nice</strong></h3><p>Now that we fixed the time lag, we have another issue: LiDAR gives , while cameras provide . We needed a  for both.</p><p>\\\nWe built a <strong>Bird’s Eye View (BEV) model</strong> that projects <strong>LiDAR points onto the image plane</strong> and aligns them with camera pixels.</p><ol><li><strong>Calibrated LiDAR and camera</strong> with intrinsic &amp; extrinsic matrices.</li><li> into the image space.</li><li> using a cross-attention transformer.</li></ol><p>\\\nHere’s how the projection works in Python:</p><pre><code>import torch\nimport torch.nn.functional as F\nimport cv2\nimport numpy as np\n\ndef voxelize_points(lidar_points, voxel_size=(0.1, 0.1, 0.2)):\n    #Transform LiDAR points into 3D voxel indices\n    coords = np.floor(lidar_points / np.array(voxel_size)).astype(int)\n    coords -= coords.min(0)\n    voxels = np.zeros((coords[:,0].max()+1, coords[:,1].max()+1, coords[:,2].max()+1))\n    for (x_idx, y_idx, z_idx) in coords:\n        voxels[x_idx, y_idx, z_idx] += 1\n    return voxels\n\ndef project_voxel_to_image(voxel_coords, camera_matrix, rvec, tvec, voxel_size):\n    \"\"\"\n    Projects 3D voxel centers into image space using a known camera matrix (including distortion).\n    \"\"\"\n    #compute center for each voxel\n    voxel_centers = []\n    for (x_idx, y_idx, z_idx) in voxel_coords:\n        center_x = x_idx * voxel_size[0]\n        center_y = y_idx * voxel_size[1]\n        center_z = z_idx * voxel_size[2]\n        voxel_centers.append([center_x, center_y, center_z])\n\n    voxel_centers = np.array(voxel_centers, dtype=np.float32).reshape(-1, 1, 3)\n    #project to image plane\n    img_pts, _ = cv2.projectPoints(voxel_centers, rvec, tvec, camera_matrix, None)\n    return img_pts\n\ndef fuse_features(camera_features, lidar_features):\n    \"\"\"\n    cross-attention: queries come from camera_features,\n    keys/values from lidar_features, to refine camera representation\n    based on 3D data.\n    \"\"\"\n    #camera_features, lidar_features are [Batch, Channels, Height, Width]\n    fused = torch.cat([camera_features, lidar_features], dim=1)\n    fused = F.relu(F.conv2d(fused, torch.randn(128, fused.size(1), 3, 3)))\n    return fused\n</code></pre><p>This <strong>improved detection by 29%</strong>, helping the model understand its surroundings better.</p><h2><strong>Slashing Inference Time by 40% With TensorRT and Quantization</strong></h2><p>Even with better fusion, inference time was killing us. Running deep learning models on embedded hardware isn’t the same as cloud GPUs. We needed to <strong>shrink the model without losing accuracy</strong>.</p><h3><strong>The Solution: TensorRT + Quantization</strong></h3><ol><li><p><strong>Converted PyTorch to TensorRT</strong>: TensorRT optimizes computation graphs, fuses layers, and reduces memory overhead.</p></li><li><p><strong>Applied INT8 Quantization</strong>: This compressed 32-bit floating points into  making computations .</p></li></ol><p>\\\nQuantization technique that was used:</p><pre><code>import torch\nfrom torch.ao.quantization import (\n    get_default_qconfig_mapping,\n    prepare_fx,\n    convert_fx\n)\n\ndef apply_quantization(model, calibration_data):\n    model.eval()\n\n    #Use a QConfigMapping that sets INT8 or mixed precision\n    qconfig_mapping = get_default_qconfig_mapping(\"fbgemm\")\n    example_inputs = (calibration_data[0].unsqueeze(0), calibration_data[1].unsqueeze(0))\n    prepared_model = prepare_fx(model, qconfig_mapping, example_inputs)\n\n    #Run calibration\n    with torch.no_grad():\n        for data in calibration_data:\n            fused_input = data[0].unsqueeze(0), data[1].unsqueeze(0)\n            prepared_model(*fused_input)\n\n    quantized_model = convert_fx(prepared_model)\n    return quantized_model\n</code></pre><p>\\\nAn example of how I converted the PyTorch model:</p><pre><code>import tensorrt as trt\nimport os\n\ndef build_tensorrt_engine(onnx_file_path, precision=\"int8\", max_batch_size=4, input_shape=(3, 256, 256)):\n    trt_logger = trt.Logger(trt.Logger.INFO)\n    builder = trt.Builder(trt_logger)\n    network_flags = 1 &lt;&lt; int(trt.NetworkDefinitionCreationFlag.EXPLICIT_BATCH)\n    network = builder.create_network(flags=network_flags)\n    parser = trt.OnnxParser(network, trt_logger)\n\n    if not os.path.exists(onnx_file_path):\n        raise FileNotFoundError(f\"ONNX file not found: {onnx_file_path}\")\n\n    with open(onnx_file_path, \"rb\") as f:\n        if not parser.parse(f.read()):\n            for i in range(parser.num_errors):\n                print(parser.get_error(i))\n            raise ValueError(\"Failed to parse the ONNX file.\")\n\n    config = builder.create_builder_config()\n    if precision == \"int8\":\n        config.set_flag(trt.BuilderFlag.INT8)\n    elif precision == \"fp16\":\n        config.set_flag(trt.BuilderFlag.FP16)\n\n    profile = builder.create_optimization_profile()\n    #define min/opt/max batch sizes\n    min_shape = (1,) + input_shape\n    opt_shape = (max_batch_size // 2,) + input_shape\n    max_shape = (max_batch_size,) + input_shape\n\n    input_name = network.get_input(0).name\n    profile.set_shape(input_name, min_shape, opt_shape, max_shape)\n    config.add_optimization_profile(profile)\n\n    engine = builder.build_engine(network, config)\n    return engine\n</code></pre><ul><li>Inference time dropped from 250ms → 75ms per frame.</li><li>Memory footprint reduced by 40%.</li><li>Real-time performance improved to 5 FPS.</li></ul><h2><strong>Next Steps: End-to-End Learning</strong></h2><p>We’re still exploring , where <strong>perception and planning happen in one deep learning pipeline</strong>. The idea? Instead of multiple modules for <strong>object detection, lane estimation, and path planning</strong>, we let a neural network <strong>learn everything from scratch</strong>.</p><p>\\\nSome early results show promise but <strong>training needs massive datasets</strong> and <strong>interpretability is a challenge</strong>. Still, we’re inching toward <strong>fully AI-driven navigation.</strong></p><h2><strong>Final Thoughts: AI That Sees and Thinks Fast</strong></h2><p>By blending <strong>sensor fusion, ego-motion correction, and TensorRT acceleration</strong>, we made autonomous AI . </p><p>\\\nThe next step? <strong>Scaling it beyond research</strong> and . If you’re working on AV models, let’s connect, I’d love to hear how you’re tackling inference speed and perception challenges.</p>","contentLength":8648,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The HackerNoon Newsletter: Ham vs Spam: How to Identify and Classify Spam E-mail (3/8/2025)","url":"https://hackernoon.com/3-8-2025-newsletter?source=rss","date":1741449865,"author":"Noonification","guid":650,"unread":true,"content":"<p>🪐 What’s happening in tech today, March 8, 2025?</p><p>By <a href=\"https://hackernoon.com/u/alexpiskarev\">@alexpiskarev</a> [ 9 Min read ] I built and shut down a €500K neobank for immigrants in Portugal. Heres a post-mortem. <a href=\"https://hackernoon.com/i-built-a-euro500k-neobank-for-immigrantsit-didnt-go-as-planned\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ramakadapala\">@ramakadapala</a> [ 7 Min read ] In this project, some of the machine learning tools were used to see how they perform as classifiers for Ham and Spam emails. <a href=\"https://hackernoon.com/ham-vs-spam-how-to-identify-and-classify-spam-e-mail\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/thefrogsociety\">@thefrogsociety</a> [ 20 Min read ] Research has revealed that a shocking amount of modern design was created with only half the population in mind.  <a href=\"https://hackernoon.com/one-would-think-the-world-was-built-just-as-much-for-women-as-it-is-for-men\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/benoitmalige\">@benoitmalige</a> [ 5 Min read ] Stay calm under stress with these 6 simple techniques. Breathe better, think clearer, and take control.  <a href=\"https://hackernoon.com/stay-calm-in-stressful-situations-with-these-6-proven-techniques\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 4 Min read ] 1 month left to enter Round 1 of the Spacecoin Writing Contest! Write about #decentralized-internet, #spacetech, #blockchain-use-case to compete for 15000 USDT! <a href=\"https://hackernoon.com/one-month-left-to-win-your-share-of-15000-usdt-in-round-1-of-the-spacecoin-writing-contest\">Read More.</a></p><p>🧑‍💻 What happened in your world this week?</p><p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>","contentLength":1112,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"5 devices to help ease your smartphone addiction","url":"https://techcrunch.com/2025/03/08/5-devices-to-help-ease-your-smartphone-addiction/","date":1741449600,"author":"Paul Sawers","guid":364,"unread":true,"content":"<p>The downsides of doomscrolling and screen addiction are well documented, but while many of us would like to spend less time glued to a smartphone, it’s easier said than done. Much has been written about the so-called dumbphone revival, where individuals regain some respite from pings and push notifications by downgrading to a basic feature […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Remembering 'Space Ghost' Voice Actor George Lowe","url":"https://entertainment.slashdot.org/story/25/03/08/0740211/remembering-space-ghost-voice-actor-george-lowe?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741448040,"author":"EditorDavid","guid":176,"unread":true,"content":"Long-time Slashdot reader invisik saw this story on Yahoo News:\n\nComedian and voice actor George Lowe, who is well-known as the voice of Space Ghost on \"Space Ghost Coast to Coast,\" died on March 2. He was 67... \nHe did some voice-over work for TBWS and Cartoon Network in the 1980s to mid-1990s before getting his lead role of Space Ghost in 1994 with the premiere of \"Space Ghost Coast to Coast\" on Cartoon Network. Space Ghost was a parody of talk shows with live-action celebrity guests, hosted by the Hanna Barbera character Space Ghost, which aired from 1994 to 1999 on Cartoon Network. The show later returned in 2001, airing on Adult Swim's late-night programming block until 2004, Deadline reported. \n\nWhen animation pioneer William Hanna died in 2001, Slashdot founder CmdrTaco posted \"the thing that I respect most about Hanna is the fact that a show like Space Ghost Coast to Coast was allowed to take their characters and do something truly unique with them. He even lent his voice to the show in one episode. Not a lot of people would be willing to allow one of their creations to be twisted like that, but the original Space Ghost was one of my childhood staples, and Space Ghost Coast to Coast stands in a class all its own proving that creativity isn't dead on TV.\" \n\n\"Adult Swim would not be the network it is today without Space Ghost Coast to Coast,\" argues ComicBook.com. (And as a tribute to Lowe, Adult Swim posted five minutes of surreal outtakes from Space Ghost Coast to Coast's 10th Anniversary celebration.) \n\n\nA headline at Vulture.com makes the case that \"Space Ghost Coast to Coast Only Worked Because of George Lowe.\" They've rounded up a collection of videos with surreal titles like \"Marrying Bjork\" and \"Guesting on a MF DOOM track\" (plus that time Lowe did a live interview — in his Space Ghost costume — with C-SPAN).","contentLength":1858,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rust Coreutils 0.0.30 Enhances GNU Compatibility, Uutils To Port More Common Unix Tools","url":"https://www.phoronix.com/news/uutils-Coreutils-0.0.30","date":1741446143,"author":"Michael Larabel","guid":763,"unread":true,"content":"<article>The uutils project has released Rust Coreutils 0.0.30 as the newest version of this GNU Coreutils rewrite within the Rust programming language. Uutils developers will also be targeting more common Unix tools to port over to Rust too...</article>","contentLength":235,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In defense tech, Lithuania’s sovereign VC fund is one step ahead","url":"https://techcrunch.com/2025/03/08/in-defense-tech-lithuanias-sovereign-vc-fund-is-one-step-ahead/","date":1741446000,"author":"Anna Heim","guid":363,"unread":true,"content":"<p>Europe is waking up to the need to invest in defense, and so are European VCs. But with a painful history of Soviet occupations, Lithuania didn’t wait for the third anniversary of Russia’s invasion of Ukraine to reach its third anniversary to commit 5% to 6% of its GDP to military spending — and fund […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Coldware Enters the Memecoin Wars","url":"https://hackernoon.com/coldware-enters-the-memecoin-wars?source=rss","date":1741436343,"author":"Coldware","guid":649,"unread":true,"content":"<p>The cryptocurrency market is always shifting, and recent developments show that Dogecoin (DOGE) holders are beginning to cut their losses and look for better opportunities.</p><p>\\\nAs we move further into 2025, Dogecoin (DOGE)—once the darling of meme coins—is facing increasing competition from emerging projects like . While DOGE holders have profited handsomely during its hype cycles, the new wave of decentralized finance (DeFi) is calling, and many are turning their attention to Coldware (COLD) for more substantial, long-term gains.</p><h3>Coldware (COLD): A DeFi Diamond Emerging in 2025</h3><p>On one hand, there is a fair chance that Dogecoin (DOGE) will get all the limelight from here; conversely, Coldware (COLD) would like to position itself as a true DeFi diamond come the year 2025.</p><p>\\\nWith a deep commitment to decentralized finance, Coldware (COLD) provides investors with a fine opportunity to participate in secure, scalable, and functional financial solutions, to say somewhat more under the sun than just the meme coin hype.</p><p>\\\nColdware (COLD) is a project of distinction in the crypto space, owing to its robust platform that combines DeFi offerings such as lending, borrowing, and yield farming with a meme-euphoria. Hence, Coldware (COLD) attracts retail investors and institutional investors and whales alike, requiring a foothold of stability and growth in their portfolios.</p><p>\\\nColdware (COLD) is unique in that it has already begun gaining recognition for its staggering presale with a whopping 1300% gain in valuation in the past period. Therefore, Coldware has begun to make its insightful mark as one of the DeFi leading lights. Coldware guarantees to maintain an appeal as an investment with long-term utility and real-world use cases.</p><p>Dogecoin (DOGE): A Meme Coin with a Legacy</p><p>\\\nThat was a fine introduction to Dogecoin-DOGE-in public originals, as the so-called currency was a hilarious scheme based on the meme ''Doge''. Since then, the \"meme\" has been going through thick and thin, building up a dedicated community and capturing interest from key figures like a majority of investors like Elon Musk among others.</p><p>\\\nBeing social media-driven to viral trends, DOGE has proven time and again to be a speculative asset. From this journey of being currency-like PSG to the market darling, one dream comes true: the demonstration of how far meme culture can go in our age.</p><p>\\\nVery favourable Dogecoin-(DOGE) just has gone hot-and-cold with great discomfort-its value moving with viral spark much more than pillar infrastructure or utility. Although DOGE has loyal devotees, many investors are increasingly questioning the viability of a project that is purely speculative hype; newer projects are starting to offer utility and real-world value-tangibles the market can stand behind.</p><h3>Why Dogecoin Holders Are Moving to Coldware (COLD)</h3><p>Many&nbsp;Dogecoin (DOGE)&nbsp;holders, who have experienced significant volatility and price dips, are now seeking more reliable options.&nbsp;Coldware (COLD)&nbsp;presents a promising opportunity for these investors, offering a token with real utility and a proven growth model. With its secure  platform,&nbsp;Coldware (COLD)&nbsp;offers users the ability to earn passive income through decentralized lending, borrowing, and staking opportunities.</p><p>\\\nIn addition,&nbsp;Coldware (COLD)&nbsp;combines meme culture with genuine utility, making it an appealing choice for those looking to engage in the next wave of cryptocurrency innovation while still enjoying the excitement of community-driven projects.</p><h3>Conclusion: The Shift Towards Utility in 2025</h3><p>As&nbsp;Dogecoin (DOGE)&nbsp;continues to face challenges related to its speculative nature,&nbsp;Coldware (COLD)&nbsp;offers a fresh approach for investors seeking long-term stability and growth. The increasing influx of&nbsp;DOGE&nbsp;holders into&nbsp; reflects the growing demand for utility-driven projects in the crypto space.</p><p>\\\nWith its unique blend of meme culture and decentralized finance,&nbsp;Coldware (COLD)&nbsp;is set to become a major player in the crypto world in 2025, attracting both retail and institutional investors looking for sustainable growth.</p><p>\\\nAs the  matures,&nbsp;Coldware (COLD)&nbsp;stands poised to take the lead with its strong DeFi foundation and exciting future prospects.</p><p>\\\nFor more information on the Coldware (COLD) Presale:</p><p>\\\nJoin and become a community member:</p><p>:::tip\n<em>This article is published under HackerNoon’s&nbsp;&nbsp;program. Do your own research before making any financial decisions.</em></p>","contentLength":4430,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GTK On Android & macOS Seeing Improvements","url":"https://www.phoronix.com/news/GNOME-GTK-Android-macOS","date":1741435654,"author":"Michael Larabel","guid":762,"unread":true,"content":"<article>In addition to Friday's very exciting GNOME 48 release candidate with some last minute features, there have also been some other GNOME-related changes this week to call out...</article>","contentLength":175,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Coldware's Emergence in the IoT Space","url":"https://hackernoon.com/coldwares-emergence-in-the-iot-space?source=rss","date":1741435349,"author":"Coldware","guid":648,"unread":true,"content":"<p>As the cryptocurrency market continues to evolve, newer projects like Coldware (COLD) are gaining traction, especially in sectors where established players like Hedera (HBAR) have dominated.</p><p>\\\nColdware’s unique position in the IoT sector is catching the attention of investors and analysts alike, raising the question whether it will soon surpass the likes of Hedera and other IoT-focused cryptocurrencies in terms of adoption and price growth.</p><p>\\\nColdware (COLD) has emerged as a distinct key player on the Internet of Things and offers the decentralized infrastructure purposely developed to meet the growing needs of IoT applications.</p><p>\\\nColdware promises to give fast, secure, and scalable connections with all kinds of devices on its blockchain-powered platform. This distinguishes it from competitors such as Hedera, which is already quite popular for focusing on IoT applications.</p><p>\\\nColdware's blockchain is all geared up for scalability and efficiency, which is also the basis for its ability to capture the IoT market. As billions of devices continue to connect the world closer and closer together, Coldware is all set to pave the way to become a leader in the industry where all and sundry will be looking for seamless connectivity and real-time, secure transactions.</p><h3>Coldware's Growth Potential and Market Position</h3><p>While Hedera’s recent surge following Grayscale's filing for an HBAR ETF has made headlines, Coldware’s potential could surpass that of Hedera in the long term.</p><p>\\\nColdware (COLD) is currently in its  stages, offering early investors a unique opportunity to secure positions at a low price before its market debut. As the project continues to develop and attract attention, experts predict that Coldware’s value could rise exponentially in the coming years.</p><p>\\\nUnlike Hedera, Coldware's focus is not solely on IoT applications but extends into a broader range of industries, including healthcare, supply chain management, and more. This multi-sector utility, combined with its seamless integration with IoT, puts Coldware on the fast track for widespread adoption.</p><h3>Price Predictions for Coldware (COLD)</h3><p>As of March 2025, Coldware (COLD) is in presale in its early phases, but analysts have predicted that it has a steep upward incline.</p><p>\\\nIf the project gains traction and gets its share of strategic partnerships, experts are forecasting a price increase of 1,300% over the next 12 to 18 months, which could see Coldware catapulted into the top 50 cryptocurrencies.</p><p>\\\nWith the rapid expansion of Coldware's market capitalization as the ecosystem develops and its application in IoT and other fields becomes widespread, Coldware's exceptional blockchain concept focussing on tangible real-world applications will launch it as one of the premier cryptocurrencies in the IoT field, overtaking even the ones that are now popularizing the same space such as Hedera (HAD).</p><h3>Coldware vs Hedera (HBAR): Which Will Lead the IoT Market?</h3><p>Both Coldware and Hedera (HBAR) are uniquely positioned to capitalize on the growing demand for blockchain solutions in IoT.</p><p>\\\nHowever, Coldware’s focus on scalability, cost-efficiency, and its broad application in multiple industries could enable it to dominate the market more rapidly than Hedera, which has historically been limited in terms of its adoption outside the IoT niche.</p><p>\\\nThe introduction of institutional support through ETFs for Hedera (HBAR) may give it an immediate boost in terms of market recognition, but Coldware’s long-term strategy to integrate IoT with blockchain on a global scale gives it an edge that could propel it to new heights in the coming years.</p><h3>Conclusion: Coldware’s Future Looks Bright</h3><p>With the rise of IoT and the increasing importance of blockchain technology, Coldware is emerging as a dominant force in the space. As more enterprises adopt Coldware’s blockchain infrastructure for IoT solutions, its price is expected to rise significantly.</p><p>\\\nInvestors who enter early on could see substantial returns as the project grows and attracts institutional interest.</p><p>\\\nWhile Hedera (HBAR) has made strides with the recent ETF filing, Coldware's superior scalability and diverse applications across various industries put it in a prime position to outperform Hedera and other IoT cryptocurrencies over the long term.</p><p>\\\nInvestors looking to capitalize on the booming IoT sector should keep a close eye on Coldware, as it could become the next big thing in the cryptocurrency market.</p><p>\\\nFor more information on the Coldware (COLD) Presale:</p><p>Join and become a community member:</p><p>:::tip\n<em>This article is published under HackerNoon’s&nbsp;&nbsp;program. Do your own research before making any financial decisions.</em></p>","contentLength":4673,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Latest Meme News: Dogecoin and Shiba INU Spike 6%, Falling Short To This Utility Gem Priced Below $1","url":"https://hackernoon.com/latest-meme-news-dogecoin-and-shiba-inu-spike-6percent-falling-short-to-this-utility-gem-priced-below-$1?source=rss","date":1741435055,"author":"Coldware","guid":647,"unread":true,"content":"<p>As the cryptocurrency market continues to fluctuate, Dogecoin (DOGE) and Shiba Inu (SHIB), two of the most well-known meme coins, have once again experienced a price surge of 6%. However, despite their recent uptick, they still fall short when compared to a rising star in the space—Coldware (COLD). Priced below $1, Coldware (COLD) is making waves due to its unique combination of meme-driven energy and real-world utility, making it an enticing alternative to the speculative nature of DOGE and SHIB.</p><h3>Coldware (COLD): A Utility Gem Priced Below $1</h3><p>Here comes the , a cryptocurrency that's on its way to becoming very popular due to the combination of simple fun like meme culture with practical long-term utility.</p><p>\\\nPlus, unlike DOGE and SHIB, Coldware (COLD) has marked itself as a  platform associated with real-world use cases. Hence, perhaps it's a great catch for retail investors and even major institutional players looking for their few platitudes yet enabling a full stack moving on a very promising path toward growth.</p><p>\\\nThe arrival of those people – especially the whales – holding DOGE and SHIB coins to Coldware (COLD), who seek a diversified portfolio beyond just , is attributed to the infrastructure brought about by Coldware in decentralized finance because it assures users of decentralized and secured scalable financial solutions. By the way, presale of Coldware (COLD) had an increase already that reached 1,300 percent.</p><p>\\\nCold Token thus presents a unique proposition within the cryptocurrency ecosystem—transforming the meme-driven excitement into decentralized finance (DeFi) features such as lending, borrowing, and yield farming. The marriage of meme culture with real utility sets it up as a clear alternative for those who want to invest in some fanciful aspects while not compromising on the functionality.</p><h3>The Memes Behind Dogecoin (DOGE) and Shiba Inu (SHIB)</h3><p>Dogecoin (DOGE)&nbsp;has long been the poster child of meme coins. Initially created as a joke in 2013 by software engineers Billy Markus and Jackson Palmer, DOGE quickly gained traction due to its quirky, fun nature and the involvement of high-profile supporters like Elon Musk.</p><p>\\\nWhat started as a playful jab at the seriousness of other cryptocurrencies turned into a massive phenomenon. Over time, Dogecoin has evolved from a meme into a token with actual market value, driven by a loyal fanbase and viral social media campaigns. However, the volatility and lack of concrete utility in its design have left many questioning its long-term viability.</p><p>\\\nSimilarly,&nbsp;Shiba Inu (SHIB), often referred to as the \"Dogecoin killer,\" was launched in 2020 with the goal of building a meme-based community that could rival DOGE. Shiba Inu’s vast supply and fun, meme-centric branding quickly made it popular, and its recent developments, such as its decentralized exchange, ShibaSwap, have made it more than just a meme coin.</p><p>\\\nYet, despite its growing ecosystem, SHIB faces similar concerns regarding its speculative nature and whether it can sustain growth in the long term without more significant use cases.</p><p>\\\nDespite their impressive achievements, DOGE and SHIB continue to rely significantly on speculative trading and social media buzz. Investors who are searching for more than simply the next viral trend continue to have concerns about their lack of a strong infrastructure or real utility.</p><h3>Why Coldware (COLD) Is Gaining Momentum</h3><p>As DOGE and SHIB maintain their speculative appeal,&nbsp;&nbsp;provides the stability and growth potential that investors are increasingly looking for.&nbsp;Coldware (COLD)&nbsp;offers a secure platform with scalable financial solutions, empowering users to participate in a wide range of DeFi opportunities. For whales and institutional investors,&nbsp;Coldware (COLD)&nbsp;provides a sustainable alternative to meme coins, with the added benefit of a fully operational DeFi ecosystem.</p><p>\\\nThe presale momentum of&nbsp;Coldware (COLD)&nbsp;highlights the growing demand for a cryptocurrency that offers both utility and excitement. With a secure, decentralized platform, Coldware is making significant strides toward reshaping the landscape of meme coins, attracting a diverse range of investors who are seeking a more stable, long-term investment.</p><p>For more information on the Coldware (COLD) Presale:</p><p>Join and become a community member:</p><p>:::tip\n<em>This article is published under HackerNoon’s&nbsp;&nbsp;program. Do your own research before making any financial decisions.</em></p>","contentLength":4445,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mesa's Venus Driver Adds Vulkan Ray-Tracing Support For VMs","url":"https://www.phoronix.com/news/Mesa-25.1-Venus-Vulkan-RT","date":1741434643,"author":"Michael Larabel","guid":761,"unread":true,"content":"<article>Mesa's Venus driver that allows for 3D graphics acceleration within virtual machines is now able to make use of the Vulkan ray-tracing extensions when using Mesa 25.1-devel along with updated Venus Protocol and Virglrenderer code...</article>","contentLength":232,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Wine-Staging 10.3 Adds Patch For A 15 Year Old Bug","url":"https://www.phoronix.com/news/Wine-Staging-10.3","date":1741433914,"author":"Michael Larabel","guid":760,"unread":true,"content":"<article>Building off yesterday's release of Wine 10.3 is now Wine-Staging 10.3 for this more experimental version of Wine that is presently shipping 347 experimental/testing patches atop the upstream state...</article>","contentLength":200,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE This Week Took Care Of \"A Very Large Number Of Bugs\"","url":"https://www.phoronix.com/news/KDE-Fixes-Large-Num-Bugs","date":1741432932,"author":"Michael Larabel","guid":759,"unread":true,"content":"<article>KDE developer Nate Graham is out with the newest issue of This Week in Plasma to highlight all of the interesting KDE Plasma improvements merged for the week...</article>","contentLength":160,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"I Built a €500K Neobank for Immigrants—It Didn't Go As Planned","url":"https://hackernoon.com/i-built-a-euro500k-neobank-for-immigrantsit-didnt-go-as-planned?source=rss","date":1741428008,"author":"","guid":646,"unread":true,"content":"<ul></ul><p>Imagine moving to a new country with no local credit history, no proof of address, and no easy way to open a bank account. You have a job lined up, but no way to receive your salary. You need a permanent address to open a bank account, but you need a bank account to rent an apartment.That was my experience as an immigrant in Portugal. I thought, ‘This is a massive problem—I can fix it.’ Six months, €500K, and 5,000 users later, my neobank Relocare was dead.</p><p>I’m Dmitry, a fintech entrepreneur with 13 years in the industry. My company, Finbox Solutions, helps startups scale financial platforms. With multiple fintech ventures under my belt, I thought I was ready to build a neobank. I was wrong.With multiple fintech ventures under my belt and deep technical expertise in banking infrastructure, I felt well-equipped to tackle the challenges of building a neobank.</p><h3>Relocation and How It Started</h3><p>I didn’t have the purpose to leave my country, it happened mostly accidentally. I visited Portugal for the Web Summit conference in 2018.</p><p>\\\nAt the conference, I met prominent figures like Ray Dalio (Investor), Tim Berners-Lee (Inventor of the Web) and Evan Williams (Founder of Twitter &amp; Medium).It was an amazing and exciting experience.</p><p>\\\nThis vibe on the edge of technologies helped me decide to stay longer. When COVID-19 hit in 2020, what started as a temporary stay turned into a permanent move.</p><p>\\\nPortugal has one of the best fintech environments for startups, providing legal frameworks, startup ecosystem and has big expat community, around 1.1m people. Add to the fact, awesome weather, good location and its all I needed that time.</p><p>\\\nThe first thing in settling in a foreign country is to get the required papers. For us, it meant opening a local bank account.</p><p>The hardest thing for immigrants in any country is opening a local bank account. For citizens of Portugal, it takes up to 3 days, but for immigrants, the term exceeds 2-3 weeks. And it’s not a bank, but documents that it requires.</p><p>\\\nThe brutal irony? You need a bank account to start your life, but you need to have started your life to get a bank account.</p><p>\\\nEvery morning becomes a new bureaucratic adventure. You need a NIF (tax number) to open a bank account, but you need proof of address to get a NIF. You need a bank account to rent an apartment, but you need a permanent address for a bank account. Each document costs money - a NIF alone can set you back 100 euros. And that's just one piece of the puzzle.</p><p>\\\nI watched people burn through their savings on temporary accommodations while waiting for bank accounts. Highly skilled professionals reduced to carrying cash like students, unable to receive their salaries or pay bills properly.</p><p>\\\nThat all made the process annoying and frustrating. But it’s not all….</p><p>\\\nPortugal has a closed banking system. It means, if you have an account in international bank, then there is no guarantee it’s legit in Portugal.</p><p>\\\nI personally had an account in Brazilian branch of Santander. When I came to the Portuguese branch, local clerks stared at me in utter confusion, like “what are you…”</p><p>\\\nDifferent branches don’t recognize each other. Credit history, proof of employment, any other documents mean nothing. Start from scratch, boy! I was devastated.</p><h3>Decision to build a neobank</h3><p>The banking challenges I experienced firsthand, combined with countless similar stories from other immigrants, highlighted a clear gap in the market. My fintech background provided unique insight into how these problems could be solved systematically.</p><p>\\\nThis led to the creation of Relocare, a neobank specifically designed to address the unique challenges immigrants face when establishing their financial presence in a new country. Plus, I saw the market as underserved and wanted to challenge myself: “Can I build it and scale?”That’s how It started.</p><h3>How I Applied Product Mindset to Relocare</h3><p>When developing Relocare, we focused on deep validation:</p><ol><li>In mid-2020, conducted 50+ interviews with immigrants and identified their pain points (not possible to get a loan, hard to get a banking account)</li><li>By Q3 2020, created landing page for signups and distributed across immigrant communities. We got 13,000 on the waitlist.</li><li>Focused on 3 features during MVP stage:- Local IBAN- Credit card for immigrants- Local payment system integration (MBWay)</li><li>Thanks to our B2B business, we already had robust technical infrastructure for:</li></ol><ul></ul><p>However, operating as a bank requires a banking license, which takes years and millions in capital to obtain. By late 2020, we partnered with a BaaS (Banking-as-a-Service) provider who could give us regulatory coverage and access to the banking network. While we had the technical capability to build everything, we needed their license to operate legally. Unfortunately, their risk appetite was quite low, and they saw immigrants as high-risk clients. This conservative approach would later work against us.</p><h3>Business Model &amp; Revenue Streams</h3><p>We followed the proven revenue model that successful neobanks like Revolut had established. Our approach was straightforward:</p><ol><li>Monthly subscription — to access any service in our app, users needed to subscribe to a monthly plan. We wanted to charge 12,5 euro/month (It was naive). This supposed to be our primary revenue source (around 70% of total revenue).</li><li>Transactional fees — Our BaaS (banking as a service) partner, who owned the infrastructure and carried the risk, set certain transaction fees. This generated approximately 25% of our projected income.</li><li>Additional services — we put costs of processing into this stream, which might generate 5% of revenue: translation and document processing,</li></ol><h3>Unit economics looked promising on paper.</h3><p>We had expectations on numbers:</p><ol><li>Forecasted CAC (Customer Acquisition Cost) — 50 euro.</li><li>Expected customer lifetime (LTV) — 12 months</li><li>Target LTV/CAC ratio — 3:1.</li><li>Subscription cost — 12.5 euro/month</li></ol><p>With Relocare's business and financial model in hand, we began seeking investors. Initially, we planned to bootstrap the project, but weren't certain about the actual costs involved. We had 10 candidates to co-invest in the project, but it didn't work out. We decided to build on our own, using our money from B2B SaaS. Using “assets” from previous projects, we crafted MVP in 2 months and launched it in our user community.</p><h3>Launch and first problems</h3><p>When we launched Relocare in January 2021, 13,000 users from our waitlist turned into 5,000 MAU. Our technical infrastructure handled the scale perfectly, but the BaaS partnership created unexpected challenges:</p><ol><li><p>Immediately we’ve started to face fraud problems. It started as early as the 5th issued card. That moment we realized, what banks meant by high risk clients (meaning immigrants)</p></li><li><p>Users started complaining about our strict KYC/AML policies. We couldn’t process everything related to crypto, NFT. Users literally felt rejected.</p></li><li><p>Despite positive feedback about core features like IBAN and MBWay, many users felt rejected by our strict verification process.</p></li></ol><p>\\\nThese early problems were just the beginning of our market fit issues.</p><p>While these initial operational challenges were concerning, the deeper problems with Relocare's business model began to surface around the six-month mark. Our data started revealing a troubling pattern: users were churning.</p><p>\\\nWe started to investigate, by analyzing user feedback, conducting interviews again, and seeking patterns across accounts in our Amplitude panel. And here is what we found so far:</p><ul><li>Most immigrants struggle for the first six months, and it’s all good after they open a local bank account. It removes us from value chain. They don’t need us after the temporary challenge.</li><li>They also used Wise and Revolut along the way. Those companies provide global banking services and they’re more friendly to immigrants than local banks.</li></ul><p>What we initially saw as a significant market opportunity turned out to be a temporary pain point. This fundamental realization meant that a neobank exclusively for immigrants had a built-in churn problem—users would naturally leave once they established themselves in the country.</p><h3>The Numbers That Killed Us</h3><p>Our illusions on unit economics also broke down. We expected to have:</p><p>\\\nLifetime as 12 months but 6 months in reality.</p><p>\\\nPricing, that changed from 12,5 to only 8 euro per month.</p><p>\\\nWith mounting costs and deteriorating metrics, we needed a bigger investment to turn things around. After spending €500K of our own money, our calculations showed we needed around €10M to make the business viable. While we managed to attract about €1M in potential investor interest, it wasn't enough.</p><p>Standing at this crossroads with Relocare, we explored every possible direction:</p><ul><li>Dive into new products around neobanks.</li><li>Dive into crypto-powered cross-border payments (which was highly requested thing in a project)</li><li>Credit solutions for expats, helping them get financing in a new country</li></ul><p>\\\nAll of that wasn’t a part of our expertise. Lending is too hard, you need to assess credit risk and onboard clients with strong policy. Crypto also wasn’t our main focus, we weren’t sure what to build.</p><p>\\\nOur final analysis put the final nail in the coffin. We realized:</p><ul><li>We couldn’t compete with Revolut and Wise, which had far more resources and funding.</li><li>We needed €10M+ to build a sustainable lending model, and even with €1M in potential investor interest, the gap was too large to bridge.</li></ul><p>\\\nWith an already profitable B2B business, we decided not to lose focus here and closed it. We sort of saved money for our investors, spending only 500,000 euros. Now, it’s time to share what we’ve learned from experience.</p><p>Looking back, Relocare's journey taught me some painful but invaluable lessons that I hope will help other founders avoid similar pitfalls:</p><p>\\\n1. Beware of Transition Period Business Models</p><p>The hard truth we discovered: building a business around a temporary problem is like trying to catch smoke. Our users needed us intensely for 4-6 months, then vanished. It's like building a business selling umbrellas only when it rains – the demand is real but fleeting.</p><p>\\\n2. Market Size ≠ Market Opportunity</p><p>The 1.1M expat market in Portugal looked fantastic on paper. But here's the reality check: only 15% of these expats were actually in our target segment (tech-savvy, middle-income professionals), and only 10% of those converted to paying customers. Always dig deeper into your TAM calculations.</p><p>\\\n3. The \"Good Enough\" Problem</p><p>We learned that existing solutions like Wise and Revolut were \"good enough\" for most users. They weren't perfect for immigrants, but they worked. The lesson? Your solution needs to be 10x better than existing alternatives, not just marginally better.</p><p>\\\nFor founders eyeing the fintech space: the future isn't in building another bank – it's in solving the infrastructure problems that make banking difficult in the first place. And that's exactly what we discovered through this journey.</p><p>Despite Relocare's shutdown in mid-2021, we didn't walk away empty-handed. We built several valuable assets that we're now repurposing:</p><ul><li><p>DocSense: Relocare's AI tool for PDF analysis has found unexpected demand in the B2B sector.</p></li><li><p>PayMaster: The tax calculator developed for Relocare has become a standalone product with growing adoption.</p></li><li><p>Mobile App Architecture: We're licensing parts of the secure banking infrastructure we built for Relocare to other fintech startups.</p></li></ul><p>After shutting down Relocare in mid-2021, I returned to B2B fintech, focusing on these opportunities:</p><ol><li>Cross-Border Credit Infrastructure: The big unsolved problem isn't payments – it's credit history portability across borders</li><li>B2B Banking Services: Helping businesses navigate international banking has more staying power than consumer solutions</li><li>Regulatory Tech: Tools that help fintech companies navigate complex compliance requirements</li></ol><ol><li>Brokerage SaaS Solutions: Enabling fintech startups to launch investment &amp; trading services</li><li>Neobank Infrastructure: Providing white-label fintech solutions</li><li>Payroll Fintech: Simplifying global salary paymentsIf you have any questions about this story, then find me on social media.</li></ol><p>Looking back at this 2021 venture, I hope this post-mortem of Relocare has provided valuable insights.</p>","contentLength":12248,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"NASA's SPHEREx Is Poised To Launch Mission To Map 450 Million Galaxies In Color","url":"https://science.slashdot.org/story/25/03/08/0152240/nasas-spherex-is-poised-to-launch-mission-to-map-450-million-galaxies-in-color?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741428000,"author":"BeauHD","guid":174,"unread":true,"content":"NASA's SPHEREx observatory (short for Spectro-Photometer for the History of the Universe, Epoch of Reionization and Ices Explorer) is set to launch this week to map 450 million galaxies in infrared, providing insights into galaxy formation, the origins of water, and testing theories about the universe's rapid expansion following the Big Bang. The two-year mission will repeatedly survey the entire sky and help scientists understand fundamental cosmic processes. NBC News reports: The launch from Vandenberg Space Force Base in California is scheduled to occur Friday, during a window that opens at 10:09 p.m. ET. Liftoff was initially planned for Feb. 27, but NASA rescheduled it several times, first to \"complete vehicle processing and prelaunch checkouts,\" and because of availability at the California launch site.\n \nThe cone-shaped spacecraft -- along with four suitcase-sized satellites that NASA will deploy at the same time on a separate mission to study the sun -- will launch atop a SpaceX Falcon 9 rocket. The $488 million SPHEREx mission, which has been in development for about a decade, is designed to map the celestial sky in 102 infrared colors -- more than any other mission before it, according to NASA.","contentLength":1223,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The TechBeat: This Browser-based Editor Generates Stunning Isometric Tile Maps in Pixel Art Style (3/8/2025)","url":"https://hackernoon.com/3-8-2025-techbeat?source=rss","date":1741417866,"author":"Techbeat","guid":645,"unread":true,"content":"<p>By <a href=\"https://hackernoon.com/u/superlinked\">@superlinked</a> [ 11 Min read ] \n In this tutorial, we’ll guide you through the process of creating a movie recommendation system using vector databases.  <a href=\"https://hackernoon.com/stop-scrolling-start-building-create-your-own-ai-movie-recommender\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/benoitmalige\">@benoitmalige</a> [ 4 Min read ] \n Simplify your life with small changes to your space, time, and relationships for a lighter, focused you. <a href=\"https://hackernoon.com/this-5-step-framework-helps-declutter-your-life-from-areas-you-need-to-the-most\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/linked_do\">@linked_do</a> [ 11 Min read ] \n The clock for AI Literacy is ticking. Why should you act now, what are the six pillars of AI Literacy, and how can you build on those? <a href=\"https://hackernoon.com/ai-literacy-is-now-the-lawignore-it-at-your-own-risk\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/kamalsamaila\">@kamalsamaila</a> [ 4 Min read ] \n Trump flips on crypto, signs order for U.S. Bitcoin reserve worth $17.5B. Visionary move or risky bet? Explore the bold policy shift <a href=\"https://hackernoon.com/did-donald-trump-just-flip-the-script-on-crypto\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mfdupuis\">@mfdupuis</a> [ 10 Min read ] \n Trying to create a single AI that can answer all business analytics questions is challenging, if not impossible. <a href=\"https://hackernoon.com/text-to-sql-was-supposed-to-be-ais-killer-app-its-not\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hayday\">@hayday</a> [ 6 Min read ] \n It Takes More than Thinking: Humans Put the Vibe into Vibe Coding. An article about software engineers in a post-AI world, Vibeware and embracing ourselves <a href=\"https://hackernoon.com/it-takes-more-than-thinking-humans-put-the-vibe-into-vibe-coding\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mta\">@mta</a> [ 9 Min read ] \n Transactions are how Django manages all the DB operations that it runs. Learn how to best use them and avoid costly mistakes. <a href=\"https://hackernoon.com/python-a-deeper-look-into-how-django-transactions-work\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/oxyz\">@oxyz</a> [ 3 Min read ] \n O.XYZ launches OCEAN, a Cerebras-powered AI Search engine 10x faster than ChatGPT, with real-time responses, voice interaction, and decentralized AI. <a href=\"https://hackernoon.com/oxyz-launches-ocean-cerebras-powered-ai-engine-10x-faster-than-chatgpt\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mta\">@mta</a> [ 17 Min read ] \n Transactions are central to Django apps, but if you put the wrong code in transactions, you may cause an outage! <a href=\"https://hackernoon.com/python-django-you-should-never-put-this-stuff-in-transactions\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/truewebber\">@truewebber</a> [ 9 Min read ] \n Discover why using a shared database table is an anti-pattern and how a ‘Contract First’ approach fosters clear ownership and smoother integration. <a href=\"https://hackernoon.com/a-table-as-an-api-illusions-and-reality\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/vignesh3193\">@vignesh3193</a> [ 11 Min read ] \n GraphQL is an often misunderstood framework that went from being one of the most popular development innovations to an unfairly maligned one. <a href=\"https://hackernoon.com/graphql-is-a-misunderstood-framework\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/hennygewichers\">@hennygewichers</a> [ 6 Min read ] \n From pizza orders to smart home cameras, empathetic AI is now nudging our decisions in real time. Can we keep up? <a href=\"https://hackernoon.com/ai-chatbots-are-getting-too-good-at-making-you-say-yes\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/HuseynG\">@HuseynG</a> [ 7 Min read ] \n MCP (Model Context Protocol) is an open standard that allows AI systems to connect seamlessly with a wide variety of data sources. <a href=\"https://hackernoon.com/model-context-protocol-mcp-the-usb-c-of-ai-data-connectivity\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mlsprwr1337\">@mlsprwr1337</a> [ 2 Min read ] \n Procedural generation with isometric Wave Function Collapse (WFC). Generate your own little microcosmos using a browser-based editor. <a href=\"https://hackernoon.com/this-browser-based-editor-generates-stunning-isometric-tile-maps-in-pixel-art-style\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/thebojda\">@thebojda</a> [ 4 Min read ] \n The ByBit attack revealed critical security flaws—this article explores what went wrong and how it could have been prevented. <a href=\"https://hackernoon.com/could-bybit-have-prevented-the-hack-yesheres-how\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/mcsee\">@mcsee</a> [ 3 Min read ] \n When you add flags like isTesting, you mix testing and production code. This creates hidden paths that are only active in tests. <a href=\"https://hackernoon.com/code-smell-293-you-should-avoid-adding-istesting-or-similar-flags\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ykalynychenkogeneris\">@ykalynychenkogeneris</a> [ 2 Min read ] \n It is unlikely that cryptocurrencies will overtake fiat in the coming years. However, we are gradually moving towards this point. <a href=\"https://hackernoon.com/tether-ceo-says-usdt-will-become-useless\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/authoring\">@authoring</a> [ 5 Min read ] \n Using grammatical structures from parsed text, this study explores a new method for detecting authorship, improving accuracy in AI and fake text identification. <a href=\"https://hackernoon.com/your-writing-has-a-fingerprintand-this-cutting-edge-ai-model-can-spot-it\">Read More.</a></p>","contentLength":3119,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Women Who Are Reshaping Crypto in 2025: Meet the Disruptors","url":"https://hackernoon.com/women-who-are-reshaping-crypto-in-2025-meet-the-disruptors?source=rss","date":1741414250,"author":"Ishan Pandey","guid":644,"unread":true,"content":"<p>In 2025, the cryptocurrency and blockchain landscape is being transformed by visionary women leaders who are not only breaking barriers but also redefining the industry's future. From managing global crypto exchanges to spearheading AI-blockchain integrations, these women are driving innovation, fostering inclusivity, and expanding access to digital economies. Let’s explore their roles and contributions.</p><h2>1. Alicia Kao: Steering KuCoin’s Global Vision</h2><ul><li>: Managing Director at KuCoin</li><li>: KuCoin, a leading global cryptocurrency exchange with over 39 million users</li></ul><p>Alicia Kao is a key figure in the crypto industry, leveraging her decade-long expertise in digital marketing and a sociology background to guide KuCoin’s growth since 2019. A passionate blockchain advocate and NFT enthusiast, she focuses on making crypto accessible to all. In 2025, her leadership shone at Hackseason’s panel, “Where is Web3 Headed in 2025,” alongside industry leaders like Gracy Chen (Bitget) and Jason Lau (OKX). Her efforts in crypto education have also paid off, with KuCoin Learn attracting 1.5 million users in early 2024.</p><p>\\\n: Alicia’s commitment to education and strategic partnerships is bringing crypto to millions worldwide.</p><h2>2. Catherine Daly: Marketing the Future of Web3 Data</h2><ul><li>: Head of Marketing at Space and Time</li><li>: Space and Time, a Web3-native data warehouse revolutionizing blockchain infrastructure</li></ul><p>Catherine Daly is the marketing mastermind behind Space and Time, a company that provides fast, enterprise-scale data queries for decentralized applications in gaming, DeFi, and beyond. Supported by giants like Microsoft Azure and Chainlink, her work ensures developers and businesses understand the transformative potential of this technology. In 2025, Catherine continues to amplify Space and Time’s role in Web3’s evolution with her talent for simplifying complex concepts.</p><p>\\\n: Catherine’s storytelling is laying the groundwork for Web3’s data-driven future.</p><h2>3. Nelly Cornejo: Championing Privacy and Education in Blockchain</h2><ul><li>: iExec, a decentralized cloud computing platform focused on privacy and trust</li></ul><p>Nelly Cornejo is a trailblazer in blockchain education and privacy. Since founding TAAL Project in 2017—France’s first blockchain education non-profit—she’s empowered countless individuals. As iExec’s CMO, she promotes tools like DataProtector and Web3Mail, enhancing data security. In 2024, she co-founded Women in Web3 Privacy, furthering her mission of inclusivity. Her 2021 European Cyber Woman Day Medal underscores her influence.</p><p>\\\n: Nelly’s dedication to privacy and education is creating a safer, more inclusive blockchain ecosystem.</p><h2>4. Chi Zhang: Pioneering the AI-Blockchain Frontier</h2><ul><li>: Co-founder and CEO of Kite AI</li><li>: Kite AI, a startup building a decentralized AI economy</li></ul><p>Chi Zhang, with a Ph.D. in Machine Learning from UC Berkeley, is merging AI and blockchain at Kite AI. Her company’s Proof of Attributed Intelligence (PoAI) rewards contributors fairly in a decentralized AI ecosystem. In 2025, Kite AI’s testnet launch and partnerships with Eigenlayer and Polygon have sparked excitement, positioning Chi as a leader in democratizing AI through blockchain technology.</p><p>\\\n: Chi’s innovative fusion of AI and blockchain is shaping a more equitable tech future.</p><ul><li>: Marketing Director at My Neighbor Alice</li><li>: My Neighbor Alice, a blockchain game blending virtual land ownership with NFT creation</li></ul><p>\\\nJoana Barros brings over ten years of gaming and Web3 experience to My Neighbor Alice, a play-to-earn game inspired by Animal Crossing and Minecraft. As Marketing Director, she fosters a thriving community where players can monetize their creativity via NFTs. Her past roles at Microsoft and as an entrepreneur enhance her ability to engage diverse audiences, making blockchain gaming accessible and enjoyable.</p><p>: Joana’s community-driven approach is turning blockchain gaming into a global, inclusive phenomenon.</p><h2>6. Maly Ly: Expanding Access Through Intelligent Blockchains</h2><ul><li>: GenLayer, an intelligent blockchain featuring AI-powered smart contracts</li></ul><p>\\\nMaly Ly combines her diverse background in entertainment, space tech, blockchain, and AI to lead marketing at GenLayer. Her focus is on “Intelligent Contracts,” which leverage AI to make sophisticated decisions, lowering barriers for creators and builders. Maly’s vision is clear: “I believe in crypto’s power to expand access for everyone—not just insiders or the elite.” In 2025, she’s making that a reality.</p><p>: Maly’s efforts are democratizing blockchain technology for a broader audience.</p><h2>A Vision for 2025 and Beyond</h2><p>In 2025, the cryptocurrency and blockchain industries are being reshaped by a group of remarkable women whose leadership is driving innovation, inclusivity, and meaningful change. Figures such as Alicia Kao, Catherine Daly, Nelly Cornejo, Chi Zhang, Joana Barros, and Maly Ly stand at the forefront of this transformation, each contributing distinct expertise in areas like education, infrastructure, privacy, AI integration, community building, and accessibility. Their efforts are not only advancing the technical foundations of the crypto space but also fostering a more equitable and welcoming environment for participants worldwide.</p><p>\\\nThe significance of their work extends well beyond technological progress. By prioritizing people—whether through educating millions about cryptocurrency, developing secure and private systems, or cultivating inclusive communities—these women demonstrate that the future of crypto hinges on more than just code and transactions. It’s about forging connections, empowering individuals, and creating opportunities. Through their vision and tenacity, they are dismantling longstanding barriers and broadening access, ensuring that the decentralized landscape becomes a space where anyone, regardless of background, can engage and succeed.</p><p>\\\nLooking ahead, the influence of these trailblazers promises to leave a lasting mark. Their groundbreaking contributions are laying the foundation for a more diverse, innovative, and resilient crypto ecosystem. As they continue to challenge conventions and redefine industry standards, Alicia, Catherine, Nelly, Chi, Joana, and Maly serve as both architects of the present and pioneers of what’s to come. Their stories are a powerful reminder that meaningful change often emerges from diverse voices willing to push boundaries. For those eager to glimpse the future of cryptocurrency, the paths these women are charting offer a compelling roadmap—one that invites us all to take part in shaping the next chapter.</p><p>\\\nDon’t forget to like and share the story! </p><p>:::tip\n<strong>Vested Interest Disclosure:</strong>&nbsp;This author is an independent contributor publishing via our&nbsp;. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR</p>","contentLength":6852,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"XPath Expression Generation: How We Generated XPath Queries","url":"https://hackernoon.com/xpath-expression-generation-how-we-generated-xpath-queries?source=rss","date":1741403715,"author":"XPath","guid":643,"unread":true,"content":"<h2>3.2 XPath Expression Generation</h2><p>In this section, we introduce how we generate XPath queries. We encountered two main challenges that we had to tackle when generating XPath expressions.</p><p>\\\n Randomly generated queries could be semantically correct, but reference non-existent nodes or attributes. For the document in Figure 1, //Author[@id &lt; 1] is a valid XPath expression. However, none of the Author nodes contain an id attribute. Thus, XPath returns an empty sequence for each node, causing the predicate @id &lt; 1 to evaluate to false. We believe that queries, where only non-existent attributes or nodes are referenced, are less likely to exercise the logic of the processors under test, as subsequent operations are likely to evaluate to an empty sequence as well. Thus, we aim to avoid generating such queries.</p><p>\\\n Randomly generated predicates might likely evaluate to false and cause queries to generate empty result sets. For the document in Figure 1, the XPath predicate starts-with(text(), x) identifies nodes whose text starts with x. If x is a randomly generated string, the possibility is high that no nodes in the current result set match the condition. Consequently, any use of the predicate would yield an empty result. Any subsequently added section would yield an empty result as well, meaning that such queries would be less likely to exercise the processor under test. Consequently, we want to avoid generating such predicates, in particular, when they involve multiple sections. This relates to the first problem, as non-existent nodes or attributes can also introduce empty results.</p><p>\\\n We designed the XPath generation process of XPress tackling the two aforementioned issues. To create XPath expressions that refer to valid nodes and attributes to trigger deeper logic of the system under test, we generate queries that reference existent context relative to the so-called targeted node, such as its tag name and attributes (steps 3 and 4). Since randomly generated predicates might miss the targeted node from the result set, we rectify the generated expressions to ensure the inclusion of the targeted node (step 5).</p><p>\\\n<em>Iterative section generation.</em> We create XPath expressions sectionby-section by executing step ○2 to step ○5 for each section, which allows us to ensure non-empty results after generating each section. In the example, we first generate section /Books by selecting as the targeted node, and after executing steps 2 to step  , the result of /Books is non-empty—containing the node. Based on this, we further proceed to generate the next section /Book[count(Author) &gt; 1] starting at step 2.</p><p>\\\n We randomly generate one of the applicable section prefixes. First, we randomly select the start of the section to be / or //. We then retrieve the current context node sequence by executing the expression—/Books in the example—on a processor. Based on the result, we include all possible axes that would not lead to an empty result set by simple conditional checks. We support all 11 axes described in the XPath 3.0 standard [4]. For example, applying the axis /descendants:: will lead to a non-empty result, if at least one non-leaf node exists in the current selection. From the possible axes, we select a random one and apply it. When generating the section prefix /Book, the axis step is implicit. It is equivalent to /Books/child::Book, which selects all child nodes of the previously selected nodes. We again execute the query and retrieve the result node-set. We use the result for the name test, for which we either select a tag name from the result node-set, or use the wildcard *. By doing so, we are again guaranteed a non-empty result set. In the example, the tag name Book is selected and applied, resulting in the selection of all three Book nodes. In our artifact, we include a table that details the conditional checks for all 11 axes.</p><p>\\\n To generate targeted queries that fetch at least one node, we select a so-called targeted node to guide the predicate generation process. We use information about the target node, such as its text content, the attributes it holds, and its relationship to other nodes during the predicate generation. This is similar to the concept of the pivot row in PQS [36], which is a technique that has been proposed to test relational DBMSs. After the generated predicate is applied, we expect the target node to be included in the result node-set. In step 3, we select node 1 as the target node for the predicate generation process. Constraining the context to exist for the targeted node does not affect the evaluation of the expression on other candidate nodes and, therefore, still allows finding bugs that are triggered only when referring to nodes’ non-existing attributes or child nodes.</p><p>\\\n We use a tree structure to represent the predicate and take a bottom-up construction approach to enable tracking of expression results along tree construction. We start generating the predicate from a specific subject, which is either the targeted node or a node sequence derived from the targeted node with equal probability. In the example, we select the child node sequence from the targeted node as the subject. We then iteratively apply random function nodes and supply function parameters to construct the predicate, until the predicate reaches a desired length. We keep track of the data type and value of the current subexpression when constructing the predicate, by executing the subexpression on one randomly chosen XML processor—we use this XML processor also for predicate rectification and we subsequently refer to this XML processor as the designated XML processor. We use the value and data type of the current sub-expression in the following two ways: by (1) selecting function nodes of according data types and (2) supplying arguments to reference existent context and triggering corner cases. Specifically, we select a random function node from functions that could accept the value of the current data type as input. A function node can either represent a function or an operation. In the example, Author is a node sequence and count is a randomly selected function from functions that accept node sequence as input. For function nodes that require additional arguments, we supply arguments while taking the current result value into consideration. As an example, when selecting attribute values from node sequences, we use name tests referencing existent attributes. For the = operator, we choose an operand that is equal to the current value with a high probability of triggering the equal case which is of low probability under random generation. Aside from constants, we also set the possibility for operands to be other predicate trees. Through this, we support the generation of expressions with multiple subject occurrences. Besides boolean predicates, we also apply positional predicates to the XPath expression randomly.</p><p>\\\n Lastly, we rectify the generated predicate to guarantee that the targeted node is contained in the final result set. We first execute the generated predicate on the designated XML processor. If the result set misses the targeted node, we rectify the predicate. To negate the predicate’s result, we can always apply a not operator. However, as shown in Algorithm 1, we probabilistically apply more specific rectification for certain operators to uncover additional potential bugs. For logical operators such as and, both child expressions need to be modified to evaluate to true to contain the targeted node, while or needs only modification of one random child expression. For comparison operators, such as &lt;=, we replace them with their opposite operators, which, in the example, is &gt;. Thus, the targeted node is guaranteed to be contained in the result set.</p><p>(1) Shuxin Li, Southern University of Science and Technology China and Work done during an internship at the National University of Singapore (shuxin.li.lv@gmail.com);</p><p>(2) Manuel Rigger, National University of Singapore Singapore (rigger@nus.edu.sg).</p>","contentLength":8040,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Approach and Differential Testing for XML Processors","url":"https://hackernoon.com/the-approach-and-differential-testing-for-xml-processors?source=rss","date":1741402896,"author":"XPath","guid":642,"unread":true,"content":"<p>Figure 3 shows an overview of the approach using the same example as in Figure 1. At a high level, our approach consists of three main steps. First, we randomly generate an XML document as the context for the following queries (step 1). We then generate an XPath expression that we will subsequently validate (step 2 to step 5). Finally, we execute the XPath expression on the XML document using all engines under test and compare the resulting outputs to detect potential bugs (step 6). In the subsequent subsections, we explain these steps in reverse order to reflect their importance.</p><p>\\\nWe guide the XPath expression generation towards queries that reference nodes and attributes present in the XML document and result in non-empty result sets based on the intuition that they are more likely to stress the underlying logic of the tested systems. To generate XPath expressions with non-empty result sets, we construct the query section-by-section and ensure that a non-empty result set is produced before proceeding with the next section. Each section consists of a section prefix and predicates, and we first generate the prefix (step 2) and then the predicate. By restricting the section prefix, we guarantee that the result contains at least one node. From the nodes selected by the section prefix, we randomly select a node as a target (step 3). We then generate a predicate aiming to select the targeted node using a bottom-up tree construction method (step 4). We rectify the predicate to ensure that the result set contains the targeted node (step 5). We repeat this process until the XPath query reaches the desired length.</p><h3>3.1 Differential Testing for XML Processors</h3><p>As detailed subsequently, differential testing enables us to find both logic bugs as well as internal errors when comparing the results of XML processors implementing the same XPath standard.</p><p>\\\n When passing XML documents and XPath queries to different systems, we must account for the different</p><p>\\\ninput interfaces. For example, DBMSs use database connection interfaces to store and query data, while Saxon can be used as a library. To abstract this, we treat every XML processor implementation as a function that returns a result set and expects two string values, namely an XML document XML and an XPath query XPATH. Listing 1 shows an implementation of this interface for Oracle Database using SQL statements. It creates a table t, inserts the XML document—the XMLType constructor is used to convert the string to an XML data type—and uses an XMLQuery function call in a SELECT statement to compute the result set. For BaseX and eXist-db, similar to the commands shown for Oracle Database, we also start with an empty database and subsequently insert an XML document. Listing 2 shows an excerpt of the Java code for Saxon. First, the call to compile converts the textual XPath query to an executable object, which is then loaded. Unlike for the DBMSs, which require inserting data into a database, for Saxon, the XML document is simply associated with the query using the setContextItem call. The evaluate call computes the result, which is returned for comparison.</p><p>\\\n We identify both logic bugs and internal errors by comparing the returned results of different processors on the same XML document and query. We identify logic bugs when the tested systems return different node-set outputs for the same test cases. To parse and track the results easily under different output formats, we use unique node ids to identify element nodes. We detect internal errors as discrepancies with respect to errors. Rather than checking for an exact error message match, we validate whether all the systems produce an error, or all execute the XPath query successfully. If only a subset of the systems report an error for the same XPath query, we found a potential bug.</p><p>\\\n<em>Different XPath standards</em>. Our approach and tool are applicable to both XPath 1.0 and XPath 3.0. However, due to the differences in the formats, only processors using the same standard can be tested. Functionality that is supported only in XPath 3.0, can be disabled while generating test cases for processors that implement XPath 1.0. For example, sequence functions, such as subsequence, are defined only for the XPath 3.0 standard. When generating test cases for XPath 1.0 processors, we omit to generate subsequence function nodes for predicates. We did not encounter any functions or operators that were removed in the XPath 3.0 standard, so all expressions that we generate when testing XPath 1.0 processors can be used also when testing XPath 3.0 processors. By comparing only processors with the same XPath standard against each other, the difference in the results between different XPath standards (see Section 2) has no influence on the testing process.</p><p>(1) Shuxin Li, Southern University of Science and Technology China and Work done during an internship at the National University of Singapore (shuxin.li.lv@gmail.com);</p><p>(2) Manuel Rigger, National University of Singapore Singapore (rigger@nus.edu.sg).</p>","contentLength":5052,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"XML, XPath, XPath Structure, and More Explained","url":"https://hackernoon.com/xml-xpath-xpath-structure-and-more-explained?source=rss","date":1741401851,"author":"XPath","guid":641,"unread":true,"content":"<p> Figure 1 shows a running example that we will subsequently use to explain basic XML and XPath concepts and outline the challenges of automated testing as applied in this context. The left shows an XML document with the root node Books, while the right shows an XPath expression //*[@id * -1 &lt; 2]. We adapted this example from a bug-inducing test case that XPress discovered.[2] As shown, for the query on the document, BaseX returned an empty result, while both Saxon and eXist returned all three Book nodes.</p><p>\\\n. Extensible Markup Language (XML) is a text format for describing structured data. XML documents are trees that consist of nodes, as illustrated in Figure 1. An XML document has a single root element node (see ). Each element node has a tag name (see Books, Book, and Author). Element nodes can include attribute nodes. For example, two of the nodes have both attribute nodes id and year. An element node can also include child element nodes; in the example, the node contains three child element nodes. Element nodes can hold text contents, which can be of any defined data type. For the node with attribute id = 1, the text content it holds is \"A fairy tale\". Attribute nodes are disallowed from holding child nodes. In the example, id and year are integer-typed attribute nodes and the name attributes are string-typed attribute nodes.</p><p>\\\n. The XPath language is an expression language that allows navigating the XML tree and hierarchic addressing of the element nodes. XPath is at the core of both  -  [7] and , a more expressive query language for XML [6]. XSLT transforms XML documents into other formats and the XQuery language is a super-set of XPath expressions. XQuery extends XPath to provide functionalities such as node constructors and SQL-like clauses.</p><p>\\\n An XPath expression describes the selection and transformation of nodes of the XML tree. Figure 2 shows a simplified XPath 3.0 [4] grammar using EBNF notation from the W3C XML 1.0 standard [3]. We introduce the non-established terms  and  to describe our generation approach in</p><p>\\\nSection 3.2. XPath expressions consist of one or more sections, and a section contains one section prefix followed by zero or more predicates. In Figure 1, the XPath expression //*[@id*(-1)&lt;2] consists of a single section with section prefix //* and a single predicate [@id*(-1)&lt;2]. Each section prefix starts with either / or //. / is called the path operator, which accepts a node sequence as the left-hand operand and orders it in document order while eliminating duplicate nodes. // represents the abbreviated relative path /descendant-or-self::node()/, which matches the current context and all descendant nodes of the current context, regardless of the intermediate path. An axis step consists of an optional axis and a name test.</p><p>\\\n Axes define the relationship between selected nodes and current context nodes. For example, the axis parent:: selects all parent nodes of current context nodes. If omitted, it is equivalent to child::, which selects all direct children nodes of current context nodes. A name test is a string literal to fetch only nodes with the same tag name. It could also be a wildcard *, which matches all nodes without applying filters. The section prefix //* in the example selects all descendant nodes of the document node, which is all element nodes in the document.</p><p>\\\n Predicates in XPath include positional predicates and boolean predicates. Positional predicates contain an expression that evaluates to a single integer and select only values whose position in the context matches the integer value. In the XPath expression /Books/Book[1], [1] is a positional predicate and selects only the first child of , which is the node with @id=1. Boolean predicates evaluate current context nodes to a boolean value according to a given expression and only nodes for which the predicate evaluates to true are selected. In Figure 1, [@id * -1 &lt; 2] is a boolean predicate. The query //*[@id * -1 &lt; 2] selects all nodes in the XML document with attribute id that satisfy id * -1 &lt; 2. The three nodes with tag name Book in the document have attribute id, and all satisfy the condition. Therefore, if correctly evaluated, this query should return all three Book nodes.</p><p>\\\n For the test input in Figure 1, systems like Saxon and eXist-DB both returned a result set with three Book nodes, while BaseX returned an empty result set. The difference between the processors indicates a potential bug. Based on our manual analysis, we suspected that BaseX computed an incorrect result, which is why we reported it to the BaseX developers. They fixed the bug quickly. The reason for this bug was an incorrect simplification of the arithmetic expression x * a &gt; b to x &gt; b / a. When the divisor is a negative number, the original operator &gt; should be reversed to &lt;.</p><p>\\\n. There are majorly two different standards of XPath implementations in use today, which we need to consider in our work. The XPath 1.0 standard was the first version. As a superset of XPath 1.0, the XPath 3.0 standard is the latest standard of the XPath language and provides more functionalities such as advanced data types and functions [5]. Most multi-model DBMSs, which support XPath queries, support only XPath 1.0 [1] (e.g., Oracle, MySQL, and PostgreSQL). While some specialized XML processors support also only XPath 1.0 (e.g., libXML2), others support the more recent XPath 3.0 standard (e.g., BaseX, eXist-DB, and Saxon).</p><p>\\\n<em>XPath versions and differential testing.</em> The same queries might produce different results under different standards. For example, for the XPath expression Book/@name = false(), under the XPath 1.0 standard, the expression is expected to return true. @name is first cast into its equivalent boolean value. In the current case has no name attribute, therefore, an empty node set is returned. The equivalent boolean value evaluates to false for empty nodes. Comparing false to false is equal, therefore true is returned. Under the XPath 3.0 standard, however, the result is expected to be false. @name returns an empty sequence and equality comparison between an empty sequence and a boolean value false would evaluate to false. Thus, applying differential testing to XML processors supporting different standards is infeasible.</p><p>[2] https://github.com/BaseXdb/basex/issues/2188</p><p>(1) Shuxin Li, Southern University of Science and Technology China and Work done during an internship at the National University of Singapore (shuxin.li.lv@gmail.com);</p><p>(2) Manuel Rigger, National University of Singapore Singapore (rigger@nus.edu.sg).</p>","contentLength":6588,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Building an AI Trading Agent Using Anthropic’s MCP - Part II","url":"https://hackernoon.com/building-an-ai-trading-agent-using-anthropics-mcp-part-ii?source=rss","date":1741399153,"author":"Bruce Li","guid":640,"unread":true,"content":"<p><strong>An AI Agent with a Web 3 wallet is a pig that can fly</strong></p><p><strong>This is the second installment of a mini-series of tutorials, where we utilize Anthropic’s Model Context Protocol (MCP) as the foundation to build an AI agent that can trade foreign currencies based on real-time market intelligence.</strong></p><p>\\\nIn , we focused on <strong>collecting market intelligence</strong> from custom-built MCP servers for forex price and social media posts. That was more of a “READ” function and needs to be expanded into a “” function. Therefore, in Part 2, we will be connecting to MCP servers that can  for our forex trader.</p><h2>AI Agents With Wallets: The Powerful Convergence of AI and Web3</h2><p>The phrase \"<strong>An AI agent with a wallet is a powerful thing</strong>\" has become increasingly prominent at Web3 gatherings like the recent ETHDenver 2025. This simple statement encapsulates a transformative concept at the intersection of artificial intelligence and blockchain technology. Let's explore why this combination is generating so much excitement and what it means for the future of digital interactions.</p><h3>What Are AI Agents With Wallets?</h3><p>AI agents with wallets are autonomous software systems powered by artificial intelligence that can directly interact with blockchains through cryptocurrency wallets. Unlike traditional AI assistants that merely provide information, these agents can take financial actions independently - sending transactions, interacting with smart contracts, and managing digital assets.</p><p>\\\nThe key innovation is combining:</p><ul><li>: Systems that can perceive, learn, reason, and act</li><li>: Direct access to decentralized financial systems</li><li>: The ability to execute financial transactions without human intervention</li></ul><p>The power of AI agents with crypto wallets stems from several capabilities:</p><ol><li>Autonomous Financial Actions: Agents can directly interact with blockchains to execute trades, provide liquidity, participate in governance, or manage investments without constant human supervision. \\n </li><li>24/7 Operation: Unlike humans, AI agents can monitor markets and take action continuously without fatigue. \\n </li><li>Complex Decision Making: Advanced models can analyze vast amounts of on-chain and off-chain data to make sophisticated decisions about market trends, investment opportunities, and risk management. \\n </li><li>Programmable Economics: Creating systems where AI agents can participate in economic activities opens new possibilities for resource allocation and value creation. \\n </li><li>Reduced Intermediaries: By giving AI agents direct financial capabilities, many processes that traditionally required human middlemen can be automated.</li></ol><p>AI agents with wallets are already finding use in several domains:</p><ol><li>: Managing yield farming, liquidity provision, and optimal trading strategies across decentralized exchanges. \\n </li><li>: Automatically rebalancing crypto holdings based on market conditions and risk parameters. \\n </li><li>: Generating digital art and making strategic decisions about NFT purchases and sales. \\n </li><li>: Analyzing proposals and voting based on predefined parameters or community sentiment. \\n </li><li>: AI agents like Truth Terminal have emerged as content creators who can directly receive cryptocurrency payments.</li></ol><p><strong>Model Context Protocol (MCP)</strong> has emerged as a pivotal infrastructure layer at the intersection of AI agents and Web3, particularly for agents equipped with cryptocurrency wallets. Released by Anthropic in November 2024, MCP provides a standardized framework that enables AI agents to interact seamlessly with diverse data sources including blockchain networks, smart contracts, and decentralized applications.</p><p>\\\nFor wallet-enabled AI agents, <strong>MCP serves as the crucial communication bridge</strong> that allows them to maintain contextual awareness when processing on-chain data, interpreting transaction histories, and making financial decisions autonomously. This protocol eliminates the need for custom integrations with each blockchain or DeFi platform, significantly reducing development complexity while ensuring AI agents can securely access the real-time blockchain data essential for executing transactions and managing digital assets.</p><p>Enough theory, now, let’s jump into coding action and experiments.</p><p>\\\nFrom Part I of the series, we have all the tools to form real-time intelligence on foreign exchanged related signals, we need action tools that can actually trade the foreign currencies. We could use traditional forex tools, but you probably need both a license to trade and a lot of money to cover the fees. So, we resort to stablecoins and decentralized exchanges for both convenience and the lowest fees.</p><p>As a first step, you need to have a Solana wallet and its private key. In addition, you need to pre-fund the wallet with a small amount of SOL (e.g. 0.25 SOL).</p><p>\\\n<strong>Creating a Solana wallet with Phantom</strong> is straightforward and user-friendly.</p><ul><li>First, visit  or download the Phantom app from your device's app store.</li><li>Click \"Create New Wallet,\" and follow the setup wizard.</li><li>Phantom will generate a 12-word recovery phrase, which you must write down and store securely offline—this is crucial as it's your only backup if your device is lost or damaged.</li><li>After confirming your recovery phrase, create a strong password to protect your wallet.</li></ul><p>\\\nTo </p><ul><li>open Phantom, go to Settings (gear icon), select \"Security and Privacy,\" then \"Export Private Key.\"</li><li>You'll need to enter your password to view the key.</li><li>Never share this with anyone, as it grants complete access to your funds.</li></ul><p>\\\n<strong>Funding your Phantom wallet with 0.25 SOL</strong> requires first acquiring SOL from a cryptocurrency exchange like Coinbase or Binance. Alternatively, you can receive SOL directly from another person by sharing your wallet address with them. The transfer typically completes within seconds, and you can verify the transaction by checking your wallet balance or viewing your transaction history in the Phantom app.</p><p>\\\nRemember that maintaining a small SOL balance is necessary for paying transaction fees on the Solana network.</p><p>First, get the source code:</p><p><code>git clone https://github.com/sendaifun/solana-agent-kit.git</code></p><p><code>npm install solana-agent-kit</code></p><p>\\\n<code>cd examples/agent-kit-mcp-server</code></p><h3>Code the MCP Server for Trading</h3><p>Modify the index.ts file to add some actions for our needs. The example code has the first two actions “gettoken”. We added five more to enable trading as well as query wallet balance and token balance.</p><pre><code>import { ACTIONS, SolanaAgentKit , startMcpServer  } from \"solana-agent-kit\";\nimport * as dotenv from \"dotenv\";\nimport { get_wallet_address } from \"solana-agent-kit/dist/tools/index.js\";\n\ndotenv.config();\n\nconst agent = new SolanaAgentKit(\n    process.env.SOLANA_PRIVATE_KEY!,\n    process.env.RPC_URL!,\n    {\n        OPENAI_API_KEY: process.env.OPENAI_API_KEY || \"\",\n    },\n);\n\n// Add your required actions here\nconst mcp_actions = {\n    GET_ASSET: ACTIONS.GET_ASSET_ACTION,\n    DEPLOY_TOKEN: ACTIONS.DEPLOY_TOKEN_ACTION,\n    TRADE: ACTIONS.TRADE_ACTION,\n    BALANCE: ACTIONS.BALANCE_ACTION,\n    GET_INFO: ACTIONS.GET_INFO_ACTION,\n    WALLET: ACTIONS.WALLET_ADDRESS_ACTION,\n    TOKEN_BALANCES: ACTIONS.TOKEN_BALANCES_ACTION,\n\n}\n\nstartMcpServer(mcp_actions, agent, { name: \"solana-agent\", version: \"0.0.1\" });\n</code></pre><p>\\n For a complete list of actions available from the Solana AgentKit, you can check this file. Currently, there are over 110 actions available.</p><p>Since it is a TypeScript project, you need to build it.</p><p>\\\nAnd it will create the Node.JS file below, which we will call from the MCP server:</p><p>Claude Desktop is the MCP client that we will use again in this tutorial. Please  to modify the configuration file, for example in Mac OS.</p><p>\\\n<code>~/Library/Application\\ Support/Claude/claude_desktop_config.json</code></p><pre><code>{\n    \"mcpServers\": {\n        \"trader\": {\n            \"command\": \"uv\",\n            \"args\": [\n                \"--directory\",\n                \"/ABSOLUTE_PATH_TO_FOLDER/\",\n                \"run\",\n                \"trader.py\"\n            ]\n        },\n        \"search1api\": {\n            \"command\": \"npx\",\n            \"args\": [\n                \"-y\",\n                \"search1api-mcp\"\n            ],\n            \"env\": {\n                \"SEARCH1API_KEY\": \"YOUR_SEARCH1API_KEY\"\n            }\n        },\n        \"agent-kit\": {\n            \"command\": \"node\",\n            \"env\": {\n                \"RPC_URL\": \"https://api.mainnet-beta.solana.com\",\n                \"SOLANA_PRIVATE_KEY\": \"YOUR_KEY\"\n            },\n            \"args\": [\n                \"/ABSOLUTE_PATH_TO_FOLDER/build/index.js\"\n            ]\n        }\n    }\n}\n</code></pre><p>\\n As you can see, the last MCP server is the one for AgentKit. The RPC<em>URL is pointing to the official public API to Solana Mainnet, while the SOLANA</em>PRIVATE_KEY should be your wallet private key you exported earlier.</p><p>After re-launching the Claude Desktop client, you should be able to see that now you have 14 tools at your disposal. 7 of them are from the two MCP servers from the last tutorial, while 7 more are from the new AgentKit server.</p><h3>Check the Wallet Balance of SOL</h3><p>The first thing you will do is check your SOL wallet balance. Sometimes, you need to give the full wallet address. You should be able to see 0.25 SOL in your agent wallet.</p><h3>Optional: Issue a Meme Coin</h3><p>This is just for fun: deploy a new token on Solana named Manusv2 with an initial supply of 1000000000. This is, of course, unrelated to the forex trading.</p><p>\\\nIt is extremely easy to deploy a new token on the Solana network, which is very convenient. But it also means there will be gazillions of tokens with similar or same names. Therefore, it is always important to check the token’s Contract Address (CA) to make sure it is the right token that you want to trade.</p><h3>Trade Foreign Currency (Stablecoins)</h3><p>Now, we get to the meat of the trading actions. First, let’s  on the Solana network. USDC is well known, and you do not need to specify the Contract Address. But it is always good practice to double-check.</p><p>\\\n <img src=\"https://cdn.hackernoon.com/images/bI3BzyBanbVxEZqmLV7jRnw6d9o2-2025-03-08T01:59:22.183Z-tw0shli37hdrcs15764oz8ok\" alt=\"\">Next, let’s . This time, we do specify the Contract Addrss for EURC (HzwqbKZw8HxMN6bF2yFZNrht3c2iXXzpKcFu7uBEDKtr) since it is a lesser-known stablecoin.</p><p>\\\nWow, that looks so easy! <strong>We did not write a single line of code</strong> to use API to interact with a Decentralized Exchange to carry out the trade. We just typed in a few words in our favorite desktop chat app: Claude.</p><p>\\\n<strong>Let that sink in a bit, and appreciate the power of MCP.</strong></p><h3>Check the Wallet Balance of All Tokens</h3><p>Sometimes, there are <strong>multiple MCP tools or actions that can handle similar tasks</strong>. The Claude Desktop client is smart enough to try a few of them, and eventually get the correct results.</p><p>\\\nYou can see it in the example below where I ask for the wallet balance of all tokens. Initially, Claude used BALANCRE<em>ACTION, which only retired the SOL balance but without the USDC &amp; EURC balance. Once Claude tried TOKEN</em>BALANCE_ACTIO, we got a list of all the tokens in the wallet. This shows the flexibility and robustness of the MCP protocol.</p><p>Just a quick memory refresh about MCP. The three categories of important assets for MCP are: tools, resources, and prompts. We touched upon Tools in the tutorials, and now it is time to talk a bit about .</p><p>\\\nMCP clients like Claude Desktop are smart enough to carry out most tasks based on very simple instructions from humans. However, a good prompt is often necessary for more complex tasks. It can still be quite concise, but consider adding the following elements:</p><ul><li>What is the objective and main ask</li><li>What tools and resources do you want MCP to search and execute</li><li>What thinking/planning process you would like to recommend</li><li>What final output should look like</li></ul><p>\\\nNow, let’s get on with the combo test for an AI forex trading assistant.</p><h3>Step 1: Analysis and Plan</h3><blockquote><p>[]: You are my assistant for forex trading. Research recent macro economic news, truth social posts by Trump, and everything else that might impact the forex exchange rate between USD and EUR. Evaluate my current wallet balance. Give me actionable plan: for example, buy or sell USD, buy or sell EUR.</p></blockquote><blockquote><p><code>[Prompt]: yes proceed with USDC to EURC conversion</code></p></blockquote><blockquote><p>check all token balances in my wallet</p></blockquote><p>\\\nIt is always good practice to  by using the Solana Explorer:</p><h2>Practical Assessment of MCP</h2><p>We talked a lot about  in the first episode. For example, MCP is , and it has <strong>excellent momentum and is widely supported</strong> by both Web 2 and Web 3 developer communities.</p><p>\\\nHowever, MCP still faces significant usability challenges that limit its accessibility, particularly for non-technical users.</p><ul><li><strong>Server integration with Claude Desktop remains cumbersome</strong>, requiring developers to navigate command-line operations, manage dependencies, and configure ports - creating a substantial barrier to entry.</li></ul><ul><li>Additionally, the requirement to <strong>manually specify which MCP servers to use for each interaction</strong> creates unnecessary friction in the user experience. The lack of a streamlined discovery and selection mechanism means users must edit configuration files and restart applications just to add new data sources.</li></ul><p>\\\nWhile these limitations are acknowledged on MCP's development roadmap, addressing them will be crucial for the protocol to realize its full potential as a universal standard for contextual AI assistance beyond the developer community. And we have also seen interesting approaches by the open-source community to address these shortcomings.</p><p>In this episode, we focused on . We started with the unique importance of AI Agents with Web 3 wallets, and MCP’s role in this emerging vision. Then we went about the practical steps of setting up the Solana AgentKit MCP server, where all our forex trading-related actions were added. We traded some USD and EUR stablecoins. In the final combo test, we use AI Agent as our trading assistant who not only can do smart analysis based on real-time signals but also carry out the actual trades.</p><p>\\\nThe next and last part of this mini-series will be most exciting: <strong>the agent will be autonomous!</strong> It will run 24x7. It will wake up periodically, check the latest news and social posts, check his current portfolio position, and make short-medium term action plans against his long-term strategy. If it needs to re-balance the portfolio, it will execute the trades. And hopefully, it will evaluate his own performance and make some adjustments if needed. Are you excited? :-)</p>","contentLength":14129,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ham vs Spam: How to Identify and Classify Spam E-mail","url":"https://hackernoon.com/ham-vs-spam-how-to-identify-and-classify-spam-e-mail?source=rss","date":1741397060,"author":"Rama","guid":639,"unread":true,"content":"<p>Email is a vital tool for communication in today’s world; however, spam emails have emerged as a major challenge. These unsolicited messages from unknown sources often fill inboxes, disrupting communication and productivity. This paper investigates the use of various machine learning techniques to classify emails as either \"spam\" or \"ham\" (non-spam). </p><p>\\\nClassification models such as K-Nearest Neighbors (KNN), Logistic Regression, Support Vector Machines (SVM), and Naïve Bayes are evaluated, comparing their effectiveness in email classification. The performance of each model is evaluated based on metrics like accuracy, precision, recall, and F1 score to determine which approach is most suitable for this task.</p><p>In 2023, there are 347.3 billion emails sent every day, out of which spam emails compose 45% of all email traffic. These email spam costs businesses $20.5 billion every year. Given this, there will always be a need to ensure spam is correctly classified and does not interfere with legitimate email traffic. This is a useful way to understand the potential and application of machine learning. </p><p>\\\nIn the case of spam detection, a human user familiar with email can easily determine spam almost immediately upon looking at it. As a result, I believe this work confirms that identifying spam is a useful application for a machine learning classifier. To classify an email as spam or ham, there are a lot of preprocessing steps involved – preparing the data to be acceptable to a linear classifier, then tokenizing and stemming each line to convert to a TF-IDF (Term Frequency – Inverse Document Frequency) table. </p><p>\\\nKNN with K=3 was selected as the baseline model. Logistic Regression with L1 regularization, the Naïve Bayes model, and SVM models were also tested before deciding the best model. For the purpose of this project, a dataset from Kaggle has been used, which has 2551 “ham” email files and 501 spam email files and the modeling has been done using R programming language.</p><p><strong>The below chart would help understand the flow of the various steps followed –</strong></p><p>Given that a large volume of text data is being used, there was a need to preprocess the data to clean it up and get it to a format that can be used by classification models. The following will explain the step-by-step process that was followed as part of the data preprocessing –</p><ul><li><p>The text data needs to be acceptable to a linear classifier. This means the dataset must be transformed using text feature extraction methods to numeric features.</p></li><li><p>First, each line of the text is tokenized and stemmed to the following form. The stemming process shortens words by removing inflected endings. For example, workers becomes worker in the below example.</p></li><li><p>Next, the tokenized data is converted to a TF-IDF table (Term frequency - Inverse document frequency). TF-IDF is an approach to text analysis that states each n-gram in a document in terms of its term frequency-inverse document frequency. Term frequency is simply the frequency of a given term within a document (in this case, an email). Inverse document frequency is generally stated as:</p><p>log ((Total Number of Documents/Number of Documents With Term)</p></li></ul><p>\\\nThis serves to weigh significant terms more highly than very frequent and thus less important terms.</p><ul><li>Next, the terms are reduced by only selecting those terms that have appeared in at least 2 percent of documents but no more than 95 percent of the documents. This process prevents overfitting by ensuring terms are removed which are too unique or too prevalent in the training set.</li></ul><ul><li><p>This yields a total of 1,130 terms in the training dataset.</p></li></ul><p>It is important to note that the strategy for utilizing TF-IDF with the test set will be to only perform model training on the training TF-IDF, and then subsequently to re-calculate TF-IDF with the complete data for testing accuracy. This is required because TF-IDF is dependent on the frequency in the  dataset of a certain term, and also to not incorporate the test data during training.</p><p>\\\nFinally, only the top 1000 terms by overall term frequency are selected in the training set.</p><p>Code for the Preprocessing steps -</p><pre><code>#tokenize\nword_tokens &lt;- complete_tbl %&gt;% unnest_tokens(word,content)\n#stemming\nword_tokens&lt;-word_tokens %&gt;% mutate(word_stem=SnowballC::wordStem(word))\n#remove any words with numbers\nword_tokens &lt;- word_tokens[-grep('^\\\\d+$', word_tokens$word_stem),]\n\n#remove any words with .\n\nword_tokens &lt;- word_tokens[-grep('[.]', word_tokens$word_stem),]\n\n#remove any single character words\n\nword_tokens &lt;- word_tokens[-grep('.\\\\b[a-z]\\\\b.', word_tokens$word_stem),]\n\n#remove tokens which match stop words\nword_tokens &lt;- word_tokens %&gt;% filter(!word %in% stopWords)\nword_tokens &lt;- word_tokens %&gt;% filter(!word_stem %in% stopWords)\n\n#split into training and test\nword_tokens_train &lt;- word_tokens %&gt;% filter(document %in% ind)\n\n\n  #create tfidf for training and then a complete tfidf for testing\ntfidf_train&lt;-word_tokens_train %&gt;% count(document,word_stem,sort=TRUE) %&gt;% bind_tf_idf(word_stem,document,n)\ntfidf_complete&lt;-word_tokens %&gt;% count(document,word_stem,sort=TRUE) %&gt;% bind_tf_idf(word_stem,document,n)\n</code></pre><ol><li><strong>K-Nearest Neighbors (KNN) – the Baseline model</strong></li></ol><p>The model achieves reasonable specificity but extremely poor sensitivity, meaning many hams are falsely predicted as spam. Note that in each of the below results, the positive class is “ham”. This is really the worst possible outcome for a user in that they would miss many real emails that are classified as spam.</p><p>\\\n <img src=\"https://cdn.hackernoon.com/images/KTh7MbKaiZfJuCv5C2MPG7UEhn43-2025-03-08T01:24:19.753Z-ug1l8lqbr7emxd5e3zk2mqhr\" alt=\"Confusion matrix for KNN with K=3\"> \\n Code for KNN model -</p><pre><code>##train a model\nlibrary(e1071)\nlibrary(caret)\nlibrary(class)\nlibrary(LiblineaR)\n\n##remove document number since this is indicative of spam or ham\nwide_feat_train&lt;-subset(wide_feat_train, select=-c(document))\nwide_feat_test&lt;-subset(wide_feat_test,select=-c(document))\n\n#Base model is a knn attempt\n\nknn_pred&lt;-knn(train=wide_feat_train,test=wide_feat_test,cl=labels_train$label,k=3)\nknn_results&lt;-confusionMatrix(knn_pred,labels_test$label)\nknn_results\n\nknn_results$byClass[\"F1\"]\nknn_results$byClass[\"Precision\"]\nknn_results$byClass[\"Recall\"]\n</code></pre><p>After getting poor results from the KNN model, Logistic Regression was the next model used.</p><p>\\\nFor the purpose of this scenario,</p><p>Logistic Regression was applied with the following hyperparameters –</p><ul></ul><p>\\\nThis model provides the following results on the test dataset, already a significant improvement on the KNN model. The overall accuracy is quite high, but the specificity shows there is still some room for improvement. A user of this model would find a few Hams being predicted as Spams. \\n  <img src=\"https://cdn.hackernoon.com/images/KTh7MbKaiZfJuCv5C2MPG7UEhn43-2025-03-08T01:24:19.471Z-myhan7de4ucutaztd4ahnjch\" alt=\"Confusion matrix for Logistic Regression\">Code for Logistic Regression model -</p><pre><code>#Next is a logistic regression usin the below hyperparameters\ngrid_logit &lt;- expand.grid(loss=\"L1\",cost=2,epsilon=0.1)\nlr &lt;- train(x=wide_feat_train,y=labels_train$label,method=\"regLogistic\",tuneGrid=grid_logit)\n\nlr_results&lt;-confusionMatrix(as.factor(predict(lr,wide_feat_test)),labels_test$label)\nlr_results\n\np_lr = predict(lr,wide_feat_test)\nprednum_lr&lt;-ifelse(p_lr==\"spam\",0,1)\n\nroc_lr&lt;-roc(labels_test$label,prednum_lr)\nplot(roc_lr)\nroc_lr$auc\n\np1_lr&lt;- prediction(as.numeric(p_lr),as.numeric(labels_test$label))\npr_lr &lt;- performance(p1_lr, \"prec\", \"rec\")\nplot(pr_lr)\n\nlr_results$byClass[\"F1\"]\nlr_results$byClass[\"Precision\"]\nlr_results$byClass[\"Recall\"]\n</code></pre><p>The next model tried was the Naïve Bayes model. For this model, cross-validation was done to find the optimal hyperparameters with a five-fold approach. This results in the following parameters for Naive-Bayes -</p><ul></ul><p>\\\nThis model also achieves good results on both specificity and sensitivity.</p><p><img src=\"https://cdn.hackernoon.com/images/KTh7MbKaiZfJuCv5C2MPG7UEhn43-2025-03-08T01:24:19.471Z-dz0zfct4cgzleice9ott1d9y\" alt=\"Confusion matrix for Naïve Bayes model\">Code for Naive Bayes model -</p><pre><code>##naive bayes main model\nnb_cv &lt;- train(\n  x=wide_feat_train,\n  y=labels_train$label,\n  method = \"naive_bayes\",\n  trControl = train_control,\n  tuneGrid = grid\n)\n\n\nnb &lt;- naiveBayes(wide_feat_train,labels_train$label,adjust=1,laplace=0,usekernel=FALSE)\nnb_results&lt;-confusionMatrix(as.factor(predict(nb,wide_feat_test)),labels_test$label)\nnb_results\n\np = predict(nb,wide_feat_test)\nprednum&lt;-ifelse(p==\"spam\",0,1)\n\nroc_nb&lt;-roc(labels_test$label,prednum)\nplot(roc_nb)\nroc_nb$auc\n\n\np1&lt;- prediction(as.numeric(p),as.numeric(labels_test$label))\npr &lt;- performance(p1, \"prec\", \"rec\")\nplot(pr)\n\nnb_results$byClass[\"F1\"]\nnb_results$byClass[\"Precision\"]\nnb_results$byClass[\"Recall\"]\n</code></pre><p>\\n 4. <strong>Support Vector Machine (SVM)</strong></p><p>The final model is an SVM cross-validation with a linear kernel. Support vector machines attempt to optimally find the maximally separating hyperplane to separate data between two classes.</p><p>\\\nHere, a 5-fold CV is performed using the R library  to identify the optimal hyperparameters. These hyperparameters are shown below -</p><ul></ul><p>\\\nThe results of this model when applied to the held-out test dataset are shown below –</p><pre><code>#svm\ntrain_control &lt;- trainControl(\n  method = \"cv\", \n  number = 5\n)\nsvm &lt;- train(x=wide_feat_train,y=labels_train$label,method=\"svmLinearWeights2\",trControl=train_control)\nsvm$bestTune\n\nsvm_results&lt;-confusionMatrix(as.factor(predict(svm,wide_feat_test)),labels_test$label)\nsvm_results\n\np_svm = predict(svm,wide_feat_test)\nprednum_svm&lt;-ifelse(p_svm==\"spam\",0,1)\n\n\nroc_svm&lt;-roc(labels_test$label,prednum_svm)\nplot(roc_svm,colorize=T,lwd=3, main=\" ROC curve for SVM model\")\nroc_svm$auc\n\np1_svm&lt;- prediction(as.numeric(p_svm),as.numeric(labels_test$label))\npr &lt;- performance(p1_svm, \"prec\", \"rec\")\nplot(pr)\n\nsvm_results$byClass[\"F1\"]\nsvm_results$byClass[\"Precision\"]\nsvm_results$byClass[\"Recall\"]\n</code></pre><p>The following table summarizes the measures that were considered for selecting the best model–</p><p>| Model | Accuracy | F1 Score | Precision | Recall |\n|----|----|----|----|----|\n| KNN | 0.252 | 0.2293 | 0.8947 | 0.1315 |\n| Logistic Regression | 0.9624 | 0.9781 | 0.9591 | 0.998 |\n| Naïve Bayes | 0.9722 | 0.9834 | 0.9882 | 0.9787 |\n| SVM | 0.9885 | 0.9932 | 0.9886 | 1 |</p><p>From the above table, it can be seen that SVM performs the best compared to the other models.</p><p>\\\nTo further confirm, ROC curves were plotted and the AUC values were computed.</p><p>| Model | KNN | Logistic Regression | Naïve Bayes | SVM |\n|----|----|----|----|----|\n| AUC | .5232 | .882 | .9574 | .9628 |</p><p>Fig: AUC values for the 4 models</p><p>From the above metrics, it can be concluded that the SVM with 5-fold cross-validation performs the best on the dataset in classifying the emails as ham and spam.</p><p>Spam filtering will always be a field with continuous evolution as spammers are constantly finding new and innovative methods to send Spam messages. No single anti-spam solution may be correct. In this project, some of the machine learning tools were used to see how they perform as classifiers for Ham and Spam emails. Descriptions of the calculations are presented as well as a comparison of their performances.</p><p>\\\nOut of the four machine learning models that have been tested,&nbsp;SVM was found to be the best in terms of performance. Logistic Regression and Naïve Bayes models also show promising results.</p>","contentLength":10843,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cursor in talks to raise at a $10B valuation as AI coding sector booms","url":"https://techcrunch.com/2025/03/07/cursor-in-talks-to-raise-at-a-10b-valuation-as-ai-coding-sector-booms/","date":1741393923,"author":"Marina Temkin","guid":362,"unread":true,"content":"<p>Investor interest in AI coding assistants is exploding. Anysphere, the developer of AI-powered coding assistant Cursor, is in talks with venture capitalists to raise capital at a valuation of nearly $10 billion, Bloomberg reported. The round, if it transpires, would come about three months after Anysphere completed its previous fundraise of $100 million at a […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":429,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What does “PhD-level” AI mean? OpenAI’s rumored $20,000 agent plan explained.","url":"https://arstechnica.com/ai/2025/03/what-does-phd-level-ai-mean-openais-rumored-20000-agent-plan-explained/","date":1741388049,"author":"Benj Edwards","guid":288,"unread":true,"content":"<p>The AI industry has a new buzzword: \"PhD-level AI.\" According to a <a href=\"https://www.theinformation.com/articles/openai-plots-charging-20-000-a-month-for-phd-level-agents\">report</a> from The Information, OpenAI may be planning to launch several specialized AI \"agent\" products including a $20,000 monthly tier focused on supporting \"PhD-level research.\" Other reportedly planned agents include a \"high-income knowledge worker\" assistant at $2,000 monthly and a software developer agent at $10,000 monthly.</p><p>OpenAI has not yet confirmed these prices, but they have mentioned PhD-level AI capabilities before. So what exactly constitutes \"PhD-level AI\"? The term refers to models that supposedly perform tasks requiring doctoral-level expertise. These include agents conducting advanced research, writing and debugging complex code without human intervention, and analyzing large datasets to generate comprehensive reports. The key claim is that these models can tackle problems that typically require years of specialized academic training.</p><p>Companies like OpenAI base their \"PhD-level\" claims on performance in specific benchmark tests. For example, OpenAI's <a href=\"https://arstechnica.com/information-technology/2024/09/openais-new-reasoning-ai-models-are-here-o1-preview-and-o1-mini/\">o1 series</a> models reportedly performed well in science, coding, and math tests, with results similar to human PhD students on challenging tasks. The company's <a href=\"https://arstechnica.com/ai/2025/02/after-24-hour-hackathon-hugging-faces-ai-research-agent-nearly-matches-openais-solution/\">Deep Research</a> tool, which can generate research papers with citations, scored 26.6 percent on \"<a href=\"https://agi.safe.ai/\">Humanity's Last Exam</a>,\" a comprehensive evaluation covering over 3,000 questions across more than 100 subjects.</p>","contentLength":1410,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/03/phd_robot_header-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Wine 10.3 Wires Up Wayland Driver Clipboard Handling, Vulkan Video Decode Within WineD3D","url":"https://www.phoronix.com/news/Wine-10.3-Released","date":1741383611,"author":"Michael Larabel","guid":758,"unread":true,"content":"<article>Wine 10.3 was just released as the newest bi-weekly development release for this open-source software to run Windows applications and games under Linux and other platforms...</article>","contentLength":174,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft reportedly ramps up AI efforts to compete with OpenAI","url":"https://techcrunch.com/2025/03/07/microsoft-reportedly-ramps-up-ai-efforts-to-compete-with-openai/","date":1741382573,"author":"Kyle Wiggers","guid":361,"unread":true,"content":"<p>Microsoft is accelerating its push to compete with OpenAI, its longtime collaborator, by developing its own powerful AI models and exploring alternatives to power products like Microsoft’s Copilot bot. Microsoft has developed its own AI “reasoning” models comparable to models like OpenAI’s o1 and o3-mini, the The Information reports. OpenAI is said to have refused […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SXSW 2025: What we’re paying attention to","url":"https://techcrunch.com/2025/03/07/sxsw-2025-what-were-paying-attention-to/","date":1741382534,"author":"Kirsten Korosec","guid":360,"unread":true,"content":"<p>TechCrunch will be on the ground at SXSW 2025 — the annual tech, music, comedy, and film conference that kicked off Friday in Austin — in search of the zeitgeist of this AI-centric era. Yup, we’re one sentence in and AI has already made its entrance. And why not? A quick scan of the massive […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":366,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GNOME 48 Release Candidate Brings Late Mutter Features & Other Changes","url":"https://www.phoronix.com/news/GNOME-48-Release-Candidate","date":1741382520,"author":"Michael Larabel","guid":757,"unread":true,"content":"<article>The GNOME 48 release candidate \"48.rc\" is out this evening as we approach the stable release of the GNOME 48 desktop in two weeks...</article>","contentLength":132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Signal President Meredith Whittaker calls out agentic AI as having ‘profound’ security and privacy issues","url":"https://techcrunch.com/2025/03/07/signal-president-meredith-whittaker-calls-out-agentic-ai-as-having-profound-security-and-privacy-issues/","date":1741380491,"author":"Sarah Perez","guid":359,"unread":true,"content":"<p>Signal President Meredith Whittaker warned Friday that agentic AI could come with a risk to user privacy. Speaking onstage at the SXSW conference in Austin, Texas, the advocate for secure communications referred to the use of AI agents as “putting your brain in a jar,” and cautioned that this new paradigm of computing — where […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intuitive Machines’ second moon lander is dead","url":"https://techcrunch.com/2025/03/07/intuitive-machines-second-moon-lander-is-dead/","date":1741379335,"author":"Sean O'Kane","guid":358,"unread":true,"content":"<p>Intuitive Machines’ Athena lunar lander is dead, just one day after it touched down at the moon’s south pole and tipped over. Luckily, the company says it was able to “accelerate several program and payload milestones” and deploy a few of the experiments that were riding shotgun before Athena’s lander ran out of juice. The […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":403,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Nearly 1 million Windows devices targeted in advanced “malvertising” spree","url":"https://arstechnica.com/security/2025/03/nearly-1-million-windows-devices-targeted-in-advanced-malvertising-spree/","date":1741379038,"author":"Dan Goodin","guid":287,"unread":true,"content":"<p>Nearly 1 million Windows devices were targeted in recent months by a sophisticated \"malvertising\" campaign that surreptitiously stole login credentials, cryptocurrency, and other sensitive information from infected machines, Microsoft said.</p><p>The campaign began in December, when the attackers, who remain unknown, seeded websites with links that downloaded ads from malicious servers. The links led targeted machines through several intermediary sites until finally arriving at repositories on Microsoft-owned GitHub, which hosted a raft of malicious files.</p><p>The malware was loaded in four stages, each of which acted as a building block for the next. Early stages collected device information, presumably to tailor configurations for the later ones. Later ones disabled malware detection apps and connected to command-and-control servers; affected devices remained infected even after being rebooted.</p>","contentLength":897,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/03/warning-alert-screen-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Getting a Signal on the Moon","url":"https://spectrum.ieee.org/nokia-4g-cellular-network-moon","date":1741377604,"author":"Qusi Alqarqaz","guid":62,"unread":true,"content":"<p>Nokia’s 4G cellular network will be a game-changer for lunar missions</p>","contentLength":71,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjY1MDQ0My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc2ODk3MTI3NH0.BbQd6pGaiTrIQBIde1Txs-pnQU6Uhh21TCa2ERAXE6s/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"US lawmakers have already introduced hundreds of AI bills in 2025","url":"https://techcrunch.com/2025/03/07/us-lawmakers-have-already-introduce-hundreds-of-ai-bills-in-2025/","date":1741377558,"author":"Kyle Wiggers","guid":357,"unread":true,"content":"<p>Just over two months into 2025, the number of pending AI bills in the U.S. has grown to 781, according to an online tracking tool. The tool, maintained by consulting firm MultiState, shows that the number of pending U.S. bills pertaining to AI now exceeds the total number of AI bills proposed in all of […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":372,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Discord is discussing an IPO","url":"https://techcrunch.com/2025/03/07/discord-is-discussing-an-ipo/","date":1741375804,"author":"Charles Rollet","guid":356,"unread":true,"content":"<p>Discord is in early stage discussions with bankers to IPO.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":121,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What is Instagram’s Threads app? All your questions answered","url":"https://techcrunch.com/2025/03/07/what-is-instagrams-threads-app-all-your-questions-answered/","date":1741375570,"author":"Ivan Mehta","guid":355,"unread":true,"content":"<p>Twitter alternatives — new and old — have found audiences willing to try out a newer social networks since Elon Musk took over the company in 2022. Mastodon, Bluesky, Spill and T2 are some of the social media platforms people are among them. So is Meta’s Threads platform. What is Threads? How do you create […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":382,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Threads tests adding ‘interests’ on profiles to connect users with topical discussions","url":"https://techcrunch.com/2025/03/07/threads-tests-adding-interests-on-profiles-to-connect-users-with-topical-discussions/","date":1741375448,"author":"Sarah Perez","guid":354,"unread":true,"content":"<p>Meta’s Threads has begun testing a new feature that would allow people to add their interests to their profile on the social network. Instead of only advertising to profile visitors the sort of topics you might post about, the new interests feature will also direct users to active conversations about the topic. The company thinks […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Countdown to the Annual IEEE Election","url":"https://spectrum.ieee.org/countdown-to-2025-ieee-election","date":1741374003,"author":"Carrie Loh","guid":61,"unread":true,"content":"<p>The election begins on 15 August</p>","contentLength":32,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjY0Mzk0OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc2ODkwMDU2OH0.Pn0TQcWiN61SDSz5WG50X9Upf3jvBWYCrd7_L6W6SJg/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Google removes ‘underrepresented’ language from its grant website","url":"https://techcrunch.com/2025/03/07/google-removes-underrepresented-language-from-its-grant-website/","date":1741374000,"author":"Dominic-Madori Davis","guid":353,"unread":true,"content":"<p>Just weeks after Google said it would review its diversity, equity, and inclusion programs,&nbsp;the Google for Startups Founders Fund web page is peppered with changes. Most notably Google is now using past tense to describe all of its fund programs for underrepresented founders.&nbsp; This is a change that took place after December, according to the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":414,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google debuts a new Gemini-based text embedding model","url":"https://techcrunch.com/2025/03/07/google-debuts-a-new-gemini-based-text-embedding-model/","date":1741373971,"author":"Kyle Wiggers","guid":352,"unread":true,"content":"<p>Google on Friday added a new, experimental “embedding” model for text, Gemini Embedding, to its Gemini developer API. Embedding models translate text inputs like words and phrases into numerical representations, known as embeddings, that capture the semantic meaning of the text. Embeddings are used in a range of applications, such as document retrieval and classification, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":447,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Elon Musk’s AI company, xAI, acquires 1 million-square-foot property in Memphis","url":"https://techcrunch.com/2025/03/07/elon-musks-ai-company-xai-acquires-1-million-square-foot-property-in-memphis/","date":1741373137,"author":"Kyle Wiggers","guid":351,"unread":true,"content":"<p>xAI, Elon Musk’s AI company, has acquired a 1 million-square-foot property in Southwest Memphis to expand its AI data center footprint, according to a press release from the Memphis Chamber of Commerce. The new land will host infrastructure to complement xAI’s existing Memphis data center. “xAI’s acquisition of this property ensures we’ll remain at the […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":433,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Vulkan Video Continues Making Inroads, VP9 Decode Planned For This Year","url":"https://www.phoronix.com/news/Vulkan-Video-2025-Plans","date":1741372108,"author":"Michael Larabel","guid":756,"unread":true,"content":"<article>At the Vulkanised 2025 conference a few weeks back in Cambridge (UK) there were a few presentations concerning Vulkan Video for this cross-vendor, cross-platform video encode/decode interface...</article>","contentLength":194,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Video Friday: Atlas in the Lab","url":"https://spectrum.ieee.org/video-friday-atlas-in-the-lab","date":1741365003,"author":"Evan Ackerman","guid":60,"unread":true,"content":"<p>Your weekly selection of awesome robot videos</p>","contentLength":45,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjY1ODgxMS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc3NDk4Mjc0MX0.TExFMvl_TOHfaYaEFIzdK3GrNOESVxqBUN9dW1c7eTI/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"Ubuntu To Revert \"-O3\" Optimizations, Continues Quest For Easier ARM64 Installations","url":"https://www.phoronix.com/news/Ubuntu-No-O3-Easier-ARM64","date":1741363800,"author":"Michael Larabel","guid":755,"unread":true,"content":"<article>Canonical engineer Matthieu Clemenceau has posted a status update on the behalf of the Ubuntu Foundations engineers now half-way through the Ubuntu 25.04 development cycle. A number of notable package updates have landed as well as continued work on better ARM64 support and coming to a decision over \"-O3\" optimized packages...</article>","contentLength":328,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rare Earths Reality Check: Ukraine Doesn't Have Minable Deposits","url":"https://spectrum.ieee.org/ukraine-rare-earth-minerals","date":1741363203,"author":"Glenn Zorpette","guid":59,"unread":true,"content":"<p>Experts say proposed deal with U.S. makes no sense</p>","contentLength":50,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NjY1Nzc1Ny9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc5Njk4MjMyMX0.dV9eTS0Za_oXAZUEd8G_TlvusOaTlhs0buzulbRt7lM/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"AMD Officially Confirms Ryzen 9 9900X3D + Ryzen 9 9950X3D Pricing & Availability","url":"https://www.phoronix.com/news/Ryzen-9-9900X3D-9950X3D","date":1741362070,"author":"Michael Larabel","guid":754,"unread":true,"content":"<article>Back in January at CES was the Ryzen 9 9000X3D and Ryzen 9 9950X3D announcement while today AMD officially confirmed the release date and pricing on these new Zen 5 desktop CPUs with 3D V-Cache...</article>","contentLength":196,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GCC 15 Now Enables AArch64 Early Scheduling For -O3/-Ofast Modes","url":"https://www.phoronix.com/news/GCC-15-AArch64-Early-Sched","date":1741360404,"author":"Michael Larabel","guid":753,"unread":true,"content":"<article>The GCC \"-fschedule-insns\" option allows for reordering of instructions to eliminate execution stalls when required data is unavailable. This early scheduling option can be beneficial for systems with slow floating point performance or costly memory load instructions. With the upcoming GCC 15 release, AArch64 will be enabling this early scheduling optimization at the -O3 optimization level and higher...</article>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unofficial ROCm SDK Builder Expanded To Support More GPUs","url":"https://www.phoronix.com/news/ROCm-SDK-Builder-6.1.2","date":1741354826,"author":"Michael Larabel","guid":752,"unread":true,"content":"<article>The community-based ROCm SDK Builder is an unofficial project leveraging the open-source AMD ROCm code and making it easy to build machine learning and GPU compute software across a range of environments and helping ensure proper integration with other machine learning tools and models. The ROCm SDK Builder takes special focus on the consumer Radeon iGPUs and dGPUs that typically aren't as much of a focus for the upstream AMD ROCm stack...</article>","contentLength":443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}