{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","items":[{"title":"Trump Transition Leaders Call For Eased Tech Immigration Policy","url":"https://news.slashdot.org/story/24/12/27/0127229/trump-transition-leaders-call-for-eased-tech-immigration-policy?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735262820,"author":"msmash","unread":true,"desc":"","content":"theodp writes: In 2012, now-Microsoft President Brad Smith unveiled Microsoft's National Talent Strategy, a two-pronged strategy that called for tech visa restrictions to be loosened to allow tech companies to hire non-U.S. citizens to fill jobs until more American schoolchildren could be made tech-savvy enough to pass hiring standards. Shortly thereafter, tech-backed nonprofit Code.org emerged (led by Smith's next-door neighbor Hadi Partovi with Smith as a founding Board member) with a mission to ensure that U.S. schoolchildren started receiving 'rigorous' computer science education instruction. Around the same time, Mark Zuckerberg's FWD.us PAC launched (with support from Smith, Partovi, and other tech leaders) with a mission to reform tech visa policy to meet tech's need for talent. \n\nFast forward to 2024, and Newsweek reports the debate over tech immigration policy has been revived, spurred by the recent appointment of Sriram Krishnan as senior policy adviser for AI at the Trump White House. Comments by far-right political activist Laura Loomer on Twitter about Krishnan's call for loosening Green Card restrictions were met with rebuttals from prominent tech leaders who are also serving as members of the Trump transition team. Entrepreneur David Sacks, who Trump has tapped as his cryptocurrency and AI czar, took to social media to clarify that Krishnan advocates for removing country caps on green cards, not eliminating caps entirely, aiming to create a more merit-based system. However, the NY Times reported that Sacks discussed a much broader visa reform proposal with Trump during a June podcast (\"What I will do is,\" Trump told Sacks, \"you graduate from a college, I think you should get automatically, as part of your diploma, a green card to be able to stay in this country\"). Elon Musk, the recently appointed co-head of Trump's new Dept. of Government Efficiency (DOGE) had Sacks' and Krishnan's backs (not unexpected -- both were close Musk advisors on his Twitter purchase), tweeting out \"Makes sense\" to his 209 million followers, lamenting that \"the number of people who are super talented engineers AND super motivated in the USA is far too low,\" reposting claims crediting immigrants for 36% of the innovation in the U.S., and taking USCIS to task for failing to immediately recognize his own genius with an Exceptional Ability Green Card (for his long-defunct Zip2 startup). \n\nVivek Ramaswamy, who Trump has tapped to co-lead DOGE with Musk, agreed and fanned the Twitter flames with a pinned Tweet of his own explaining, \"The reason top tech companies often hire foreign-born -- first-generation engineers over \"native\" Americans isn't because of an innate American IQ deficit (a lazy -- wrong explanation). A key part of it comes down to the c-word: culture.\" (Colorado Governor Jared Polis also took to Twitter to agree with Musk and Ramaswamy on the need to import 'elite engineers'). And Code.org CEO Partovi joined the Twitter fray, echoing the old we-need-H1B-visas-to-make-US-schoolchildren-CS-savvy argument of Microsoft's 2012 National Talent Strategy. \"Did you know 2/3 of H1B visas are for computer scientists?\" Partovi wrote in reply to Musk, Loomer, and Sachs. \"The H1B program raises $500M/year (from its corporate sponsors) and all that money is funneled into programs at Labor and NSF without focus to grow local CS talent. Let's fund CS education.\" The NYT also cited Zuckerberg's earlier efforts to influence immigration policy with FWD.us (which also counted Sacks and Musk as early supporters), taking note of Zuck's recent visit to Mar-a-Lago and Meta's $1 million donation to Trump's upcoming inauguration. \n\nSo, who is to be believed? Musk, who attributes any tech visa qualms to \"a 'fixed pie' fallacy that is at the heart of much wrong-headed economic thinking\" and argues that \"there is essentially infinite potential for job and company creation ['We should let anyone in the country who is hardworking and honest and will be a contributor to the United States,' Musk has said]\"? Or economists who have found that immigration and globalization is not quite the rising-tide-that-raises-all-boats it's been cracked up to be?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Transition+Leaders+Call+For+Eased+Tech+Immigration+Policy%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F27%2F0127229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F27%2F0127229%2Ftrump-transition-leaders-call-for-eased-tech-immigration-policy%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/27/0127229/trump-transition-leaders-call-for-eased-tech-immigration-policy?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23562185&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AI sales rep startups are booming. So why are VCs wary?","url":"https://techcrunch.com/2024/12/26/ai-sdr-startups-are-booming-so-why-are-vcs-wary/","date":1735256871,"author":"Marina Temkin","unread":true,"desc":"","content":"<p>When you really probe venture capitalists about investing in AI startups, they&#8217;ll tell you that businesses are experimenting wildly but are very slow to add AI solutions into their ongoing business processes.&#160; But there are some exceptions. And one of them appears to be an area known as AI sales development representatives, or AI SDRs. [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Windows 11 Installation Media Bug Causes Security Update Failures","url":"https://it.slashdot.org/story/24/12/26/2329250/windows-11-installation-media-bug-causes-security-update-failures?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735255740,"author":"msmash","unread":true,"desc":"","content":"Microsoft is warning that Windows 11 installations using USB or CD media created with October or November 2024 security updates may be unable to receive future security patches. \n\nThe bug affects version 24H2 installations made between October 8 and November 12, but does not impact systems updated through Windows Update or the Microsoft Update Catalog. Microsoft advised users to rebuild installation media using December 2024 patches while it works on a permanent fix for the issue, which primarily affects business and education environments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+Installation+Media+Bug+Causes+Security+Update+Failures%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F2329250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F2329250%2Fwindows-11-installation-media-bug-causes-security-update-failures%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/26/2329250/windows-11-installation-media-bug-causes-security-update-failures?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23562123&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"GCC ASCII Art Visualizations, Timely Znver5 & Other Compiler Highlights Of 2024","url":"https://www.phoronix.com/news/Open-Source-Compilers-2024","date":1735251994,"author":"Michael Larabel","unread":true,"desc":"","content":"Both GCC and LLVM/Clang made great strides in 2024 in rounding up their latest C and C++ support, enabling new hardware targets, and a variety of other features. Plus other open-source compilers targeting different features / languages, device types, and more also advanced a lot this calendar year. For those excited about turning code into binaries, here's a look back at the most popular compiler articles on Phoronix...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New Research Unveils a Solution to Collateral Issues in Cross-Chain Decentralized Options","url":"https://hackernoon.com/new-research-unveils-a-solution-to-collateral-issues-in-cross-chain-decentralized-options?source=rss","date":1735250414,"author":"EScholar: Electronic Academic Papers for Scholars","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><a href=\"http://hackernoon.com/preview/Um9xbWbUFDMzkXakWgDh\">Abstract and Introduction</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/dKHrehhbzuaTHtgJFbvy\">Preliminaries</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/oyJxVXND1XBuIkqdQbUB\">Overview</a> </p></li>\n<li><p>Protocol</p>\n<p><a href=\"http://hackernoon.com/preview/zubShKzeJXXu82JolWP1\">4.1 Efficient Option Transfer Protocol</a></p>\n<p><a href=\"https://hackernoon.com/preview/DpuaIvNLjK32Qu0Ww6rb\">4.2 Holder Collateral-Free Cross-Chain Options</a> </p></li>\n<li><p>Security Analysis</p>\n<p><a href=\"https://hackernoon.com/preview/tvEU9LSYD1n72BFcPYRT\">5.1 Option Transfer Properties</a></p>\n<p><a href=\"https://hackernoon.com/preview/VAh9cc7JIcgJxxRg7Fpi\">5.2 Option Properties</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/EFqsX8ZQC0xIihPVO1wn\">Implementation</a></p></li>\n<li><p><a href=\"http://hackernoon.com/preview/QiR69gdekeOcmxVXfMmx\">Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/8Xg0iL7cvxWaswxK1nyU\">Conclusion and Discussion, and References</a></p></li>\n</ol>\n<p>\\\n<strong>A. Codes</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/6y2VWpQDepDSmB2qOM4S\">A.1 Robust and Efficient Transfer Protocol</a></li>\n<li><a href=\"http://hackernoon.com/preview/VefKnK0kRsutojZNjvDf\">A.2 Holder Collateral-Free Cross-Chain Options</a></li>\n</ul>\n<p><strong>B. Proofs</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/jPnJi8X5LswRotYNUva5\">B.1 Transfer Protocol Proofs</a></li>\n<li><a href=\"https://hackernoon.com/preview/R3bOBSwg5ZdKJAP8Bw5b\">B.2 Option</a></li>\n</ul>\n<h2 id=\"7relatedwork\">7 RELATED WORK</h2>\n<p>Currently, many on-chain options trading platforms are available in the market. They price the options using an Automatic Market Maker (AMM). Lyra [10] stands as the preeminent decentralized options trading platform, commanding around a third of the market’s TVL, and employs an AMM with a Black76 [4] pricing model. However, its operations hinge on external data feeds from oracle, such as spot prices and implied volatility. Hegic [44] decentralizes the writers’ risk and employs a fixed pricing rate based on option expiry date and target prices, which leads to less accurate pricing.</p>\n<p>\\\nIn traditional markets, the price of options is determined by supply and demand. Devising an effective pricing model for options by AMM faces challenges due to the lack of accurate supply and demand modeling. Therefore, an order-book based decentralized exchange shows up. Aevo [2] is a high-performance, order-book based decentralized exchange, which closely resembles the traditional options market. However, its current implementation employs an off-chain orderbook coupled with on-chain settlement, which introduces a higher degree of centralized risk into the protocol. Opyn [30] provides users with the ability to sell European options by minting ERC20 tokens as the option. These tokens can be destroyed to exercise rights or transacted in the market. However, the system faces challenges due to high gas fees on Ethereum and a lack of necessary liquidity for exchanges. All of above on-chain protocols lack universality, most [2, 10, 30, 44] currently only support ETH and BTC options trading and lack the flexibility of customized pricing to meet the needs of the traders</p>\n<p>\\\nA Hashed Timelock Contract (HTLC) can address the aforementioned issues by enabling two parties to create option contracts across two chains. These contracts lock assets, agreed upon by both parties, on two chains at a predetermined price. HTLCs [23, 29, 48] were originally designed for cross-chain atomic swaps. Subsequently, Han et al. [14] highlighted the optionality and fairness aspects for one party, demonstrating that an atomic crosschain swap is equivalent to a premium-free American call option. They estimate premiums with Cox-Ross-Rubinstein option pricing model [8]. They addresses the unfairness by incorporating a premium mechanism. In [47], the authors define a sore loser attack in cross-chain swaps and let participants escrow assets along with a negotiated option premium, which acts as compensation. Nadahalli et al. [26] separate the premium protocol from the collateral protocol, employs upfront communication of off-chain unspent transaction outputs as the option premium and collateral. [21, 42] introduce cross-chain atomic options, incorporating concepts such as the holder’s late margin deposit and early cancellation of the option. In [12], the authors introduce transferability of options. However, their approach requires long transfer times and does not support concurrent trading involving multiple buyers, which may lead to phantom bid attacks. An adversary can create multiple fake buyers who offer higher prices but fail to complete the transfer. Consequently, the option holder is unable to sell their position</p>\n<p>\\\nNone of these protocols eliminate the holder’s collateral in crosschain options. To eliminate the holder’s upfront collateral requirement, cross-chain transaction confirmation can be adopted to verify the collateral deposition on one chain when the option is exercised. This approach can employ cross-chain bridges. Some cross-chain bridges rely on external verification and introduces a trusted third party to facilitate message transmission. This approach is vulnerable to many attacks [40, 50], such as rug pulls [18], code vulnerabilities [28] and private key leakage [24]. Some bridges employ native verification and use light clients on both chains to verify proofs. This method requires complex smart contracts and incurs high verification and storage costs [9, 39, 46, 49]. The diversity and heterogeneity of blockchains significantly increase the time and cost of implementing a light client for each chain. An alternative is using Trusted Execution Environments (TEE) for cross-chain transactions [3, 41]. Those solutions are susceptible to both software and hardware vulnerabilities, including side-channel attacks, which present significant security risks [7, 20, 25, 36, 43].</p>\n<p>\\\nOur proposed approach provides an efficient cross-chain option protocol by combining HTLC logic with a signature scheme. This combination facilitates the transfer of positions and replacement of hashlocks in option contracts. Our approach eliminates the need for option holders to provide upfront collateral. Instead of relying on cross-chain bridges, we achieve this through a distributed protocol design bolstered by economic incentives.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Zifan Peng, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (zpengao@connect.hkust-gz.edu.cn);</p>\n<p>(2) Yingjie Xue, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (yingjiexue@hkust-gz.edu.cn);</p>\n<p>(3) Jingyu Liu, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (jliu514@connect.hkust-gz.edu.cn).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2410.15724\">available on arxiv</a> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Watch this robotic ‘Superman Suit’ rotate around a gymnastics bar","url":"https://techcrunch.com/video/watch-this-robotic-superman-suit-rotate-around-a-gymnastics-bar/","date":1735250053,"author":"TC Video","unread":true,"desc":"","content":"<p>Scientists at the Suzumori Endo Robotics lab in Tokyo have developed the Superman Suit: a suit powered by hydraulic artificial muscles that allow it to perform superhuman tasks. In this video, the suit demonstrates the ability to complete 15 rotations around a bar, making anyone into a great gymnast.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"ChatGPT Search can be tricked into misleading users, new research reveals","url":"https://techcrunch.com/2024/12/26/chatgpt-search-can-be-tricked-into-misleading-users-new-research-reveals/","date":1735248696,"author":"Charles Rollet","unread":true,"desc":"","content":"<p>ChatGPT's new search feature can be told to generate entirely positive product summaries thanks to hidden code, new research finds.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Making Cross-Chain Options More Efficient","url":"https://hackernoon.com/making-cross-chain-options-more-efficient?source=rss","date":1735248617,"author":"EScholar: Electronic Academic Papers for Scholars","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><a href=\"http://hackernoon.com/preview/Um9xbWbUFDMzkXakWgDh\">Abstract and Introduction</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/dKHrehhbzuaTHtgJFbvy\">Preliminaries</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/oyJxVXND1XBuIkqdQbUB\">Overview</a> </p></li>\n<li><p>Protocol</p>\n<p><a href=\"http://hackernoon.com/preview/zubShKzeJXXu82JolWP1\">4.1 Efficient Option Transfer Protocol</a></p>\n<p><a href=\"https://hackernoon.com/preview/DpuaIvNLjK32Qu0Ww6rb\">4.2 Holder Collateral-Free Cross-Chain Options</a> </p></li>\n<li><p>Security Analysis</p>\n<p><a href=\"https://hackernoon.com/preview/tvEU9LSYD1n72BFcPYRT\">5.1 Option Transfer Properties</a></p>\n<p><a href=\"https://hackernoon.com/preview/VAh9cc7JIcgJxxRg7Fpi\">5.2 Option Properties</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/EFqsX8ZQC0xIihPVO1wn\">Implementation</a></p></li>\n<li><p><a href=\"http://hackernoon.com/preview/QiR69gdekeOcmxVXfMmx\">Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/8Xg0iL7cvxWaswxK1nyU\">Conclusion and Discussion, and References</a></p></li>\n</ol>\n<p>\\\n<strong>A. Codes</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/6y2VWpQDepDSmB2qOM4S\">A.1 Robust and Efficient Transfer Protocol</a></li>\n<li><a href=\"http://hackernoon.com/preview/VefKnK0kRsutojZNjvDf\">A.2 Holder Collateral-Free Cross-Chain Options</a></li>\n</ul>\n<p><strong>B. Proofs</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/jPnJi8X5LswRotYNUva5\">B.1 Transfer Protocol Proofs</a></li>\n<li><a href=\"https://hackernoon.com/preview/R3bOBSwg5ZdKJAP8Bw5b\">B.2 Option</a></li>\n</ul>\n<h2 id=\"6implementation\">6 IMPLEMENTATION</h2>\n<p><em>Implementation</em>. We implemented, tested, and evaluated our proposed protocol, Efficient Cross-Chain Options without Upfront Holder Collateral, in Section 4.2.1. This was conducted within a simulated environment using the Ethereum Virtual Machine (EVM) (Remix VM Cancun) and the Solidity Compiler version 0.8.22. We employ the same signature algorithm as Ethereum, utilizing the secp256k1 curve and the Elliptic Curve Digital Signature Algorithm (ECDSA) [17]. Since EVM does not support direct on-chain verification of a public-private key pair, we implement the proof of the private key 𝑠𝑘 by signing a specific message with it. The corresponding codes are provided in Appendix A.</p>\n<p>\\\n<em>Expected Transfer Time Evaluation.</em> We compared our work with that of Engel and Xue [12]. Assuming that the probability of an option being transferred and ultimately finalized within the current network is 𝑝, the total number of transfers is 𝑋. Then, in their protocol, 𝑋 follows a geometric distribution, i.e. 𝑋 ∼ 𝐺(𝑝). The relationship between the expected successful transfer time and the successful transfer probability of each phase is illustrated in Figure 3, where mutate lock phase in Engel and Xue’s protocol to corresponds to the reveal phase in our protocol. When a large number of malicious nodes exist in the current network, say, the finalization probability is 10%, the duration of the mutate lock phase and the consistency phase in their protocol becomes significantly prolonged, reaching 45Δ, which is approximately equivalent to 2 days in Bitcoin. By initiating the replace phase earlier and consolidating the mutate and consistency phases, we significantly reduce the duration of these phases.</p>\n<p>\\\n<em>Gas Consumption Evaluation</em>. Figure 4 lists the gas consumption for contract deployment, option operations, and gas consumption in different phases, where gas price is 4.131 Gwei and ETH price is $2274.87 (Sep 7, 2024). We calculate the maximum gas used for each operation. In the transfer failure case, we only calculate the gas consumption of conforming parties.</p>\n<p>\\\nNotably, as shown in Figure 4a, compared to Engel and Xue’s protocol, the gas consumption for the holder transfer process has significantly decreased from 714,867 to 510,857 gas (a reduction of approximately 28.5% for successful transfers). For failed transfers, the gas consumption decreases from 330,350 gas to 248,388 gas (a reduction of approximately 3.4%). The gas consumption of the transferring writer also decreases to a similar level. The gas consumption for exercising an option increases from 96,916 to 145,337, while the gas consumption for abandonment decreased. This is because, during an exercise, Alice needs to deposit funds and Bob must fulfill the request by revealing the exercise secret. In contrast, for an abandonment, Bob only needs to perform a refund operation.</p>\n<p>\\\nFigure 4b illustrates the gas consumption of a successful transfer across different phases. In our protocol, the reveal phase only requires the seller to reveal a signature in one contract, significantly reducing gas consumption compared to the mutate and replace/revert phases, lowering the gas for the holder and the writer to 123,158 and 123,435 gas, respectively. However, gas usage in the consistency phase is higher than that of their protocol, as we verify signatures in both contracts to ensure consistency. </p>\n<p>\\\nThe gas consumption for contract deployment in our protocol is generally higher compared to Engel and Xue’s protocol due to additional security measures and DAPS support. For instance, the deployment costs for 𝐶𝑜𝑛𝑡𝑟𝑎𝑐𝑡𝐴 and 𝐶𝑜𝑛𝑡𝑟𝑎𝑐𝑡𝐵 in our protocol are 2,549,610 and 2,220,156 gas, respectively. Nonetheless, this is acceptable, as deploying a transferable HTLC contract in Engle and Xue’s protocol consumes around 2.0M gas, while our protocol adds more secure operations and reduces the cost of option transfer.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/null-5h034mu.png\" alt=\"Figure 3: Expected transfer time and successful probability.\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Zifan Peng, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (zpengao@connect.hkust-gz.edu.cn);</p>\n<p>(2) Yingjie Xue, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (yingjiexue@hkust-gz.edu.cn);</p>\n<p>(3) Jingyu Liu, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (jliu514@connect.hkust-gz.edu.cn).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2410.15724\">available on arxiv</a> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"How to Ensure Fairness in Option Contracts","url":"https://hackernoon.com/how-to-ensure-fairness-in-option-contracts?source=rss","date":1735246817,"author":"EScholar: Electronic Academic Papers for Scholars","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><a href=\"http://hackernoon.com/preview/Um9xbWbUFDMzkXakWgDh\">Abstract and Introduction</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/dKHrehhbzuaTHtgJFbvy\">Preliminaries</a></p></li>\n<li><p><a href=\"https://hackernoon.com/preview/oyJxVXND1XBuIkqdQbUB\">Overview</a> </p></li>\n<li><p>Protocol</p>\n<p><a href=\"http://hackernoon.com/preview/zubShKzeJXXu82JolWP1\">4.1 Efficient Option Transfer Protocol</a></p>\n<p><a href=\"https://hackernoon.com/preview/DpuaIvNLjK32Qu0Ww6rb\">4.2 Holder Collateral-Free Cross-Chain Options</a> </p></li>\n<li><p>Security Analysis</p>\n<p><a href=\"https://hackernoon.com/preview/tvEU9LSYD1n72BFcPYRT\">5.1 Option Transfer Properties</a></p>\n<p><a href=\"https://hackernoon.com/preview/VAh9cc7JIcgJxxRg7Fpi\">5.2 Option Properties</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/EFqsX8ZQC0xIihPVO1wn\">Implementation</a></p></li>\n<li><p><a href=\"http://hackernoon.com/preview/QiR69gdekeOcmxVXfMmx\">Related Work</a> </p></li>\n<li><p><a href=\"http://hackernoon.com/preview/8Xg0iL7cvxWaswxK1nyU\">Conclusion and Discussion, and References</a></p></li>\n</ol>\n<p>\\\n<strong>A. Codes</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/6y2VWpQDepDSmB2qOM4S\">A.1 Robust and Efficient Transfer Protocol</a></li>\n<li><a href=\"http://hackernoon.com/preview/VefKnK0kRsutojZNjvDf\">A.2 Holder Collateral-Free Cross-Chain Options</a></li>\n</ul>\n<p><strong>B. Proofs</strong></p>\n<ul>\n<li><a href=\"http://hackernoon.com/preview/jPnJi8X5LswRotYNUva5\">B.1 Transfer Protocol Proofs</a></li>\n<li><a href=\"https://hackernoon.com/preview/R3bOBSwg5ZdKJAP8Bw5b\">B.2 Option</a></li>\n</ul>\n<h2 id=\"52optionproperties\">5.2 Option Properties</h2>\n<p>In addition to the properties of the protocol during the option transfer process, here we explore the properties of option contracts.</p>\n<p>\\\n• <em>Option</em> <em>correctness</em>: If both the holder and writer are conforming, either the exercise does not occur, the holder does not lose their collateral and the writer does not lose their collateral and guarantee; or upon completion of the exercise, they will each receive the other’s collateral, and the writer will reclaim their guarantee. </p>\n<p>\\\n• <em>Exercisablity</em>: During the transfer of the writer position, the option holder can exercise the option without experiencing any delays or obstructions. </p>\n<p>\\\n• Failure <em>compensation</em>: If the holder initiates the exercise before expiration, he will either successfully exercise the option or receive the pre-agreed compensation guarantee.</p>\n<p>\\\nTheorem 6. <em>Protocol 4.2 satisfies option correctness: If both the Alice and Bob are conforming, then if Alice does not exercise the right, Alice doesn’t lose the 𝐴𝑠𝑠𝑒𝑡𝐴 and Bob doesn’t lose the 𝐴𝑠𝑠𝑒𝑡𝐺 and 𝐴𝑠𝑠𝑒𝑡𝐵; or if Alice exercise the right, then Alice will receive 𝐴𝑠𝑠𝑒𝑡𝐵 and Bob will receive 𝐴𝑠𝑠𝑒𝑡𝐴 and 𝐴𝑠𝑠𝑒𝑡𝐺 .</em></p>\n<p>\\\nTheorem 7. <em>Protocol 4.2 satisfies exercisablity: During the transfer from Bob to Dave, the option remains active, allowing Alice to exercise the option without any delays.</em></p>\n<p>\\\nTheorem 8<em>. Protocol 4.2 satisfies failure compensation: Before expiration, Alice can exercise the option successfully, or if the exercise fails, she is compensated with the guarantee deposited by Bob.</em></p>\n<p>\\\nThe proofs are included in the Appendix Section B.2.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Zifan Peng, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (zpengao@connect.hkust-gz.edu.cn);</p>\n<p>(2) Yingjie Xue, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (yingjiexue@hkust-gz.edu.cn);</p>\n<p>(3) Jingyu Liu, The Hong Kong University of Science and Technology (Guangzhou) Guangzhou, Guangdong, China (jliu514@connect.hkust-gz.edu.cn).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2410.15724\">available on arxiv</a> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Quadratic Networks Excel in Extracting Features Compared to Conventional Networks","url":"https://hackernoon.com/quadratic-networks-excel-in-extracting-features-compared-to-conventional-networks?source=rss","date":1735246813,"author":"Deconvolute Technology","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"https://hackernoon.com/preview/yrsOGhFdB3kKpS2crvEt\">Abstract and 1. Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/Sj6cgfPB82ICG7RrHOfh\">2. Preliminaries and 2.1. Blind deconvolution</a></p>\n<p><a href=\"http://hackernoon.com/preview/GnLL9E1ocgn6y3CvYrvB\">2.2. Quadratic neural networks</a></p>\n<p><a href=\"http://hackernoon.com/preview/XO9ehYuyQs9OOyIpAKq4\">3. Methodology</a></p>\n<p><a href=\"http://hackernoon.com/preview/dCCFHz2NjhdGSKEPtuWJ\">3.1. Time domain quadratic convolutional filter</a></p>\n<p><a href=\"http://hackernoon.com/preview/FEGYzZDn5EpHvqv3E9VC\">3.2. Superiority of cyclic features extraction by QCNN</a></p>\n<p><a href=\"https://hackernoon.com/preview/u9tXl7dbBNfaXXBcKGuv\">3.3. Frequency domain linear filter with envelope spectrum objective function</a></p>\n<p><a href=\"http://hackernoon.com/preview/GpI5xMfsU0DMJMjaomnq\">3.4. Integral optimization with uncertainty-aware weighing scheme</a></p>\n<p>4. Computational experiments</p>\n<p><a href=\"https://hackernoon.com/preview/1NH57yQOmrfFshfRNZZy\">4.1. Experimental configurations</a></p>\n<p><a href=\"https://hackernoon.com/preview/tVjaInct3NHRgwnrXmOR\">4.2. Case study 1: PU dataset</a></p>\n<p><a href=\"https://hackernoon.com/preview/rdkm2ROiWRCEybYK5Hyl\">4.3. Case study 2: JNU dataset</a></p>\n<p><a href=\"https://hackernoon.com/preview/8lbcVbF7mea1Ha011cl2\">4.4. Case study 3: HIT dataset</a></p>\n<p>5. Computational experiments</p>\n<p><a href=\"http://hackernoon.com/preview/2zMd1m9QvNAAiXbLPP1i\">5.1. Comparison of BD methods</a></p>\n<p><a href=\"http://hackernoon.com/preview/rCXoTKLeFFMU6Lher7JJ\">5.2. Classification results on various noise conditions</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3sSKJDVJaPRAGu8D8wm\">5.3. Employing ClassBD to deep learning classifiers</a></p>\n<p><a href=\"https://hackernoon.com/preview/TP3Yf9E2D3uQk9xt3azr\">5.4. Employing ClassBD to machine learning classifiers</a></p>\n<p><a href=\"https://hackernoon.com/preview/pboiHV3p6mY8iI8qT0DQ\">5.5. Feature extraction ability of quadratic and conventional networks</a></p>\n<p><a href=\"http://hackernoon.com/preview/PGMtWiUixRRKGcVaJWh7\">5.6. Comparison of ClassBD filters</a></p>\n<p><a href=\"http://hackernoon.com/preview/QuqQp6eDXNI5OoTo9SUS\">6. Conclusions</a></p>\n<p><a href=\"http://hackernoon.com/preview/s8PEYh7exnm8DsTlNAMP\">Appendix and References</a></p>\n<h2 id=\"55featureextractionabilityofquadraticandconventionalnetworks\">5.5. Feature extraction ability of quadratic and conventional networks</h2>\n<p>Previously, we have theoretically demonstrated that quadratic networks possess superior cyclostationary feature extraction ability to conventional networks. It is also necessary to validate the performance in practice. Therefore, we construct two time-domain filters using quadratic convolutional layers and conventional convolutional layers with an identical structure and then evaluate their feature-extraction performance on the JNU dataset subjected to -10 dB noise.</p>\n<p>\\\nThe signals are analyzed using the Fast-SC method [84]. The results, as depicted in Figure 8, clearly demonstrate that the quadratic network outperforms in terms of feature extraction capability. The bright lines in the spectral coherence, highlight the quadratic network can extract cyclic frequency across high and low frequency bands. Despite the severe attenuation of the signal amplitude due to the noise, the quadratic network effectively recovers the cyclic frequency of the signal. Remarkably, the amplitude of the initial few cyclic frequencies is even higher than that of the raw signal.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-bp83169.png\" alt=\"Figure 8: Denosing performance of the quadratic neural network and conventional network on the JNU dataset.\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Jing-Xiao Liao, Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China and School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(2) Chao He, School of Mechanical, Electronic and Control Engineering, Beijing Jiaotong University, Beijing, China;</p>\n<p>(3) Jipu Li, Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China;</p>\n<p>(4) Jinwei Sun, School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(5) Shiping Zhang (Corresponding author), School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(6) Xiaoge Zhang (Corresponding author), Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China.</p>\n<p>:::</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2404.15341\">available on arxiv</a> under CC by 4.0 Deed (Attribution 4.0 International) license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"ChatGPT and Sora went down for the second time this month","url":"https://techcrunch.com/2024/12/26/chatgpt-and-sora-went-down-for-the-second-time-this-month/","date":1735245711,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>ChatGPT, Sora, and OpenAI&#8217;s developer-facing API were down on Thursday for more than four hours. OpenAI says it started experiencing a major outage at 11 a.m. PT, but now says its services are slowly coming back online as of 3:16 p.m. PT. Frequent users of ChatGPT may recall that the service went down earlier this [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"BC.GAME Launches Wukong Slot Game, Now Playable With Crypto","url":"https://hackernoon.com/bcgame-launches-wukong-slot-game-now-playable-with-crypto?source=rss","date":1735245248,"author":"Chainwire","unread":true,"desc":"","content":"<p>NICOSIA, Cyprus, December 26th, 2024/Chainwire/--BC. GAME has launched its latest slot game, <strong><a href=\"https://bc.game/game/wukong-by-bc-originals\">Wukong</a></strong>, inspired by the highly popular AAA game Black Myth: Wukong. Released on December 24, this 6-reel, 5-row slot game invites players to join Wukong on his epic journey, with the chance to win up to 10,000 times their bet.</p>\n<p>\\\nThe game features key symbols from Black Myth: Wukong, including Wukong's Ruyi staff and treasure pearls, bringing the game's mythical world to life. Players can also enjoy the convenience of using cryptocurrency for gameplay, adding extra flexibility to the experience.</p>\n<h3 id=\"cryptointegrationwukongcannowbeplayedwithdbcandhundredsofcryptos\">Crypto Integration: Wukong Can Now Be Played with $BC and Hundreds of Cryptos</h3>\n<p>The BC.GAME gaming platform continues to integrate cryptocurrency, offering players the ability to play Wukong using $BC, the platform's native token, and other popular cryptocurrencies.</p>\n<p>\\\nIn celebration of the holiday season, BC.GAME is hosting a large-scale event, distributing a total of 200 million $BC tokens. Players can claim free $BC tokens directly to their accounts, which can then be used to play the <strong><a href=\"https://bc.game/game/wukong-by-bc-originals\">Wukong slot game</a></strong>.</p>\n<p>\\\nKey Features of the Wukong Slot Game:</p>\n<p>\\</p>\n<ul>\n<li>Play with Crypto: Users can enjoy the game using $BC, Bitcoin, Ethereum, and hundreds of Cryptocurrencies.</li>\n<li>High Win Potential: Wukong offers payouts of up to 10,000x the bet amount.</li>\n<li>Free Spins and Bonus Opportunities: Users can unlock additional rewards through free spins and bonus features to enhance gameplay.</li>\n<li>Wide Bet Range and RTP: With an RTP of 96% and bets ranging from $0.20 to $100 per spin, Wukong caters to both casual players and high rollers.</li>\n<li>Seamless Crypto Experience: Crypto users can enjoy a fast, secure transaction process, making the game more accessible and enjoyable.</li>\n</ul>\n<p>\\</p>\n<blockquote>\n  <p>Jack Dorset, CEO of BC.GAME commented on the launch, stating: \"With the release of Wukong, we are continuing our commitment to blending the rich history of gaming with the innovation of cryptocurrency. We’re excited to offer our players a unique opportunity to enjoy a high-quality slot game with the flexibility and security that digital currencies provide. This launch, along with our ongoing $BC airdrop, is part of our broader vision to make BC.GAME is the leading platform for crypto-powered gaming,”</p>\n</blockquote>\n<p>\\</p>\n<h3 id=\"aboutbcgame\">About BC.GAME</h3>\n<p><strong><a href=\"https://bc.game/\">BC.GAME</a></strong> is a leading online gaming platform that integrates blockchain technology and cryptocurrency into its casino games, by offering a secure, transparent, and decentralized experience, BC.GAME allows players to enjoy a variety of gaming options, including slots, table games, and live casino offerings.</p>\n<p>\\\nThe platform is dedicated to providing players with exciting, fair, and innovative ways to engage with the world of gaming.</p>\n<p>Website: <strong><a href=\"https://bc.game/\">https://bc.game/</a></strong></p>\n<p>X: <strong><a href=\"https://x.com/bcgame\">https://x.com/bcgame</a></strong></p>\n<p>Telegram: <strong><a href=\"https://t.me/bcgamewin\">https://t.me/bcgamewin</a></strong></p>\n<h3 id=\"contact\">Contact</h3>\n<p>Olivia D</p>\n<p>oliviadi@bcgame.com</p>\n<p>:::tip\nThis story was distributed as a release by Chainwire under HackerNoon’s Business Blogging Program. Learn more about the program&nbsp;<strong><a href=\"https://business.hackernoon.com/business-blogging?ref=hackernoon.com\">here</a></strong></p>\n<p>:::</p>\n<p>\\\n\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"How ClassBD Helps Machine Learning Models Detect Faults More Accurately","url":"https://hackernoon.com/how-classbd-helps-machine-learning-models-detect-faults-more-accurately?source=rss","date":1735243213,"author":"Deconvolute Technology","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<p><a href=\"https://hackernoon.com/preview/yrsOGhFdB3kKpS2crvEt\">Abstract and 1. Introduction</a></p>\n<p><a href=\"http://hackernoon.com/preview/Sj6cgfPB82ICG7RrHOfh\">2. Preliminaries and 2.1. Blind deconvolution</a></p>\n<p><a href=\"http://hackernoon.com/preview/GnLL9E1ocgn6y3CvYrvB\">2.2. Quadratic neural networks</a></p>\n<p><a href=\"http://hackernoon.com/preview/XO9ehYuyQs9OOyIpAKq4\">3. Methodology</a></p>\n<p><a href=\"http://hackernoon.com/preview/dCCFHz2NjhdGSKEPtuWJ\">3.1. Time domain quadratic convolutional filter</a></p>\n<p><a href=\"http://hackernoon.com/preview/FEGYzZDn5EpHvqv3E9VC\">3.2. Superiority of cyclic features extraction by QCNN</a></p>\n<p><a href=\"https://hackernoon.com/preview/u9tXl7dbBNfaXXBcKGuv\">3.3. Frequency domain linear filter with envelope spectrum objective function</a></p>\n<p><a href=\"http://hackernoon.com/preview/GpI5xMfsU0DMJMjaomnq\">3.4. Integral optimization with uncertainty-aware weighing scheme</a></p>\n<p>4. Computational experiments</p>\n<p><a href=\"https://hackernoon.com/preview/1NH57yQOmrfFshfRNZZy\">4.1. Experimental configurations</a></p>\n<p><a href=\"https://hackernoon.com/preview/tVjaInct3NHRgwnrXmOR\">4.2. Case study 1: PU dataset</a></p>\n<p><a href=\"https://hackernoon.com/preview/rdkm2ROiWRCEybYK5Hyl\">4.3. Case study 2: JNU dataset</a></p>\n<p><a href=\"https://hackernoon.com/preview/8lbcVbF7mea1Ha011cl2\">4.4. Case study 3: HIT dataset</a></p>\n<p>5. Computational experiments</p>\n<p><a href=\"http://hackernoon.com/preview/2zMd1m9QvNAAiXbLPP1i\">5.1. Comparison of BD methods</a></p>\n<p><a href=\"http://hackernoon.com/preview/rCXoTKLeFFMU6Lher7JJ\">5.2. Classification results on various noise conditions</a></p>\n<p><a href=\"http://hackernoon.com/preview/K3sSKJDVJaPRAGu8D8wm\">5.3. Employing ClassBD to deep learning classifiers</a></p>\n<p><a href=\"https://hackernoon.com/preview/TP3Yf9E2D3uQk9xt3azr\">5.4. Employing ClassBD to machine learning classifiers</a></p>\n<p><a href=\"https://hackernoon.com/preview/pboiHV3p6mY8iI8qT0DQ\">5.5. Feature extraction ability of quadratic and conventional networks</a></p>\n<p><a href=\"http://hackernoon.com/preview/PGMtWiUixRRKGcVaJWh7\">5.6. Comparison of ClassBD filters</a></p>\n<p><a href=\"http://hackernoon.com/preview/QuqQp6eDXNI5OoTo9SUS\">6. Conclusions</a></p>\n<p><a href=\"http://hackernoon.com/preview/s8PEYh7exnm8DsTlNAMP\">Appendix and References</a></p>\n<h2 id=\"54employingclassbdtomachinelearningclassifiers\">5.4. Employing ClassBD to machine learning classifiers</h2>\n<p>In comparison of deep learning models, classical machine learning (ML) classifiers offer some distinct advantages, including robust interpretability and lightweight models. However, these “shallow” ML methods invariably rely on</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-3j831ev.png\" alt=\"Table 13The F1 scores (%) of the compared backbone networks on the JNU and HIT datasets.\" /></p>\n<p>\\\nhuman-engineered features for bearing fault diagnosis, thereby exhibiting limited generalization ability in the design of end-to-end diagnozing models [6]. Given that ClassBD can enhance the performance of deep learning classifiers, we posit that it can also serve as a feature extractor to augment the performance of classical ML classifiers.</p>\n<p>\\\nConsequently, in this experiment, we utilize the pre-trained ClassBD as a feature extractor and feed the output of ClassBD into several ML classifiers for comparison: support vector machine (SVM) [88], k-nearest neighbor (KNN) [89], random forest (RF) [90], logistic regression (LR) [91], and a highly efficient gradient boosting decision tree (LightGBM) [92].</p>\n<p>\\\nThe results are presented in Table 14. Evidently, ClassBD significantly facilitates the performance of ML methods. Directly inputting raw signals into these ML classifiers results in markedly poor performance. On the JNU and HIT datasets, SVM and RF even fail to converge. However, with the incorporation of ClassBD, the classification performance experiences a substantial improvement. For instance, the KNN achieves a 90.71% F1 score on the JNU dataset, compared to a mere 2.89% F1 score without ClassBD. This performance even surpasses some deep learning methods. Nonetheless, ML methods exhibit instability across different datasets. The best-performing ML methods can only achieve a 49.77% score on the PU dataset. Despite this, we believe that the combination of ClassBD and ML methods presents a promising solution, promoting the study of high interpretability and efficiency in diagnostic approaches. We will explore this topic further in our future work.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/fWZa4tUiBGemnqQfBGgCPf9594N2-lv9317r.png\" alt=\"Table 14The F1 scores (%) of different machine learning methods on three datasets. Where the bold-faced numbers are the better results, ’-’ denotes the model failed to converge.\" /></p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Jing-Xiao Liao, Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China and School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(2) Chao He, School of Mechanical, Electronic and Control Engineering, Beijing Jiaotong University, Beijing, China;</p>\n<p>(3) Jipu Li, Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China;</p>\n<p>(4) Jinwei Sun, School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(5) Shiping Zhang (Corresponding author), School of Instrumentation Science and Engineering, Harbin Institute of Technology, Harbin, China;</p>\n<p>(6) Xiaoge Zhang (Corresponding author), Department of Industrial and Systems Engineering, The Hong Kong Polytechnic University, Hong Kong, Special Administrative Region of China.</p>\n<p>:::</p>\n<p>\\</p>\n<p>:::info\nThis paper is <a href=\"https://arxiv.org/abs/2404.15341\">available on arxiv</a> under CC by 4.0 Deed (Attribution 4.0 International) license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"DeepSeek’s new AI model appears to be one of the best ‘open’ challengers yet","url":"https://techcrunch.com/2024/12/26/deepseeks-new-ai-model-appears-to-be-one-of-the-best-open-challengers-yet/","date":1735242290,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>DeepSeek V3 can handle a range of text-based workloads and tasks, like coding, translating, and writing essays and emails from a descriptive prompt.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Blockchain Bridges Gaps Where Traditional Finance Fails, Says Stellar Development Foundation","url":"https://hackernoon.com/blockchain-bridges-gaps-where-traditional-finance-fails-says-stellar-development-foundation?source=rss","date":1735239613,"author":"Tereza Bízková","unread":true,"desc":"","content":"<p>\\\n<strong><em>During Devcon week in Bangkok, I had the opportunity to sit down with <strong><a href=\"https://www.linkedin.com/in/ankeliu\">Anke Liu</a></strong>, Ecosystem Growth Lead, and <strong><a href=\"https://www.linkedin.com/in/anna-whitson-diaz\">Anna Whitson-Diaz</a></strong>, Senior Partnerships Manager for Aid, both from the <strong><a href=\"https://stellar.org/foundation\">Stellar Development Foundation</a></strong> (SDF). Amid the mass focus on infrastructure, our conversation centered on the tangible, real-world impact of blockchain technology—a refreshing shift that highlighted the builder energy driving meaningful change.</em></strong></p>\n<h4 id=\"howdoesitfeelbeinginthailandandwhatmissionareyoubringingtodevcon\"><strong>How does it feel being in Thailand, and what mission are you bringing to Devcon?</strong></h4>\n<p><strong>Anke:</strong> There are so many interesting collaborators, developers, and teams here, all trying to work on the next big thing—or rather, the next better thing. What excites me the most is the collaborative mindset this community brings. It’s not about pushing a single solution as the \"best one\" for everyone, but instead asking, “How can we collectively solve these problems?” That open-mindedness makes such a difference.</p>\n<p>\\n At SDF, we see this collaborative spirit as essential because we work with a wide range of startups and teams. Our mission is about creating equitable access to the global financial system, and that looks different for different contexts and communities.</p>\n<p>\\\n<strong>Anna</strong>: My main focus is leading SDF’s aid and humanitarian portfolio, where I work with organizations—aid agencies and international organizations—that provide cash-based assistance and other forms of humanitarian aid.</p>\n<p>\\\nWhat’s been particularly meaningful for me is engaging directly with people from the refugee community, especially at the Funding the Commons. Now, more than ever, it’s essential that these communities are the ones shaping the solutions themselves.</p>\n<p>\\n I don’t even like the term “beneficiaries.” It feels disconnected. We need to engage the communities as active partners in designing solutions. The conversations here have given me plenty of takeaways on how the Stellar network can better serve not just refugee populations but also smaller, localized organizations closer to the ground.</p>\n<p>\\n Looking ahead, I want to focus on supporting small and medium-sized organizations. While we’ve partnered with large players like UNHCR, IRC, and GIZ—who have the resources and scope—there’s a shift in the international community toward funding organizations closer to the ground. This localization agenda supports smaller groups that are deeply embedded in their communities.</p>\n<p>\\n Seeing the innovation from startups here makes me optimistic about how we can better serve these local groups. It’s a tough space, but it’s where we can make a real difference by adapting to the growing focus on localization and direct impact.</p>\n<h4 id=\"letstalkaboutthepotentialofblockchainforthosepurposes\">Let’s talk about the potential of blockchain for those purposes…</h4>\n<p><strong>Anna</strong>: In the financial inclusion space, which is closely related to but slightly separate from humanitarian work, the challenges are massive. About one-third of the world doesn’t have a bank account, which means they’re excluded from the traditional financial system. This limits their ability to save, invest, or take out even small loans. For those of us living in countries where access to banking is taken for granted, it can be eye-opening to realize how widespread this exclusion is.</p>\n<p>\\n Blockchain offers a way for people to immediately connect to a global system that doesn’t rely on formal banking relationships. It’s decentralized, allowing individuals to access financial tools without intermediaries.</p>\n<p>\\\nFor example, Decaf, a wallet provider on the Stellar network, has connected women and rural communities in Colombia to the financial system. This has helped create circular economies and encouraged reinvestment in local communities. Even in areas without ATMs or banks, access to basic technology like a smartphone and the Internet can provide financial opportunities.</p>\n<p>\\\n<strong>Anke</strong>: Exactly! Blockchain makes it possible to transfer value—whether money or information—without needing to trust an intermediary like a bank. Instead, you trust the system itself. This has opened doors for small developer teams or even solo developers, allowing them to set up reliable services and scale quickly.</p>\n<p>\\n We work with teams from the ground up, helping them grow on the Stellar network. Many of these startups are based in regions like Africa and Latin America, where they deeply understand and meet the needs of their communities.</p>\n<p>\\n For instance, HoneyCoin in Kenya has integrated with M-Pesa, the local mobile money network. This allows anyone, including myself, when I visited Kenya, to use the wallet to pay vendors or individuals seamlessly. Local users can also top up their wallets, save in a stable currency, and even access DeFi protocols using Stellar smart contracts. This unlocks opportunities for saving and investing that many had never experienced before.</p>\n<p>\\\nAnother example is ClickPesa Debt Fund, which provides lending opportunities for small Tanzanian businesses in need of capital powered by a financial protocol on Stellar. Even without formal credit, people can access funding to grow their business, which drives economic opportunities in their area.</p>\n<p>\\\n<strong>Anna</strong>: We really care about \"blockchain for the real world.\" This means addressing the fact that most people still need to convert cryptocurrency into fiat currency. Our strength lies in our network of off-ramps, which make that process easy and accessible.</p>\n<p>\\n One of our key partnerships is with MoneyGram International. This allows people to cash out their crypto at any MoneyGram location worldwide. A great example is our collaboration with UNHCR in Ukraine. They’ve used this system to disburse over $5 million in aid, which recipients can cash out at MoneyGram locations—even across borders. This system offers a practical solution for displaced people or those in conflict zones, enabling them to safely transport their money and always have access to local fiat currency.</p>\n<p>\\n Another innovation is adapting traditional money management methods to blockchain. Bousol, a wallet in Haiti, addresses liquidity challenges by keeping digital currency within the ecosystem. They’ve adapted the concept of a rotating savings account—a traditional system where individuals contribute monthly and take turns accessing a lump sum.</p>\n<p>\\\nBy bringing this on-chain, Bousol allows participants to borrow from others in case of emergencies, ensuring they stay current in the savings pool. This merges traditional practices with blockchain technology, addressing the needs of unbanked or underbanked populations.</p>\n<p>\\\nWhat’s exciting is how these solutions combine traditional and new systems. They adapt to local contexts while making financial tools more accessible, bridging the gap between traditional and modern finance.</p>\n<h4 id=\"whydoesstellarworksowellforthefinancialinclusionusecase\">Why does Stellar work so well for the financial inclusion use case?</h4>\n<p><strong>Anke</strong>: At the core of Stellar’s success is its dual structure: the Stellar network, an open-source blockchain designed for payments, decentralized finance (DeFi), and financial services, and the Stellar Development Foundation (SDF), a nonprofit supporting the network. The SDF is focused on creating equitable access to the global financial system, prioritizing transparency and accessibility for everyone.</p>\n<p>\\\nThrough initiatives like the Stellar Community Fund and targeted grants, the SDF and the wider community foster projects that turn financial innovation into real-world impact. These projects—ranging from wallets and DeFi protocols to infrastructure for on and off-ramping—are key to advancing both financial inclusion and humanitarian efforts. The collaborative, mission-driven Stellar ecosystem makes it easier for teams to scale solutions that directly benefit underserved communities.</p>\n<p>\\\nWhen it comes to the blockchain itself, one of the standout advantages of Stellar is its incredibly low transaction costs—around one ten-thousandth of a US cent per transaction. This cost efficiency is especially important for financial inclusion, where small, frequent transactions are common. High fees are a barrier for many users, but with the low-cost Stellar structure, those barriers are largely removed, making it possible to send funds affordably, even for low-value transactions.</p>\n<p>\\\nThis is particularly critical for humanitarian organizations, which often handle bulk payments—think $100, $500, or $700 disbursements spread across hundreds or thousands of recipients. On other blockchains, these bulk transactions wouldn’t be financially viable due to high fees. But with the Stellar cost structure, organizations can create scalable, practical solutions to address real-world challenges, whether in emergency relief or long-term financial inclusion initiatives.</p>\n<h4 id=\"canyousharemoreaboutsomeofyourmajorcollaborations\">Can you share more about some of your major collaborations?</h4>\n<p><strong>Anna</strong>: One of SDF’sflagship projects is with UNHCR. They partnered with us to develop an open-source software platform for bulk cash disbursements called the Stellar Disbursement Platform. This platform was designed to enable rapid, low-cost, and transparent cash transfers and was born when conflict broke out in Ukraine.</p>\n<p>\\n UNHCR needed a way to move funds into Ukraine quickly, minimizing transaction costs. The Stellar Disbursement Platform allows for bulk disbursements at almost no cost—around 10,000 transactions per cent. Since its launch, it’s helped deliver nearly $5 million to more than 2,500 families in Ukraine and is now expanding to other geographies.</p>\n<p>\\n Recipients access their funds via a link sent by SMS or email. They can then receive digital currency into wallets like Vibrant, Decaf, or Beans. Off-ramps such as MoneyGram or local options, depending on the country, allow people to cash out in the most convenient way for their location.</p>\n<p>\\n In regions with limited smartphone or internet access, or where fiat systems are strained, we’ve also worked on localized solutions. For instance, in Syria, we’ve partnered with GIZ on a payroll program for hospital workers. Before using the Stellar network, payroll distribution took months, and workers had to visit cash-out points up to nine times. Now, payments are made directly and efficiently, reducing delays and improving safety.</p>\n<p>\\\n<strong>Anke</strong>: And in Lebanon, one of our partners faced transaction costs of up to 40% to get money into the country. With Stellar, the fees are negligible. Currently, MoneyGram offers a subsidy for aid recipients, so they pay no fees to cash out. For other transactions, like remittances, the fee is around 2%, a significant improvement over traditional systems.</p>\n<h4 id=\"whenworkingwithbuilderswhatarethemostcommonerrorstheymakeorobstaclestheyface\">When working with builders, what are the most common errors they make or obstacles they face?</h4>\n<p><strong>Anke</strong>: The biggest challenge is understanding the market and figuring out how to distribute your product effectively. Today, tools like Repl.it or even AI make it easier to quickly create a product. You can build an MVP in no time, but the real challenge is proving there’s a market for it. That’s why, with our Stellar Community Fund Build Award, we ask projects to demonstrate their market value.</p>\n<p>\\n This means doing things like user research, running beta interviews, gathering early users, or getting validation from other companies in the ecosystem. Once you can prove the need, we provide funding to help the team move forward. Then, the focus shifts to finding product-market fit—testing marketing strategies, iterating, and pivoting as needed.</p>\n<p>\\\n<strong>Anna</strong>: Especially when solving for financial inclusion, understanding the real need is crucial. It's important to have intellectual humility—acknowledging that you don’t know all the answers. Instead of assuming what people need, work directly with the community you’re trying to serve. Understand the problem from their perspective, not from your assumptions.</p>\n<p>\\\n<strong>Anke</strong>: You can’t be building in a vacuum. The best products are the ones that constantly check in with users. When adding new features, they seek feedback before moving forward. Projects that try to create the “perfect product” in isolation tend to fail. You need to stay flexible and be ready to pivot.</p>\n<p>\\n This is something we stress in our Kickstart Bootcamp. We help founders shift their mindset. Many hesitate to share their ideas early, saying, “It’s not ready yet.” My response is always, “No one cares if it’s perfect right now.” It’s not about protecting your idea—it’s about executing it well. Ideas are easy to come by; it’s the execution that counts.</p>\n<h4 id=\"becauseaproductisnevergoingtobefullyreadyright\">Because a product is never going to be fully ready, right?</h4>\n<p><strong>Anke</strong>: Absolutely. It might not be perfect, but get it out there, try it, pivot, and ship again. Most teams go through at least one pivot—it's normal. Your first idea isn’t usually your best. The most successful builders are those who persevere, stay open to feedback, and are willing to adapt when necessary. The key right now is figuring out how to stand out with distribution. That’s where a lot of builders can really make a difference.</p>\n<p>\\\nThe ClickPesa Debt Fund is my favorite example of this. They’ve been part of the Stellar community for around seven years and have gone through multiple pivots, faced roadblocks along the way, and kept pushing forward. At one point, they hit a regulatory wall with one of their initiatives. Instead of giving up, they adapted, found a new direction, and kept building.</p>\n<p>\\n Now, with Stellar smart contracts, they’ve connected with protocols like Blend and tools like Mercury as an indexer. These pieces helped them launch a debt fund where users can deploy capital and earn yield. They’re currently focused on microfinance institutions (MFIs) that support women-owned small and medium-sized businesses.</p>\n<p>\\n What’s exciting is how it combines doing good with creating financial opportunities—you can earn money while supporting businesses that need it. This is the future we’re building with the Stellar DeFi narrative.</p>\n<h4 id=\"istheresomethingyoudliketoseemoreofintheweb3space\">Is there something you’d like to see more of in the Web3 space?</h4>\n<p><strong>Anna</strong>: Definitely more projects focused on social good! Even within the Stellar ecosystem, we’ve seen that it’s possible to be both profitable and mission-driven. Many of our partners manage to do both, which is inspiring.</p>\n<p>\\n In the humanitarian space, there are still major challenges—like internet connectivity, lack of cell phones, and absence of ID. These are tough problems, and we need to partner with others—whether in Web3 or not—to solve them.</p>\n<p>\\n It would be great to see the community push these barriers further. But the hope is that we’ll eventually find ways to reach those hardest to help.</p>\n<p>\\\n<strong>Anke</strong>: I completely agree. Another area I’m passionate about is governance and human coordination. Coordination is a challenge not just in Web3, but in the world at large. While there have been experiments, none have scaled enough to address broader societal issues.</p>\n<p>\\n I’d like to see more focus on collaboration in governance. Can we put egos aside and build systems that work at scale? And can we design systems that are easier for the general public to engage with, helping us all coordinate better? If we get this right, it could help us work more effectively as a global community.</p>\n<h4 id=\"soisthereaninterestinggovernanceinitiativeyoureexcitedabout\">So, is there an interesting governance initiative you’re excited about?</h4>\n<p><strong>Anke</strong>: There are a few, but one I’m really excited about is reputation-based governance and flexible delegation models. At the Stellar Community Fund, we’re implementing decentralized decision-making processes supported by Neural Quorum Governance, which combines reputation-based voting power attribution with opt-in delegation.</p>\n<p>\\n What I find most exciting is the potential for governance models that can scale beyond Web3. I’m also inspired by research into governing the commons, like Elinor Ostrom’s work. There’s a gap between the technical work happening in Web3 and the real-world research on governance. If we could bring those together, we could build something really impactful.</p>\n<p>\\\n<strong>Anna</strong>: Blockchain foundations have a role to play in this space. They can help de-risk projects that governments, NGOs, or large organizations might hesitate to take on. These groups are cautious about experimenting with blockchain, especially crypto, because of their accountability to donors and taxpayers.</p>\n<p>\\n Blockchain foundations can test new ideas, prove their usefulness, and scale them without putting donor money at risk. We also help smooth the process by addressing regulatory and legal barriers, which vary by country.</p>\n<p>\\\nOur role includes funding pilots that may fail, learning from those failures, and making it easier for organizations to adopt these solutions.</p>\n<p>\\\n<strong>Anke</strong>: Exactly. Blockchain foundations are in a good position to take on risk by supporting novel ideas and informing policy. Ideally, we’d see more collaboration between foundations to create a more unified approach. Unfortunately, many foundations treat each other as competitors.</p>\n<p>\\\nDenelle Dixon, CEO and Executive Director of SDF, has been actively engaging with policymakers in Congress and other government forums. But we need more foundations working together to advocate for sensible regulations and show how this technology can be used responsibly.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"6G-AI Mashups Will Reshape the Telecom Industry","url":"https://spectrum.ieee.org/6g-ai-mashup","date":1735239603,"author":"Shashi Raj Pandey","unread":true,"desc":"","content":"<p>EU-U.S. joint initiatives are paving the way for next-gen wireless networks</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM5MzQ4MS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc3Njc4Njk5M30.pXJ_ULd_m4voeDiJwKghWc7oAMv_kZaQ0g4Ht-OidOk/image.jpg?width=600","enclosureMime":""},{"title":"Amazon's $8.45 Billion Gamble Clashes with Broccoli Family's Iron Grip on 007","url":"https://hackernoon.com/amazons-$845-billion-gamble-clashes-with-broccoli-familys-iron-grip-on-007?source=rss","date":1735238711,"author":"David Deal","unread":true,"desc":"","content":"<p>James Bond and Amazon are at war with each other in a clash between an Old Hollywood studio and a digital New Hollywood brand. Advantage: James Bond.</p>\n<p>\\\nHere are the two players in this epic struggle as reported in&nbsp;<em><strong><a href=\"https://www.wsj.com/business/media/james-bond-movies-amazon-barbara-broccoli-0b04f0db\">The Wall Street Journal</a></strong></em>:</p>\n<p>\\</p>\n<ul>\n<li>On the one hand, Amazon has a&nbsp;<strong><a href=\"https://hackernoon.com/amazon-mgm-and-the-triumph-of-new-hollywood-k2l366v\">50% stake in the James Bond franchise through its acquisition of MGM</a></strong>. Amazon wants to tap into the value of that franchise to create a multi-faceted cash cow, including movies, TV shows, spinoffs, and even a re-imaging of James Bond at a fundamental level.</li>\n</ul>\n<p>\\</p>\n<ul>\n<li>But Amazon does not have full control over the James Bond name. The Broccoli family, through their company EON Productions, has maintained creative control over the James Bond film franchise since its inception. And the Broccolis are unhappy with Amazon’s ambitions.</li>\n</ul>\n<p>\\\nSince the Broccolis control the Bond brand, we won’t be seeing Bond movies onscreen anytime soon. And this is a major problem with Amazon, which needs to exhibit tentpole movies in theaters to drive their streaming success. But Amazon has cash and muscle. As New Hollywood increasingly understands how to monetize the offline/online interplay between entertainment, Amazon will likely play it the way the Broccolis want it – for now.</p>\n<h2 id=\"amazonsgoldeneyecashinginonthevalueofafranchise\">Amazon’s GoldenEye: Cashing In on the Value of a Franchise</h2>\n<p>In 2021, Amazon acquired MGM Studios for $8.45 billion. MGM co-owns the rights to the James Bond film franchise alongside Danjaq LLC, which is controlled by EON Productions (and thus by Barbara Broccoli and her half brother Michael G. Wilson). This acquisition gave Amazon access to MGM’s extensive film library and intellectual property, including its 50% stake in James Bond.</p>\n<p>\\\nAmazon is not content to have access to movies. Amazon wants to create entertainment options beyond movies. This is not surprising. Amazon views entertainment as a means to generate revenue multiple streams, including Prime memberships -- to sell more baby wipes, coffee, vacuum cleaners, acne patches, and more. As Jeff Bezos once famously said, “<strong><a href=\"https://sg.finance.yahoo.com/news/anecdote-amazon-ceo-jeff-bezos-124500484.html\">When we win a Golden Globe, it helps us sell more shoes</a></strong>.” So, when Amazon has access to a lucrative franchise, the company milks its value.</p>\n<p>\\\nCase in point: the&nbsp;<em>Lord of the Rings</em>&nbsp;(<em>LOTR</em>). Amazon has monetized the&nbsp;<em>LOTR</em>&nbsp;franchise primarily through its streaming platform, Amazon Prime Video, while using&nbsp;<em>LOTR</em>&nbsp;to enhance its brand, attract subscribers, and explore merchandising and licensing opportunities:</p>\n<h3 id=\"primevideosubscriptions\">Prime Video Subscriptions</h3>\n<p>Amazon’s primary strategy with its&nbsp;<em>LOTR</em>&nbsp;series,&nbsp;<em>The Rings of Power</em>, is to drive subscriptions to Amazon Prime. By offering exclusive access to the show, Amazon aims to attract fans of the franchise and new viewers globally. This approach helps increase the number of Prime subscribers, who pay $139 annually or $8.99 monthly for Prime Video alone. The series serves as a flagship product to boost customer loyalty and retention within the competitive streaming market.</p>\n<h3 id=\"brandexpansionandprestige\">Brand Expansion and Prestige</h3>\n<p>Amazon also views the series as a long-term play to enhance the prestige of its brand and establish itself as a major player in entertainment. By associating with a globally beloved name like&nbsp;<em>LOTR</em>, Amazon aims to position itself alongside streaming giants like Netflix and Disney+. This strategy aligns with Jeff Bezos’s original vision of creating a&nbsp;<em>Game of Thrones</em>-level cultural phenomenon that generates buzz and awards recognition.</p>\n<h3 id=\"merchandisesales\">Merchandise Sales</h3>\n<p>Amazon is capitalizing on the&nbsp;<em>LOTR</em>&nbsp;franchise’s merchandising potential. From action figures to apparel,&nbsp;<em>LOTR</em>-related products have historically been highly sought after by fans. By selling merchandise through its eCommerce platform, Amazon can create additional revenue streams tied directly to the series.</p>\n<h3 id=\"licensingdeals\">Licensing Deals</h3>\n<p>Amazon has opportunities to monetize through licensing agreements for video games, tabletop games, and other products based on the&nbsp;<em>LOTR</em>&nbsp;universe. Such deals allow Amazon to extend the franchise’s reach while earning royalties from third-party creators.</p>\n<h3 id=\"longtermfranchisedevelopment\">Long-Term Franchise Development</h3>\n<p>Amazon’s $250 million rights acquisition includes a commitment to producing five seasons of&nbsp;<em>The Rings of Power</em>, with total costs projected to exceed $1 billion when factoring in production and marketing expenses. Beyond the main series, Amazon may explore spin-offs or other Middle-earth content, which could further monetize the franchise over time.</p>\n<h3 id=\"boostingrelatedsales\">Boosting Related Sales</h3>\n<p>The release of&nbsp;<em>The Rings of Power</em>&nbsp;has reportedly driven increased sales of Tolkien’s books and related media on Amazon’s retail platform. This cross-promotion benefits both the streaming service and eCommerce divisions, reinforcing Amazon’s ecosystem.</p>\n<h3 id=\"globalreach\">Global Reach</h3>\n<p>With Tolkien’s works enjoying worldwide popularity, Amazon has positioned&nbsp;<em>The Rings of Power</em>&nbsp;as a global product available in multiple languages via Prime Video. This international appeal broadens its audience base and maximizes revenue potential from diverse markets.</p>\n<h3 id=\"indirectbenefits\">Indirect Benefits</h3>\n<p>While direct profitability from&nbsp;<em>The Rings of Power</em>&nbsp;may be challenging given its massive production costs (e.g., $465 million for Season 1 alone), Amazon benefits indirectly by increasing overall engagement with its ecosystem. For example: Prime members who join for&nbsp;<em>LOTR</em>&nbsp;may also use Amazon’s retail services. The series enhances investor confidence by showcasing Amazon’s ability to compete in high-stakes entertainment markets.</p>\n<h2 id=\"shakennotstirredthebroccolifamilysrisktakinglegacy\">Shaken, Not Stirred: The Broccoli Family’s Risk-Taking Legacy</h2>\n<p>Despite owning 50% of the franchise through MGM, Amazon does not have full control over James Bond. The Broccoli family retains ironclad creative control through EON Productions. Albert R. “Cubby” Broccoli, along with Harry Saltzman, co-founded EON Productions in 1961 to bring Ian Fleming’s James Bond novels to the screen. Broccoli’s family has maintained control over the creative direction of the franchise ever since. Barbara Broccoli and Michael G. Wilson, who run EON, are considered the custodians of the James Bond character and hold significant authority over all aspects of the films, including casting, scripts, and marketing decisions. This means that any new Bond films, spin-offs, or projects must receive their approval. The Broccolis decide when a new Bond film is made, who plays the iconic role, and whether spin-offs or remakes are allowed. The family also proceeds at its own pace. Years can pass between one Bond film and the next.</p>\n<p>\\\nThe Broccolis view James Bond as a sacred name that not only generates revenue but influences culture. They are protective of how the James Bond name is licensed. And they treat the release of a James Bond movie as a global event akin to the Super Bowl. For the Broccolis, Bond lives and dies in theaters. The Broccolis have resisted efforts to expand Bond into areas like television series or cinematic universes. This doesn’t mean that the Broccolis are unwilling to license the Bond name. They may have standards, but they ain’t stupid. The Broccolis understand that keeping the Bond name relevant requires flexibility. For example, EON Productions has partnered with various game developers to create James Bond-themed video games. Activision held the rights from 2006 to 2014 to develop games based on Bond films and original storylines. Earlier successes include&nbsp;<em>GoldenEye</em>&nbsp;<em>007</em>&nbsp;(1997), which became a cultural phenomenon. James Bond’s iconic Aston Martin vehicles have appeared in video games like Rocket League as part of cross-promotional licensing deals. This strategy introduces the brand to younger audiences through popular gaming platforms</p>\n<p>\\\nEON Productions and MGM partnered with Scientific Games in 2017 to license James Bond for slot machines, lottery games, and social gaming platforms. This deal allowed for the integration of iconic elements from past and future Bond films into casino experiences. This makes sense given the association of the Bond name with casino gambling.</p>\n<p>\\\nThe Broccolis are also risk takers, such as casting unknowns to play the lead – a risk that famously paid off when Daniel Craig was chosen to play Bond in 2005. The decision was controversial. Craig was an unknown. Critics scoffed. But the Broccolis had the last laugh: Daniel Craig helped fuel James Bond to artistic and commercial heights. He updated Bond for the 21st&nbsp;Century and ensured 007’s cultural relevance.</p>\n<p>\\\nReportedly, the Broccolis have baffled Amazon with their willingness to take creative risks with the Bond name, especially with the Broccoli’s willingness to cast unknowns for the lead role, which is difficult to swallow for Amazon decision makers. Amazon calculates factors such as an actor’s known bankability. Not surprisingly, Amazon reportedly wants more say into who plays Bond.</p>\n<p>\\\nMeanwhile, in an early meeting with the Broccolis, Amazon Studios referred to James Bond as “content.” As reported in&nbsp;<em>The Wall Street Journal</em>, such a sterile term was a red flag to the Broccolis that James Bond was nothing more than a commodity to Amazon.</p>\n<p>\\\nWe won’t be seeing any Bond movies until the Broccolis and Amazon agree on fundamental issues such as who plays Bond. The Broccolis hold the cards, and they are patient. We last saw James Bond onscreen in 2021, with&nbsp;<em>No Time to Die</em>. Before that, Bond last appeared in 2015 with&nbsp;<em>Spectre</em>. In the digital age, years are like centuries.</p>\n<h2 id=\"liveandletstream\">Live and Let Stream</h2>\n<p>The impasse comes at a time when New Hollywood and Old Hollywood are rethinking the value of movies shown in theaters. On the one hand, the film industry is enduring a difficult time. Worldwide movie ticket sales in 2024 are projected at $31.5 billion, which is lower than the $33.4 billion forecast for 2023 and 25% below the pre-pandemic peak of $42.3 billion in 2019. Total ticket sales have declined noticeably from 2000 to 2024. But in one important way, theatrical releases of movies are becoming more valuable: by stoking demand for their eventual release on streaming platforms.</p>\n<p>\\\nAs&nbsp;<em>The</em>&nbsp;<em>New York Times</em>&nbsp;reports,&nbsp;<strong><a href=\"https://www.nytimes.com/2024/12/17/business/media/streaming-movies-theaters.html\">the value of theatrical releases as a driver for streaming success</a></strong>&nbsp;is becoming increasingly clear in the entertainment industry – including Amazon Prime Video. For example, Amazon Studios poured a hefty $250 million into producing&nbsp;<em>Red One</em>, a comedic holiday action movie featuring Dwayne Johnson and Chris Evans. The company then backed the film with a major theatrical rollout, debuting in over 4,000 theaters and spending tens of millions on marketing.</p>\n<p>\\\nWith the domestic box office pulling in just $80 million — half of which is shared with theater operators — the movie might seem like a significant misstep. But according to Courtenay Valenti, Amazon’s head of film, Amazon invested the money to make&nbsp;<em>Red One</em>&nbsp;a streaming sensation.</p>\n<p>\\\nAmazon reports that when&nbsp;<em>Red One</em>&nbsp;appeared on Prime Video,&nbsp;<strong><a href=\"https://variety.com/2024/film/news/red-one-prime-video-50-million-viewers-1236251153/\">it quickly claimed the top spot as the platform’s most popular movie, attracting 50 million viewers globally within its first four days</a></strong>. The film marked the most-watched streaming debut in Amazon MGM Studios’ history, all while continuing its theatrical run on over 3,000 screens across North America.</p>\n<p>\\\nAmazon has plenty of competition in its quest to achieve offline/online success. Paramount said that the theatrical release of&nbsp;<em>A Quiet Place: Day One</em>&nbsp;sparked a 207% rise in interest for earlier entries in the&nbsp;<em>Quiet Place</em>&nbsp;franchise that were streaming on the Paramount+ streaming service.</p>\n<p>\\\nAnd when&nbsp;<em>Kingdom of the Planet of the Apes</em>&nbsp;hit theaters in May, Disney-owned Hulu offered subscribers an “exclusive look” at the film. This movie built anticipation for the theatrical release and also encouraged viewers to explore the eight other&nbsp;<em>Planet of the Apes</em>&nbsp;films available in Hulu’s library. When&nbsp;<em>Kingdom of the Planet of the Apes</em>&nbsp;screened in theaters, the film’s visibility then built anticipation for its release on streaming. Talk about creating a virtuous circle.</p>\n<p>\\\nStreaming is also giving poorly reviewed movies a second chance with audiences unwilling to spend money on a flop (<em>Joker: Folie à Deux</em>, trashed by critics and a financial flop in theaters, is a hit on MAX.)</p>\n<p>\\\nOn HackerNoon,&nbsp;<strong><a href=\"https://hackernoon.com/what-does-the-future-hold-for-the-new-hollywood-streaming-industry\">I wrote about this phenomenon a few years ago</a></strong>&nbsp;as the lingering effects of the Covid-19 pandemic forced studios to figure out how to distribute movies online and in theaters amid uncertainty over when people would return to movie theaters and how often they would attend. Some studios sold movies originally intended for theaters directly to streaming services. Others experimented with simultaneously releasing films in movie theaters and streaming services, known as day-and-date releases.</p>\n<p>\\\nBut studios that gambled on exhibiting movies in theaters discovered that sometimes they could have it both ways: enjoy a hit in the theaters followed by streaming success. For example, in 2022,&nbsp;<em>The Batman</em>&nbsp;earned $750 million globally before Warner Brothers premiered the film the HBO Max streaming service.&nbsp;<em>The Batman</em>&nbsp;then enjoyed a first-week viewership of an estimated 4.1 million households (per Samba TV) — the second best first-week for a theatrical release on HBO Max. One of the biggest movie success stories of 2022 (or any year),&nbsp;<em>Top Gun: Maverick</em>, took&nbsp;<strong><a href=\"https://deadline.com/2022/11/top-gun-maverick-paramount-plus-streaming-date-1235179876/?ref=hackernoon.com\">seven months</a></strong>&nbsp;to arrive on its studio’s streamer (Paramount+), which didn’t stop it from immediately becoming the service’s&nbsp;<strong><a href=\"https://variety.com/2022/film/news/top-gun-maverick-paramount-most-watched-movie-1235475140/?ref=hackernoon.com\">№1 offering</a></strong>.&nbsp;<em>Black Panther: Wakanda Forever</em>&nbsp;banked $842 million globally during an 82-day run in theaters — and then&nbsp;<strong><a href=\"https://www.marvel.com/articles/movies/marvel-studios-black-panther-wakanda-forever-is-the-most-watched-marvel-film-premiere-on-disney-globally?ref=hackernoon.com\">became the most-watched Marvel premiere on Disney+ based on hours streamed within the first five days</a></strong>.</p>\n<p>\\\nNow the tail is wagging the dog. Studios see theatrical releases as a means to a streaming end. They are figuring out how to manage this interplay with effective marketing.</p>\n<p>\\\nThe biggest winners are Old Hollywood/New Hollywood hybrids like Disney, Paramount, and WarnerBros. Discovery that already possess film distribution and marketing know-how. And credit must be given to Warner Bros. Discovery CEO David Zaslav. When the WarnerBros. Discovery merger was announced in 2022, Zaslav articulated a blueprint for how New and Old Hollywood are operating now. Zaslav&nbsp;<strong><a href=\"https://www.wsj.com/articles/warner-bros-discovery-wont-overspend-to-win-streaming-subscribers-ceo-david-zaslav-says-11650977570?mod=article_inline&ref=hackernoon.com\">said</a></strong>, “We are not trying to win the direct-to-consumer spending war.” He noted that company would resist the trend of taking movies directly to streaming amid a pandemic-era decline in moviegoing. Instead, he actually increased the number of theatrical releases for the company’s movies.</p>\n<p>\\\nHe reasoned that movies in theaters would create buzz for their eventual streaming release while making box office revenues at the same time. “There’s an ecosystem of economic return when you open something in the theaters,” he said during an analyst conference in November 2022. For instance, the WarnerBros. movie&nbsp;<em>Elvis</em>&nbsp;was a&nbsp;<strong><a href=\"https://movieweb.com/elvis-producer-success-explain/?ref=hackernoon.com\">smash in theaters</a></strong>&nbsp;before going to HBO Max,&nbsp;<strong><a href=\"https://variety.com/2023/digital/news/oscars-best-picture-most-viewed-nielsen-elvis-streaming-1235541283/?ref=hackernoon.com\">where it also proved to be popular</a></strong>.</p>\n<h2 id=\"advertisingroyalehowtheatricalreleasesshapestreamingads\">Advertising Royale: How Theatrical Releases Shape Streaming Ads</h2>\n<p>Theatrical releases are important for another major reason: bolstering the advertising models for streaming platforms like Amazon, Disney, Netflix, and Paramount+.</p>\n<p>\\\nTheatrical releases enable streaming platforms like Amazon, Disney+, Netflix, and Paramount+ to enhance their advertising strategies by creating more compelling and targeted campaigns. For example, when a film transitions from theaters to a streaming platform’s ad-supported tier, advertisers benefit from the platform’s ability to identify patterns in viewer engagement. By analyzing aggregated data from pre-release marketing campaigns, box office performance, and eventual streaming metrics, platforms can offer advertisers tailored slots that align with audience preferences. These highly curated ad placements tend to deliver stronger results, such as improved ad recall and higher click-through rates.</p>\n<p>\\\nAdvertisers are particularly drawn to the ability of streaming platforms to segment their audience based on first-party data. For instance, after a theatrical release, Amazon might use behavioral insights from its retail ecosystem — such as consumer purchases of related merchandise or engagement with promotional content — to predict which audience segments are most likely to stream the movie. Armed with this information, Amazon Ads can deliver highly targeted campaigns on Prime Video, serving ads for products or services that align with the viewer’s interests. For example, a viewer who purchased tickets to a theatrical action movie might later see ads for travel gear or high-end gadgets tailored to their demographic, increasing the likelihood of ad engagement.</p>\n<p>\\\nUnlike traditional streaming platforms, Amazon can integrate its eCommerce capabilities with Prime Video ads, enabling product placement and direct shopping opportunities. For instance, viewers could see an ad for a product featured in a movie – like a James Bond film -- and purchase it immediately through Amazon’s retail platform. This creates a closed-loop system where advertising drives sales within Amazon’s ecosystem, further boosting revenue streams. Additionally, by offering premium content supported by ads, Amazon can attract price-sensitive consumers who might otherwise avoid subscription fees, expanding its audience base while maintaining profitability.</p>\n<p>\\\nDisney+, using its integration with Disney’s broader ecosystem, similarly enriches its advertising by combining viewer insights from theatrical campaigns with proprietary subscriber data. When a major film becomes available on Disney+, advertisers are offered premium slots during the high-traffic premiere period. These ads can feature immersive formats, such as interactive overlays or exclusive brand sponsorships, allowing brands to align themselves with blockbuster content and engage viewers on a deeper level. This strategy works particularly well for Disney+, as its ad-supported tier draws from a family-oriented audience, enabling brands to focus on cross-generational products with a strong emotional appeal.</p>\n<p>\\\nPlatforms like Paramount+ go a step further by tying advertising opportunities to the broader lifecycle of a film franchise. When&nbsp;<em>A Quiet Place: Day One</em>&nbsp;debuted in theaters, Paramount+ used the event to promote related streaming content, bundling ad slots that spanned both the theatrical lead-up and the streaming release. Advertisers could opt for integrated campaigns, such as showing trailers for upcoming movies or launching thematic ad creatives tied to the film’s suspenseful tone. This multi-phase strategy extends the ad lifecycle, giving advertisers multiple touchpoints to interact with highly engaged audiences.</p>\n<p>\\\nBy capitalizing on the cultural momentum of theatrical releases, streaming platforms transform ad-supported streaming into a high-value proposition for advertisers. These platforms provide an ecosystem where ads are become integrated parts of the viewer experience. For advertisers, this approach helps make sure that campaigns are both contextually relevant and strategically timed, resulting in higher engagement rates, better conversion outcomes, and greater ROI.</p>\n<p>\\\nIn 2024 alone, over-the-top (OTT) ad spending in the U.S.&nbsp;<strong><a href=\"https://www.dunhamandcompany.com/digital/2024-digital-advertising-trends-ott-growth-and-social-media-shifts/?t\">exceeded $10 billion in the first eight months</a></strong>. Amazon positions itself to capture a significant share of this expanding market while capitalizing on its unique ability to connect entertainment with commerce – but the key is to master the interplay between theatrical releases and streaming.</p>\n<h2 id=\"jamesbondwillreturn\">James Bond Will Return</h2>\n<p>In the digital age, there are few cultural phenomenon with the ability to make us drop what we are doing and really pay close attention. The Super Bowl is one. A Bond movie is another. And now, Bond has the ability to not only capture our attention but also keep it through its second life on streaming. Amazon knows this. That’s why Bond will return – the Broccoli way. Down the road, if Amazon can build trust with the Broccolis, I do believe it’s possible for the Broccolis to agree to more creative ways to share James Bond with the world beyond movies. They’ve done it before, as noted above. They can do it again.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Scientists Explore Longevity Drugs For Dogs That Could Also 'Extend Human Life'","url":"https://science.slashdot.org/story/24/12/26/1824221/scientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735237440,"author":"msmash","unread":true,"desc":"","content":"U.S. biotech startup Loyal plans to launch a lifespan-extending drug for dogs in early 2025, potentially offering insights into human longevity. The San Francisco-based company has secured $125 million in funding for LOY-002, a beef-flavored daily pill designed to extend canine lifespans by at least one year. The drug works by targeting age-related metabolic changes and insulin regulation, according to Loyal CEO Celine Halioua. \n\nSimultaneously, the Dog Aging Project is studying rapamycin, an immunosuppressant drug, which preliminary research suggests could add three years to dogs' lives. Researchers believe these canine studies could accelerate human longevity research, though experts note the lack of standardized aging biomarkers remains a significant hurdle for human trials.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Scientists+Explore+Longevity+Drugs+For+Dogs+That+Could+Also+'Extend+Human+Life'%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F26%2F1824221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F26%2F1824221%2Fscientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/26/1824221/scientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561905&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The One Profession Where Being a Jack of All Trades Is the Key to Success","url":"https://hackernoon.com/the-one-profession-where-being-a-jack-of-all-trades-is-the-key-to-success?source=rss","date":1735236015,"author":"Nadia Iaromirova","unread":true,"desc":"","content":"<h2 id=\"projectmanagementiseasybutitsnotforeveryone\">Project management is easy, but it’s not for everyone…</h2>\n<p>Whatever my title has been over the past 15 years, my work has always been a blend of different roles, all with one goal in mind: successfully delivering the projects assigned to me. Over time, I’ve learned that</p>\n<p>\\</p>\n<blockquote>\n  <p><strong><em>The key to success in project delivery is being a jack-of-all-trades.</em></strong></p>\n</blockquote>\n<p>\\\nYou need to manage the project, of course, but to successfully complete and deliver the project to production - most of the times you should also take ownership of the product you’re building. Additionally, you will act as a project analyst, an architect, conduct behavioral analytics, and dive deep into data to understand what to expect and what to improve with each new iteration.</p>\n<p>\\\nYou will act as a psychologist to your teammates; play dumb when the situation calls for it, and, at other times, think beyond your assigned role and responsibilities.</p>\n<p>\\\nYou will stick your nose into design, content, and user flows. You’ll play a role of a content manager and fix some stuff yourself if its needed. And surely, you will take on a sense of responsibility for the result, even when it’s technically not supposed to fall entirely on you.</p>\n<p>\\\nIt takes a mix of soft and hard skills to roll out a project successfully and on time. ==And here are <strong>a few very practical tricks</strong> I use and believe to be extremely effective.==</p>\n<h2 id=\"1learn\">1. Learn</h2>\n<p><strong>Learn the basics</strong> <strong>(at least) of everything that might help you.</strong> And know that this is a never-ending process. There always will be something new you’ll have to learn and apply to keep being successful in projects delivery.</p>\n<p>\\\nHere are some examples:</p>\n<ul>\n<li><strong>Learn Agile methodology.</strong> Even a basic understanding of Agile principles can be extremely helpful, especially when working in IT.</li>\n<li><strong>Basic SQL knowledge</strong> has allowed me to quickly answer simple data questions directly from the database. I don’t  need to create tasks for analytics teams or wait for them to complete requests. Instead, I can get answers to my marketing questions quickly and independently. And yes, even some basics of SQL are enough to do so. What typical marketer asks and consider important is a pretty basic for data analysts, but they do usually have a huge backlog, and you might wait too long for some basic info that is crucial for decision making, but annoying as a task for data analysts.</li>\n<li><strong>Google Analytics</strong> – now with GA4 God bless us all with this new version! But learning how to create dashboards that answer performance questions on your own saves you tons of time and ensures your decisions are data-driven from the start.</li>\n<li>Due to the same reason (to be data-driven), <strong>know your CRM and data structure</strong>. If your company uses Salesforce, invest time in understanding the differences between objects, the data structure, and basic reporting. Being able to quickly find answers to your questions is an invaluable skill.</li>\n<li><strong>Learn basic HTML.</strong> Spend some time learning how to read it and make simple edits. At the very least, train yourself to use tools like ChatGPT to assist you with it.</li>\n<li><strong>Learn Excel.</strong> It feels like there’s no end to the features and advanced tricks you can discover in Excel. Every year, I make time to complete a new course on Excel how-to’s, and I’m always amazed at how much I still don’t know—it’s just the tip of the iceberg!</li>\n<li><strong>Find unexpected skills that can help in surprising ways.</strong> For example:</li>\n<li>I completed a three-year interior design course that included composition, color studies, and other disciplines. This knowledge has been incredibly helpful in communicating with UI design teams. It has given me the ability to provide professional feedback and collaborate effectively, which I believe has led to the best results.</li>\n<li>I worked as a radio DJ for a while, and this experience has made me comfortable conducting calls or meetings. I don’t overthink or overprepare because I trust my improvisation skills to guide the conversation effectively.</li>\n<li>Knowing the basics of different languages (and overall, I’ve tried to learn around seven different languages) helped me perform a content manager's job better and even identify issues with translations.</li>\n<li>Finally, <strong>learn how to use AI</strong> to assist you. Spend some time learning how to write effective prompts that can help you with coding, design, or text-related tasks. For example, as a non-native English speaker, I often check the grammar and tone of my writing using available, free AI tools.</li>\n</ul>\n<h2 id=\"2document\"><strong>2. Document</strong></h2>\n<p>This might sound obvious, as it’s a fundamental principle of nearly every project management methodology, but I’ve seen countless examples where proper project documentation was missing. As well as the absence of clear tasks structure, no connections between several tasks under a single project epic —so let me start with this: ==document your projects== and never underestimate the importance of this step.</p>\n<p>\\\nDepending on the nature and scope of your project, it might include the following milestones:</p>\n<h3 id=\"21answerthequestionwhyarewedoingthis\">2.1 Answer the question: “Why are we doing this?”</h3>\n<p>In other words, create a <strong>==Business requirements==</strong> where you clearly define all business goals for the activity, including targets, and KPIs.</p>\n<p>\\</p>\n<blockquote>\n  <p><strong>Don’ts:</strong> What you should avoid doing is assigning tasks to the team without having clear business requirements in place. In large companies, there may be many different stakeholders requesting multidirectional updates to existing workflows or the creation of new ones (these requests could come from Sales, Product Management, the CEO directly—you name it). If you, as a project manager, lack an internal filter to prioritize and consolidate these requirements into a clear and agreed-upon \"to-be\" state that suits all parties, you risk creating chaos! Sometimes, a single page that consolidates and visualizes these diverse requests can help decision-makers clearly see the multidirectional requests, align, prioritize and define the proper next steps.</p>\n</blockquote>\n<p>\\\nAlso, because it’s always better to <strong>==be data-driven==</strong>, provide a snapshot of the current state—unless the project is entirely new and there’s nothing to analyze. Analyzing how things work today can help define KPIs and identify opportunities for optimization and improvement. Include everything you have—such as all collected metrics, scroll and heat maps, flow analytics, customer feedback, results of UX research, etc. All of this will contribute to creating a well-informed and effective future roadmap (or may lead to a decision to cancel the project).</p>\n<p>\\\nAfter that, you’ll be able to create a high-level project overview and <strong>==a preliminary roadmap==</strong> that outlines the main milestones and deliverables. Additionally, you should prepare a project charter that specifies responsibilities, identifies decision-makers, and provides a preliminary estimate of the resources required.</p>\n<h3 id=\"22answerthequestionhowarewedoingthis\">2.2 Answer the question: “How are we doing this?”</h3>\n<p>This can be fulfilled by creating several different requirement documents, such as:</p>\n<p>\\</p>\n<ul>\n<li><p><strong>Technical requirements:</strong> Collaborate with your developers to draft, review and sign off on technical documentation. Separate backend and front-end requirements. Involve architects when needed. Consult with QA early on to ensure their involvement and understanding of the project scope.</p></li>\n<li><p><strong>Content requirements:</strong> Ensure input from both the Product Marketing and SEO teams is included—this forms the foundation of your future traffic.</p></li>\n<li><p><strong>Legal requirements:</strong> In today’s landscape, compliance, privacy, and other legal aspects must be addressed upfront. Make sure you adhere to all relevant legal checklists.</p></li>\n<li><p><strong>Design mockups:</strong> Finalized and detailed design mockups with documented flows and behaviors are essential before development begins. Ensure all breakpoints are included and designs are approved by stakeholders. For complex projects, start with wireframes, and have them approved before moving on to the design stage.</p></li>\n<li><p><strong>Tracking markup:</strong> Ensure that appropriate tracking and analytics requirements are documented to capture the necessary data.</p>\n<p>\\</p></li>\n</ul>\n<p>Having all this documentation in place will enable all teams to begin the implementation process smoothly. You’ll address most questions upfront, ensuring everyone has clear visibility into what exactly is expected under this project.</p>\n<h3 id=\"23answerthequestionwhenarewedoingthis\">2.3 Answer the question: “When are we doing this?”</h3>\n<p>Once all requirements are collected, designs are finalized and approved, and technical documentation is ready, you can move to the implementation stage.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/IkC3RJ0dhpfyCTOwCY6m6VlQz542-r4335ar.jpeg\" alt=\"Gantt chart ensample using TeamGantt \" title=\"left-50\" /></p>\n<ul>\n<li><strong>Timeline or/and Gantt chart:</strong> Develop a granular project overview, allocating time and resources to each specific task. This will provide clarity on the project schedule and ensure proper planning for each phase.</li>\n<li><strong>Assign people.</strong></li>\n<li>You can also include the documentation and design phases in the beginning of your timeline for completeness, but these are generally more predictable and quicker compared to other stages. I usually plan it separately, during the early stage of my initial planning.</li>\n</ul>\n<p>\\\n\\</p>\n<blockquote>\n  <p><strong>Do’s:</strong> Whatever you’re doing as a project manager, make sure to get it approved—multiple times and by different people, depending on the stage of your project. Approve all business requirements and the desired future state of your project with your stakeholders, using design mockups for clarity. Review and approve technical documentation with your development teams and solution architects. If necessary, involve analytics and operations teams as well. Approve with legal department to be compliant. Always play it safe—get your plans approved before moving into implementation.</p>\n</blockquote>\n<p>\\\nWhen the entire cycle of project documentation, planning, and approvals is completed, the only remaining step is implementation. And the better prepared you are, the smoother the process will be.</p>\n<p>\\\nBased on practice, at the very beginning, when I first start drafting project documentation, I don’t focus too much on the format. Most of the time, in addition to using a notebook (which I still rely on heavily for handwriting and sketching), I use tools like Miro boards to create rough sketches, mind maps, and diagrams of systems and their interconnections. My initial notes might be somewhat chaotic, and that’s okay.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/IkC3RJ0dhpfyCTOwCY6m6VlQz542-l9135us.jpeg\" alt=\"An example of the Miro board draft\" title=\"left-50\" /></p>\n<p>As I gather more knowledge, collect all requirements, and have discussions with the necessary teammates, the structure of the documentation naturally evolves. I refine it, organize it, and clean it up to make it ready for sharing with other teams.</p>\n<p>\\\nFor detailed guidance, you can refer to resources on creating project documentation directly within tools like Atlassian’s Confluence, which is widely used in the IT industry for both Project and Tech documentation. But just start to compile something, and it will evolve.</p>\n<h2 id=\"3collaborate\">3. Collaborate</h2>\n<p>Remember, to deliver your project to production successfully and on time, you’re the \"three-in-one persona\" and the one in charge—so take the lead. Be proactive and stick your nose into everything. It’s on you to:</p>\n<p>\\</p>\n<ul>\n<li>Reach out to stakeholders.</li>\n<li>Go through and actually understand all the documentation that’s already been created.</li>\n<li>Talk to different departments to make sure they’re not going to be “damaged” by the update you’re working on.</li>\n</ul>\n<p>\\\nSet up meetings to get the requirements you need. And widen your ‘advisory board’: find the people who know all the “whys” behind the current solutions—those who can explain what’s possible to change, what’s not, and why. Understand your technical debt. Brainstorm with the teams to figure out the future state of the project.</p>\n<p>\\</p>\n<blockquote>\n  <p><strong>Do’s:</strong> Don’t be afraid of being annoying by asking a million questions. It’s so much better to get everything clear before development starts than after. That said, do your homework first! Make sure you’ve checked the existing documentation and haven’t skipped over something you could Google yourself. When you do ask questions, show up prepared—you’ll get much better answers that way. But I’m also not afraid to play dumb when needed. Sometimes, that’s the only card that works!</p>\n</blockquote>\n<p>\\</p>\n<h2 id=\"4simplify\">4. Simplify</h2>\n<p>Make things simple! If something feels too complicated, break it down into smaller, simpler parts. While the overall architecture of the project may indeed be complex, each individual component should be straightforward.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/IkC3RJ0dhpfyCTOwCY6m6VlQz542-rb73525.jpeg\" alt=\"Simplify everything possible \" title=\"right-50\" /></p>\n<p>If I can’t explain something in simple terms, I take it as a sign that I don’t fully understand it. This prompts me to dig deeper, gain clarity, and develop the ability to explain it in clear, straightforward language, often with examples.</p>\n<p>\\\nSometimes, you might inherit a project with overly complex logic that takes ages to comprehend. In 99.9% of cases, there’s room for simplification. This is often because the way people think varies, and some tend to overcomplicate things due to their natural inclination toward complexity. Most of the time, with ‘my iteration’ I rebuild such projects in a much more straightforward and efficient way. There’s always a way to simplify things, largely because I’ve trained myself to approach problems with simplicity in mind.</p>\n<p>\\\n<strong>==So, develop the habit of simplifying.==</strong></p>\n<h2 id=\"5practice\">5. Practice</h2>\n<p>You can read hundreds of articles on how to be a successful project manager, but nothing can replace real-life experience. Just do it!</p>\n<p>\\</p>\n<blockquote>\n  <p>Fail or succeed → Learn → Repeat</p>\n</blockquote>\n<p>\\\nDon’t be afraid to make mistakes in the beginning. Learn from your experiences. Practice, and continue gaining new knowledge along the way. All it takes is for you to start. If you’re truly determined, you’ll figure it out—sooner or later, faster or slower—but you absolutely will.</p>\n<p>\\\nAnd in case you’re just starting your journey and need some mentorship or advice, feel free to reach out to me on <a href=\"https://www.linkedin.com/in/yaromirova/?ref=hackernoon.com\">LinkedIn</a>.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The fall of EV startup Fisker: A comprehensive timeline","url":"https://techcrunch.com/2024/12/26/the-fall-of-ev-startup-fisker-a-comprehensive-timeline/","date":1735234920,"author":"Henry Pickavet, Sean O'Kane","unread":true,"desc":"","content":"<p>Here is a timeline of the events that led fledgling automaker Fisker to file for bankruptcy.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"KDE Enjoyed A Stellar 2024 With The Debut Of The Plasma 6 Desktop","url":"https://www.phoronix.com/news/KDE-2024-Highlights","date":1735234200,"author":"Michael Larabel","unread":true,"desc":"","content":"The KDE desktop progress made over the course of 2024 was particularly stand-out thanks to the Plasma 6.0 debut near the beginning of the year and then Plasma 6.1 and 6.2 further stabilizing and polishing this open-source desktop. It was a very fine year for the KDE desktop...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Even Apple Wasn't Able To Make VR Headsets Mainstream in 2024","url":"https://tech.slashdot.org/story/24/12/26/1722240/even-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735233720,"author":"msmash","unread":true,"desc":"","content":"Apple's $3,499 Vision Pro headset has failed to gain widespread adoption despite advanced technology, with consumers preferring discreet wearables like smartwatches. The Verge: Nearly a year from launch, though, Apple hasn't done enough to demonstrate why the Vision Pro should be a potential showcase of the future of computing. It's taking a long time to put together its immersive content library, and while those are great demonstrations of what's possible, the videos have been short and isolating. There aren't many great games, either. \n\nYes, Apple keeps adding cool new software features. The wide and ultra widescreen settings for using a Mac display seem exceptionally useful. But those are pretty specific options for pretty specific use cases. There still isn't an immediate, obvious reason to buy a Vision Pro the way there usually is with the company's newest iPhones and Macs. If I bought a Vision Pro today, I wouldn't know what to do with it besides give myself a bigger Mac screen or watch movies, and I don't think either of those are worth the exorbitant price.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Even+Apple+Wasn't+Able+To+Make+VR+Headsets+Mainstream+in+2024%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F1722240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F1722240%2Feven-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/26/1722240/even-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561847&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft and OpenAI have a financial definition of AGI: Report","url":"https://techcrunch.com/2024/12/26/microsoft-and-openai-have-a-financial-definition-of-agi-report/","date":1735233362,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>Microsoft and OpenAI have a very specific, internal definition of artificial general intelligence (AGI) based on the startup&#8217;s profits, according to a new report from The Information. And by this definition, OpenAI is many years away from reaching it. The two companies reportedly signed an agreement last year stating OpenAI has only achieved AGI when [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Executive assistants, high salaries, and other ways early-stage founders will trigger a seed VC","url":"https://techcrunch.com/2024/12/26/executive-assistants-high-salaries-and-other-ways-early-stage-founders-will-trigger-a-seed-vc/","date":1735233229,"author":"Julie Bort","unread":true,"desc":"","content":"<p>While most seed investors believe founders should spend their raised cash however they want to, those VCs will still be judging founders’ cash management.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Elon Musk’s jets made 355 trips in 2024, including 31 to or from the Mar-a-Lago area","url":"https://techcrunch.com/2024/12/26/elon-musks-jets-made-355-trips-in-2024-including-31-to-or-from-the-mar-a-lago-area/","date":1735232970,"author":"Margaux MacColl","unread":true,"desc":"","content":"<p>Elon Musk’s jets took over 355 flights this year, with 31 of those flights heading to or from near Mar-a-Lago. </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The 4-Step Framework Can Help You Go from £0 to £1 Million ARR Within a Year","url":"https://hackernoon.com/the-4-step-framework-can-help-you-go-from-pound0-to-pound1-million-arr-within-a-year?source=rss","date":1735232940,"author":"James Effarah","unread":true,"desc":"","content":"<p>This isn’t your typical blog packed with jargon and frameworks that sound like they were brainstormed during an all-hands at a big tech giant.</p>\n<p>\\\nNo, this is real, gritty advice from the trenches—advice that comes from taking a gamification platform from £0 to £1M ARR in only one year as a 0 to 1 product manager.</p>\n<p>\\\nWe’re diving into the art of building something from scratch: establishing processes, defining culture, and securing tech partnerships.</p>\n<p>\\\n<strong>==<em>Note:</em>==</strong> ==<em>for SEO purposes I will be redacting my startup’s name to simply “my start up” so that this article does not rank for my startups company name, but I am sure you can guess which one I am talking about</em> 😉.==</p>\n<h2 id=\"whatisa0to1productmanager\"><strong>What Is a 0 to 1 Product Manager?</strong></h2>\n<p>The <strong>0 to 1 product</strong> journey in <a href=\"https://hackernoon.com/how-to-product-manage-startup-edition-7-steps-to-sanity\">product management</a> is like losing your AirPods, finding your old wired earbuds from 2012, and spending the next 35 minutes of your commute trying to untangle them.</p>\n<p>\\\nSimply put, zero to one <a href=\"https://hackernoon.com/is-product-management-stressful\">product management is </a><em><a href=\"https://hackernoon.com/is-product-management-stressful\">stressful</a></em>.</p>\n<p>\\\nIt’s about making connections that are obvious in hindsight but blood-boilingly frustrating to identify in the moment.</p>\n<p>\\\nIn startup terms, this usually means launching a <a href=\"https://www.command.ai/blog/lenny-rachitsky-newsletter-growth/\">minimum viable product</a> (MVP), <a href=\"https://www.linkedin.com/advice/0/what-most-successful-product-feedback-iteration\">iterating on feedback</a>, <a href=\"https://productschool.com/blog/product-strategy/product-managers-growth-hackers\">scaling for growth</a>, then trashing it all and starting over until you get some traction.</p>\n<p>\\\nBut too many people think being a 0 to 1 product manager is just about building the product.</p>\n<p>\\\n<em>It’s not</em>.</p>\n<p>\\\nIt’s about laying the foundation for the team, culture, and processes that will sustain it.</p>\n<h3 id=\"butwhy0to1specifically\">But why 0 to 1 specifically?</h3>\n<p>Not only is $1 million ARR (or £1 million ARR for me since I’m British now) a powerful milestone for a startup and product manager’s career, but the phrase was also popularized by former CEO and co-founder of Paypal, <a href=\"https://hackernoon.com/minimal-knowledge-pt-ae-attacks-on-black-box-speaker-recognition-models\">Peter Thiel</a> in his book, <em><a href=\"https://medium.com/swlh/zero-to-one-by-peter-thiel-review-and-deconstructing-a-bestseller-f64116b757f4\">Zero to One</a></em> where he coined the original concept of taking a product from nothing into its first user-ready iteration.</p>\n<h2 id=\"thebigtechvsstartuprevelation\"><strong>The Big Tech vs. Startup Revelation</strong></h2>\n<p>When I transitioned from an product manager MBA internship at Activision Blizzard, working on the Candy Crush Saga (a <a href=\"https://www.businessofapps.com/data/candy-crush-statistics/\">£1.2 billion ARR mobile game</a>), to heading product at my startup, I—naively—thought I would have all the tools I needed for growth.</p>\n<p>\\\nI knew all the prioritization frameworks, had Google/Uber/Meta case interviews memorized, and could build an executive powerpoint presentation with my eyes closed.</p>\n<p>\\\n<em>All the most useless things when it comes to startup product management.</em></p>\n<p>\\\nI quickly learned that product management at a startup is a completely different beast.</p>\n<p>\\\nAt Activision Blizzard, every process and resource you could dream of was already in place.</p>\n<p>\\\nWhen a new feature launched, it plugged into a well-oiled machine of engineers, game designers, QA teams, and marketing workflows.</p>\n<p>\\\nAt my startup?</p>\n<p>\\\nThere was no machine.</p>\n<p>\\\nHeck, there wasn’t even a lever.</p>\n<p>\\\nI had to build it all—by hand.</p>\n<h2 id=\"whatsetsa0to1productmanagerapart\"><strong>What Sets a 0 to 1 Product Manager Apart</strong></h2>\n<p>If you’re stepping into a 0 to 1 role, here’s what you need to know:</p>\n<h3 id=\"1extremeownership\"><strong>1. Extreme Ownership</strong></h3>\n<p>Yes, I regularly wake up at 4:30am to run in the London rain.</p>\n<p>\\\nYes, I am borderline insane when it comes to organizing Jira tickets, backlogs, roadmaps, and Confluence docs.</p>\n<p>\\\n<strong><em>So yes</em></strong>, I am going to use a Jocko Willink quote in a product management blog.</p>\n<p>\\\n<a href=\"https://www.linkedin.com/pulse/ownership-crucial-product-management-skill-320-jens-fabian-goetzmann\">The single most important mindset for a 0 to 1 product manager is ownership</a> (<strong><em><strong>OWNERSHIP</strong></em></strong>).</p>\n<p>\\\nYou don’t just own the product—you own the culture, processes, partnerships, and ways of working for the entire team.</p>\n<p>\\\nFor me, this meant teaching team members who had no formal product training the “why,” “how,” and “when” of product decisions.</p>\n<p>\\\n<strong><em>Action Item</em></strong>: Define and document every process. If you’re not documenting it, you’re leaving it up to interpretation, and chaos will reign.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/OU582BtFnvdXLAg1E9gbjnbmEEx1-xi135ic.jpeg\" alt=\"\" /></p>\n<h3 id=\"2automateordietrying\"><strong>2. Automate or Die Trying</strong></h3>\n<p>Startups don’t have the manpower for manual, repetitive tasks.</p>\n<p>\\\nBelieve it—one of my most impactful contributions was automating our bug reporting workflow.</p>\n<p>\\\nBefore automation, reporting a bug meant ping-ponging between Slack and Jira while manually tracking every update.</p>\n<p>\\\nHere’s what I implemented:</p>\n<ul>\n<li>Customer flags a bug → Slack workflow auto-creates a Jira ticket.</li>\n<li>Jira ticket auto-assigns to a dev with capacity.</li>\n<li>When resolved, Slack notifies the team and the customer.</li>\n</ul>\n<p>\\\nThis process saved <strong>thousands of hours</strong> (<em>1,926 hours between my customer success manager,my solutions consultant, and I in 2023 to be exact</em>) and reduced total reported bugs from 321 to 121 in a year—all while increasing&nbsp; app usage by 97%.</p>\n<p>\\\n<strong><em>Action Item</em></strong>: Identify repetitive tasks and automate them. Tools like <a href=\"https://slack.com/intl/en-gb/features/workflow-automation\">Slack workflows</a>, <a href=\"https://www.productplan.com/blog/zapier-product-management/\">Zapier</a>, <a href=\"https://activitytimeline.com/blog/product-management-in-jira-tips-and-integrations\">Jira integrations</a>, and of course, ChatGPT, are your best friends. (take them out for a pint afterwards, they deserve it).</p>\n<p><img src=\"https://cdn.hackernoon.com/images/OU582BtFnvdXLAg1E9gbjnbmEEx1-32235jp.jpeg\" alt=\"\" /></p>\n<h3 id=\"3feedbackloopsareyoursecretweapon\"><strong>3. Feedback Loops Are Your Secret Weapon</strong></h3>\n<p>In a team of 12, conducting full-scale UX research wasn’t an option.</p>\n<p>\\\nInstead, I turned my startup’s app into a <a href=\"https://www.techtarget.com/searchitchannel/definition/feedback-loop#:~:text=A%20feedback%20loop%20is%20the,first%20stage%2C%20input%20is%20created.\">feedback loop</a> machine.</p>\n<p>\\\nNon-intrusive product tours, onboarding flows, and <a href=\"https://www.plotline.so/blog/in-app-nudges-ultimate-guide\">in-app nudges</a> collected user insights in real time.</p>\n<p>\\\nThis approach allowed us to iterate quickly and sustainably.</p>\n<p>\\\nOur tech stack for this is <a href=\"https://www.chameleon.io/\">Chameleon.io</a> (thanks <a href=\"https://www.linkedin.com/in/agrawalpulkit/\">Pulkit</a>!) for product tours and in-app feedback loops, <a href=\"https://www.hotjar.com/\">HotJar</a> for heatmaps and recordings, and <a href=\"https://zapier.com/\">Zapier</a> for automating UX interview bookings.</p>\n<p>\\\n<strong><em>Action Item</em></strong>: Embed AUTOMATED UX feedback loops directly into your product. Your users are your best (and cheapest) source of insights.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/OU582BtFnvdXLAg1E9gbjnbmEEx1-fv3351b.jpeg\" alt=\"\" /></p>\n<p><em>Ready for that clickbaity number 4 I promised?</em></p>\n<p>\\\n<em>I’m actually kinda proud of this one.</em></p>\n<h3 id=\"4drinkfromrevenuefountains\"><strong>4. Drink From Revenue Fountains</strong></h3>\n<p>Breaking into the <a href=\"https://www.appdirect.com/resources/glossary/b2b-saas\">B2B SaaS</a> market as a 0 to 1 product is like trying to charge into the Death Star with a podracer and no force abilities.</p>\n<p>\\\nYou have no brand recognition, no credibility, and no one’s lining up to talk to you.</p>\n<p>\\\nThe <a href=\"https://www.linkedin.com/pulse/building-b2b-saas-sales-process-all-you-need-know-huntandhawk-onxsc\">enterprise sales process</a> is its own maze of red tape—RFPs, legal reviews, preferred vendor lists, misaligned leadership, procurement skepticism, and endless back-and-forth. It’s exhausting, slow, and often feels impossible to navigate as a tiny, scrappy startup.</p>\n<p>\\\nThat’s why I created the concept of “<strong>drinking from revenue fountains</strong>.”</p>\n<p>\\\nInstead of hacking through the tangled vines of enterprise sales on your own, this strategy lets you <a href=\"https://www.journeybee.io/resources/guide-to-growing-partnerships\">tap into established sales pipelines</a> by partnering with technology providers that already serve your target customers.</p>\n<h4 id=\"thepowerofperipheralpartnerships\"><strong>The Power of Peripheral Partnerships</strong></h4>\n<p>The key is to identify <strong>technology partners</strong> that provide complementary or peripheral services to yours.</p>\n<p>\\\nThese partners already have relationships with your <a href=\"https://www.newbreedrevenue.com/blog/what-is-an-ideal-customer-profile#:~:text=An%20ideal%20customer%20profile%20is,of%20evangelists%20for%20your%20brand.\">Ideal Customer Profile</a> (ICP) and are <a href=\"https://medium.com/santora-nakama/how-to-acquire-initial-clients-for-your-b2b-startup-122df6976dfa\">trusted vendors on their preferred lists</a>.</p>\n<p>\\\nBy partnering with them, you gain access to their established credibility and sales pipeline, accelerating your path into enterprise accounts.</p>\n<p>\\\nHere’s an example: At my startup, a gamification platform targeting enterprise retailers, we identified loyalty platforms and CRMs as our ideal tech partners.</p>\n<p>\\\nThese platforms store voucher and customer data on the back-end but lack a front-end mechanism to collect that data in engaging ways.</p>\n<p>\\\nEnter my startup.</p>\n<p>\\\nThrough our partnership:</p>\n<ul>\n<li><strong>Loyalty platforms and CRMs</strong> can now pitch us as the solution for retailers to gamify shopper experiences, boosting engagement and data collection.</li>\n<li><strong>Retailers</strong> win by driving more customer interactions with their campaigns and collecting more valuable data for their loyalty programs.</li>\n<li><strong>my startup</strong> wins by fast-tracking our way into enterprise sales cycles.</li>\n</ul>\n<p>\\\nEverybody wins.</p>\n<h4 id=\"howtofindyourrevenuefountains\"><strong>How to Find Your Revenue Fountains</strong></h4>\n<p>This concept isn’t limited to gamification or enterprise retail.</p>\n<p>\\\nAny B2B SaaS product can use this approach to break into its market.</p>\n<p>\\\nHere’s how to apply it:</p>\n<ol>\n<li><p><strong>Define Your ICP</strong>: Identify your ideal customers and the vendors they already trust. Look at their preferred vendor lists and tools they’re using.</p></li>\n<li><p><strong>Identify Peripheral Gaps</strong>: Analyze these vendors and tools to find gaps or enhancements your product can provide. For example:</p></li>\n<li><p>Does a vendor lack a front-end interface?</p></li>\n<li><p>Are they missing an integration to collect or analyze specific data?</p></li>\n<li><p>Can your product complement their services and make them more valuable to their customers?</p></li>\n<li><p><strong>Pitch to the Vendor</strong>: Show how your product enhances their offering. Position yourself as a win-win for the vendor and the customer. Vendors are often more approachable and easier to sell to than directly selling to end customers.</p></li>\n<li><p><strong>Collaborate to Sell</strong>: Once the partnership is established, leverage the vendor’s sales team to pitch your product as part of their solution. This gives you a fast-track introduction into enterprise sales processes without having to start from scratch.</p></li>\n</ol>\n<h4 id=\"thefasttrackto1marr\"><strong>The Fast Track to £1M ARR</strong></h4>\n<p>Drinking from revenue fountains can dramatically accelerate your revenue growth.</p>\n<p>\\\nInstead of burning months on cold outreach, you align yourself with trusted partners who already have a seat at the table.</p>\n<p>\\\nThis strategy helped my startup unlock key enterprise accounts, grow usage for our tech partners, and, ultimately, smash through the £1M ARR milestone.</p>\n<p>\\\nIf you’re a 0 to 1 product manager, don’t try to blaze every trail yourself.</p>\n<p>\\\nFind the fountains already flowing with revenue, align your product to enhance their streams, and watch the growth flow in.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/OU582BtFnvdXLAg1E9gbjnbmEEx1-6g635xj.jpeg\" alt=\"\" /></p>\n<h2 id=\"thechallengesof0to1\"><strong>The Challenges of 0 to 1</strong></h2>\n<p>Let’s not sugarcoat this: 0 to 1 product management is hard.</p>\n<p>\\\nHere are some of the biggest challenges and how I tackled them.</p>\n<h3 id=\"buildingprocessesfromscratch\"><strong>Building Processes from Scratch</strong></h3>\n<p>When you’re starting from zero, prioritization frameworks like <a href=\"https://hackernoon.com/how-to-priority-matrix-stop-using-product-roadmaps-and-use-this-instead\">RICE</a> or MoSCoW won’t help unless you first establish foundational processes.</p>\n<p>\\\nAt my startup, this meant creating a simple centralized Google Sheets dashboard that everyone—from engineers to the CEO—could follow.</p>\n<p>\\\nHere, everyone could reference the roadmap, high level <a href=\"https://hackernoon.com/key-takeaways-of-implementing-okr-an-elium-testimony-w64za31uw\">OKR</a>s and goals, and it was delivered in a simple enough medium for it to be easily adopted.</p>\n<p>\\\n<strong><em>Action Item</em></strong>: Seriously, when in 0-to-1 more, don’t dive into every fancy PM tool. No one will know how to use Miro, your developers will not know how to implement Mixpanel properly—nor will they care, and no one will want to spend an hour trying to figure out why Linear is better than Jira (it is, but we don’t have time for that). Minimize your team’s learning curves—Google Sheets, Jira, and SQL queries are your 0-1 friends. Simple. Easy. Everyone, from your 22-year-old intern to your 55-year-old founder, is familiar with them.*</p>\n<h3 id=\"navigatinglimitedresources\"><strong>Navigating Limited Resources</strong></h3>\n<p>When resources are scarce, every decision is a tradeoff.</p>\n<p>\\\nShould you dedicate precious dev hours to a feature proven to reduce YoY churn by 6% or break your design system’s rules by updating the app’s font to Montserrat to make the founder happy?</p>\n<p>\\\nThe key is ruthless prioritization and transparency with stakeholders.</p>\n<p>\\\nIn a previous article, I wrote about how I break down “effort” into four categories (dev, QA, UX, and business) to ensure every task was evaluated fairly.</p>\n<p>\\\nI even made a Google Sheets template to help you prioritize.</p>\n<p>\\\n<strong>Hint</strong>: <em>Go steal it.</em></p>\n<h2 id=\"thepayoff1marrinoneyear\"><strong>The Payoff: £1M ARR in One Year</strong></h2>\n<p>Looking back, the biggest wins at my startup came from laying down foundations:</p>\n<ol>\n<li>Taking extreme ownership to establish product process and culture.</li>\n<li>Automating workflows to save time and reduce errors.</li>\n<li>Turning the app into a feedback engine to improve user satisfaction.</li>\n<li><strong>Drinking from revenue fountains</strong>.</li>\n</ol>\n<p>\\\nThese efforts didn’t just improve the product—they transformed the team’s ability to <strong><em>execute</em></strong>.</p>\n<p>\\\nBy the end of 2023, we did it—we hit <strong>£1M ARR</strong> in less than 1 year.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/OU582BtFnvdXLAg1E9gbjnbmEEx1-g9835xp.jpeg\" alt=\"\" /></p>\n<h2 id=\"howtothriveasa0to1productmanager\"><strong>How to Thrive as a 0 to 1 Product Manager</strong></h2>\n<p>Here are my final takeaways for anyone stepping into this role:</p>\n<h3 id=\"embracethechaos\"><strong>Embrace the Chaos</strong></h3>\n<p>Every day will feel like a new fire to put out. Learn to love it—or at least accept it.</p>\n<p>\\\nChaos is part of the journey.</p>\n<h3 id=\"leadwithcuriosity\"><strong>Lead with Curiosity</strong></h3>\n<p>You don’t have to have all the answers.</p>\n<p>\\\nAsk questions, experiment, and learn from your team and users.</p>\n<h3 id=\"buildforscalability\"><strong>Build for Scalability</strong></h3>\n<p>Every process you create should scale.</p>\n<p>\\\nEven if you’re a team of 12 today, plan for the team of 50 you might become.</p>\n<h3 id=\"focusonoutcomes\"><strong>Focus on Outcomes</strong></h3>\n<p>In startups, effort means nothing if it doesn’t translate into results.</p>\n<p>\\\nKeep your eyes on the prize: user satisfaction, revenue growth, and team morale.</p>\n<h2 id=\"bottomline\"><strong>Bottom Line</strong></h2>\n<p>Being a <strong>0 to 1 product manager</strong> isn’t about frameworks or checklists—it’s about creating something from nothing and owning every step of the journey.</p>\n<p>\\\nWhether you’re automating bug reports or teaching your team the fundamentals of product management, remember: the impact you have at 0 to 1 will ripple far beyond the product itself.</p>\n<p>\\\nSo, roll up your sleeves, embrace the mess, and make it happen.</p>\n<p>\\\nBecause at the end of the day, being a 0 to 1 product manager is:</p>\n<ul>\n<li>Less about the product and more about systems and processes.</li>\n<li>Less about knowing what to do and more about figuring it out as you go.</li>\n</ul>\n<p>\\\nK Bye!</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Redefining Network Solutions for Edge Computing: Ishan Bhatt's Vision for AI and ML Workloads","url":"https://hackernoon.com/redefining-network-solutions-for-edge-computing-ishan-bhatts-vision-for-ai-and-ml-workloads?source=rss","date":1735232417,"author":"Jon Stojan Media","unread":true,"desc":"","content":"<p>\\\nEdge computing has emerged as a transformative force in today’s technological landscape, particularly in the fields of artificial intelligence (AI) and machine learning (ML). By enabling data processing to occur closer to its source, this approach minimizes dependence on centralized data centers. The result is faster processing speeds, reduced latency, and enhanced security—qualities that are indispensable for AI and ML, where real-time data analysis and response are critical.</p>\n<p>\\\nAt the forefront of this revolution is Ishan Bhatt, whose innovative work with Google Distributed Cloud Connected addresses the complex challenges of implementing edge computing for AI and ML workloads. Ishan’s solutions deliver the low-latency, high-performance networking essential for applications such as autonomous vehicles and advanced healthcare technologies.</p>\n<p>\\\nBy focusing on optimizing network performance and achieving seamless cloud integration, Ishan is redefining standards for efficiency and innovation in this dynamic and rapidly advancing domain.</p>\n<h3 id=\"crackingthelowlatencycode\"><strong>Cracking the low-latency code</strong></h3>\n<p>Developing low-latency, high-performance networking solutions for edge deployments comes with significant challenges, as Ishan explains. One of the primary hurdles lies in the limited computational and energy resources at the edge. To address this, Ishan notes, “It is crucial to optimize software and protocols to minimize resource usage while also leveraging advanced hardware accelerators like GPUs and FPGAs to offload tasks efficiently.” Additionally, he employs dynamic power management techniques to maintain a balance between energy consumption and system performance.</p>\n<p>\\\nAnother critical challenge is achieving the ultra-low latency required for edge applications. Ishan emphasizes the importance of strategies such as edge caching and data prefetching, which reduce the need for remote data retrieval, and advanced routing algorithms to ensure data transmission via the shortest possible paths. To manage unpredictable workloads and maintain scalability across distributed nodes, Ishan highlights the need for adaptive traffic management systems that allocate bandwidth dynamically based on real-time demand and microservice-based deployments for flexible scaling. These carefully integrated approaches reflect his commitment to addressing the unique demands of edge networking with precision and innovation.</p>\n<h3 id=\"networkingforedgeai\"><strong>Networking for edge AI</strong></h3>\n<p>Supporting AI and ML workloads at the edge demands a unique set of networking requirements to handle their high complexity and resource demands. Ishan highlights the necessity for high-bandwidth networking to handle the volume efficiently, especially when processing large datasets such as video streams or real-time telemetry. Unlike traditional networks, which prioritize general-purpose data transfer, edge AI solutions require robust throughput to prevent bottlenecks in the processing pipeline.</p>\n<p>\\\nUltra-low latency is another critical factor, as many AI tasks, including real-time object detection and autonomous decision-making, rely on instantaneous responses. Ishan explains, “Edge AI systems must minimize latency to support these time-sensitive operations,\" whereas traditional networks can tolerate delays typical of batch-processing tasks. Additionally, AI at the edge benefits from distributed architectures that decentralize processing, enabling localized data handling and coordination among geographically dispersed nodes. Ishan contrasts this with traditional systems, which typically centralize processing in data centers, making them less suited for the decentralized nature of edge AI. Tailoring networks to these unique demands is essential to unlocking the full potential of AI and ML at the edge.</p>\n<h3 id=\"acceleratingperformanceinedgecomputing\"><strong>Accelerating performance in edge computing</strong></h3>\n<p>Achieving low-latency performance in edge deployments requires a combination of advanced strategies and innovative technologies, as outlined by Ishan. A key approach involves bringing computation closer to data sources. Ishan explains, \"Deploy compute resources at the network edge to handle time-sensitive tasks locally,\" minimizing the distance data must travel and reducing reliance on centralized servers through localized caching. To further optimize speed, he recommends modernizing communication protocols, such as replacing traditional TCP with alternatives like QUIC or RDMA, which reduce overhead and improve efficiency for specific use cases.</p>\n<p>\\\nDynamic traffic management also plays a crucial role. Ishan utilizes software-defined networking (SDN) to \"dynamically optimize traffic routing and resource allocation,\" ensuring latency-sensitive tasks receive priority. Similarly, network function virtualization (NFV) replaces hardware-based network appliances with virtualized functions, bringing critical processes closer to the edge and reducing delays. Advanced hardware, such as FPGA and ASIC accelerators, combined with intelligent routing algorithms and real-time congestion control mechanisms, ensures data flows along the most efficient paths. These techniques, paired with continuous latency monitoring and hybrid edge-cloud architectures, enable networks to meet the rigorous demands of AI, IoT, and other real-time applications.</p>\n<h3 id=\"scalingedgeintelligence\"><strong>Scaling edge intelligence</strong></h3>\n<p>Scalability in edge networks, especially for AI and ML applications, demands innovative design and strategic resource management. Ishan emphasizes the importance of modular architectures, stating, “They allow seamless addition of edge nodes or components as demand grows.\" This approach relies on microservices for specific network functions, distributed edge infrastructures to reduce bottlenecks, and hierarchical edge tiers to balance workloads effectively across layers.</p>\n<p>\\\nDynamic resource allocation also plays a critical role in scaling efficiently. Ishan points out the value of using containerized environments like Kubernetes, which can dynamically orchestrate workloads across edge nodes and implement auto-scaling to adjust resources in real time. Additionally, AI-specific strategies such as federated learning frameworks enable distributed processing across edge nodes, reducing reliance on centralized training. By integrating advanced technologies like Time-Sensitive Networking (TSN) and leveraging high-performance hardware such as TPUs and FPGAs, Ishan ensures scalability without compromising the performance, adaptability, or reliability of edge networks designed to meet the increasing demands of AI and ML workloads.</p>\n<h3 id=\"automationinaction\"><strong>Automation in action</strong></h3>\n<p>Automation is a cornerstone of efficient edge network deployment, as Ishan’s experience with Google Distributed Cloud Connected demonstrates. By employing the widely used gcloud API, Ishan ensures that edge device configurations are automated to maintain consistency across large-scale deployments. “It reduces manual errors and accelerates setup from days to hours,” Ishan explains, emphasizing the tangible improvements in speed and accuracy. This approach also abstracts complex technical details, making the deployment process more user-friendly and streamlined.</p>\n<p>\\\nIshan envisions automation evolving further as it integrates with advanced technologies and trends. “AI and ML enhance network management by predicting traffic patterns, automating fault detection, and optimizing resource allocation,” he notes, underscoring the role of AI-powered automation in shaping next-generation networks. Tools like digital twins, which simulate and optimize network performance, and AI-driven anomaly detection are set to strengthen security and operational efficiency in increasingly complex environments.</p>\n<p>\\\nEmerging trends such as federated learning and quantum networking will also benefit from automation. Ishan highlights the need to design networks that facilitate federated learning for distributed AI processing while integrating quantum networking for unparalleled security and speed. These advancements, paired with automation, will enable networks to handle the growing demands of AI and edge workloads while maintaining scalability and adaptability.</p>\n<p>\\\nThis forward-looking integration of automation with innovations in hardware and sustainability reflects Ishan’s commitment to driving impactful advancements. Implementing energy-saving algorithms and hardware optimizations for AI workloads is a key focus, aligning operational efficiency with environmental responsibility. Ishan’s vision ensures that edge networks remain agile, secure, and ready for future demands.</p>\n<h3 id=\"realworldimpact\"><strong>Real-world impact</strong></h3>\n<p>The integration of AI and ML at the edge is revolutionizing real-world applications by enabling faster, more secure, and efficient processing of data. Ishan explains that edge AI systems eliminate the need to send data to the cloud, significantly reducing latency. \"AI-driven healthcare devices at hospitals detect irregular heart rhythms and alert doctors within milliseconds, potentially saving lives,\" Ishan highlights, demonstrating the life-saving potential of localized decision-making. Additionally, this approach enhances privacy and security by minimizing the transmission of sensitive data, as seen in facial recognition systems at airports that process images locally while maintaining compliance with privacy regulations.</p>\n<p>\\\nEffective network design underpins these advancements by ensuring low-latency communication and dynamic resource allocation. Ishan points out, \"Networks with automated resource scaling ensure efficient handling of fluctuating AI/ML workloads,\" which is critical during peak demand periods, such as in e-commerce for AI-driven recommendation systems. Moreover, distributed architectures improve resilience, enabling systems like industrial IoT to maintain operations even during disruptions. Ishan underscores the broader impact of these designs, stating that optimized networks reduce energy consumption and operational costs, making edge AI more sustainable. These innovations not only enhance current applications but also set the stage for continuous innovation across industries.</p>\n<p>\\\nAs networking solutions continue to progress, Ishan’s leadership serves as a guiding light. His forward-thinking strategies remain instrumental as we prepare for the continuous integration of AI and ML into various sectors. The convergence of next-generation technologies, such as 5G and AI automation, into edge networks will only heighten the impact of his work. Ishan’s commitment to innovation and excellence ensures he remains a leader, steering these advancements with a vision that anticipates and meets future demands. \"The next generation of network solutions for edge and AI workloads will be shaped by advancements in hardware, software, and architectural paradigms,\" Ishan notes, reflecting his insightful understanding of the technological landscape.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Divide of Failed Economy and Its Citizens","url":"https://hackernoon.com/the-divide-of-failed-economy-and-its-citizens?source=rss","date":1735232414,"author":"Eaelll Leon Faust","unread":true,"desc":"","content":"<p>\\\n<em>A note from Leon Faust on starting MyPursePay</em>: Economies and governments can be categorically a catastrophe, but the individual citizen's wealth economy does not have to be.</p>\n<p>\\\nNow, what is the question? It is a chicken on every homely table. The question is not merely an idea — it is an argument on what is truly attainable in a world economy presented with a paradox in its bother to counter lack with radical supply… one it possesses certainly.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-ik234aq.jpeg\" alt=\"1928 Republican Newspaper Advertisement: This advertisement, associated with Herbert Hoover's campaign, embodies the promise of prosperity.\" /></p>\n<p>\\\n\\\nBut we are realists, and we know as things are: a chicken for every pot is a wrong ask. It is a naïve ask.</p>\n<p>\\\nSo, let us make an agenda (because we bother). Even in our educated agenda, the divide of efforts and reason, and of reason for execution, is substantial:</p>\n<p>\\</p>\n<ol>\n<li><p>The amateurish.</p></li>\n<li><p>Strong capitals of intelligence, resource, and networks, armed agendas with shareholder objectives.</p>\n<p>\\</p></li>\n</ol>\n<p>Firstly, enjoin me to a definition: amateur.</p>\n<p>\\\nThe amateur engages in an activity for pleasure rather than as a profession or for financial gain. That is in no way a proclamation of a virtuous high ground — in fact, it is only circumstances that have nudged me to my position — I would not necessarily have chosen it.</p>\n<p>\\\nHow does the citizen of a failing economy survive? what do they do when they have no control over the bigger picture? I am not an economist, nor a politically literate individual, but I am an engineer who have Identified a rather non problematic fix for the individual experience, and leaving the macroeconomic schematics to those who bother. The citizens of Nigeria are in trouble. The naira (the Nigerian currency) kept losing its value each day to inflation, so much it was disorienting. Just so you understand — if you earned one naira every single day, for four years straight, you still would not make a dollar.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-qe334wy.gif.webp\" alt=\"\" /></p>\n<p>It would be odd for the average citizen in an economy as that to stand non-disoriented — much beyond acquainted with it. The federal minimum wage remains less than 50 dollars a month — that is largely unsubstantial. Poverty increases; the wealth divide grows larger.</p>\n<p>\\\nThere was a lot to pack in, most of it another tragedy — but one thing is understood by anyone who sleeps with the intent to wake:</p>\n<p>\\</p>\n<ul>\n<li><p>You either make more money,</p></li>\n<li><p>Or make the most of any you control.</p>\n<p>\\</p></li>\n</ul>\n<p>The former certainly is most appealing, but not very reachable for most, for obvious reasons. The latter? We can work with that. The question for me was, how do I make the most out of the money I have, while I try navigating the crisis of expenditure, and the hard work of earning more. To do this, I had to get back to my priority list, but this time, with a gun to my head.</p>\n<p>\\\nDid I really have to buy the fifth snack for the day? No.</p>\n<p>Did I really have to cook my noodles with four eggs? No.</p>\n<p>Did I really have to lend my roommate cash whenever he asked for it? No.</p>\n<p>Did I really have to eat my oatmeal with that much milk? No.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-rt434oc.gif.webp\" alt=\"\" /></p>\n<p>As It turns out, when you are under pressure, there is a place where you could see quite clearly. Now, what do I do? It was true I did not need any more motivation to cut back on the spending, but heavens know it is all easier said than done. If I had a way of simply not having access to the money I would very much not like to waste. I am a software engineer, so getting the idea for an app was most natural, as I knew what could be done. Sadly, I could not find any existing apps doing this, so I was not getting a save. But I could do it for others. And I did ask — had a conversation with a couple of friends of mine, and they concurred on a relevance.</p>\n<p>\\\nGet acquainted with MyPursePay, a fintech app that allows users to schedule their money into days, weeks, or months — enabling them to lock it, and only allowing them to spend the amount they set on the event of the schedule they made.</p>\n<p>\\\nTo put that into perspective, if you had 30 dollars to spend for 30 days (a month) on transportation, and it cost a dollar a day for a bus ride, to ensure you never end up running out of money for that, due to unexpected expenses or casual spontaneous purchases, you can schedule a dollar a day on the MyPurse app. Every morning, a dollar is released to you for your bus ride, while the rest of the money remains inaccessible to you until the next day.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-nd634m4.gif.webp\" alt=\"\" /></p>\n<p>\\\nThe Nigerian citizens are widely digitally engaged, so there will be no usability or entry barriers. As for the idea, it will have to prove itself. The bureaucracies, political jargon, and unempathetic details on why the economy has fallen in ruins will elude the layman. They cannot control what they do not know, and have no power over. Words do not mean much in Nigeria, not on any level that concerns the ideals of democracy. What the citizen can do is adapt, and survive.</p>\n<p>\\\nNow, for your considerations, I am the subject of definition : the amateur. I have come to see my enterprise find an entanglement with empathy for the well-being of the common citizen. I am Nigerian anyways, and what is any man without the will to serve his homeland? But this enterprise is young — it is inexperienced and, naturally, challenged. But it will give its best regardless. Because that is what survivors do.</p>\n<p>\\\nCheers,</p>\n<p><strong>Leon</strong></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The High Cost of Training Data in NLP Projects","url":"https://hackernoon.com/the-high-cost-of-training-data-in-nlp-projects?source=rss","date":1735231515,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"64thecostoftrainingdata\">6.4. The cost of training data</h2>\n<p>In the project, we used a mixture of supervised and unsupervised (rules) methods. There are many practical reasons for this choice, but contrary to the scientific literature that is predominantly based on supervised machine learning methods (Suganthan et al., 2015), the main reasons for not opting for a fully supervised approach is the cost. This may be explained from many factors, such as the human labour, the time required, the number (and complexity) of tasks to be addressed, and the tools needed for developing the training data.</p>\n<p>\\\nThe project uses a process that involves multiple tasks of varying complexity. Developing training data for the two zoning tasks is relatively low-cost, as they do not require specialist tools to support the annotation process. In both tasks, annotators were given the extracted text passages either in raw text or CSV (for tables only), together with the original document for reference. The annotation task is also fairly easy, as it only requires skimming through these documents, and does not require extensive reading. In contrast, annotating lot items (lot item detection) and their specific attributes (lot parsing) are much lower granularity tasks, and require examining content at sentence or phrase level. The data also needs to be transformed into formats that can be loaded into state of the art annotation tools that are not always available for our data format. For example, the widely used ‘spacyNER’ annotation format requires parallel sequences of tokens and their labels for each sentence. Such data is very expensive to develop from a business perspective.</p>\n<p>\\\nFurther, as already raised in earlier studies, industrial solutions often favour rules over supervised models as the latter offers easier interpretability and maintainability. These are crucial factors as the needs for their applications can evolve over time and therefore, the solutions must be easy to modify over time. In these cases, changing rules may be a much lighter effort than recreating training data and retraining the system. For these reasons, training data for supervised models can be a barrier to the adoption of methods developed in the research communities, when it comes to developing industrial applications.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Why Classic Algorithms Still Matter in Modern Natural Language Processing","url":"https://hackernoon.com/why-classic-algorithms-still-matter-in-modern-natural-language-processing?source=rss","date":1735230618,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"63thedilemmaofalgorithmicchoices\">6.3. The dilemma of algorithmic choices</h2>\n<p>Our classification method is based on ‘classic’ machine learning algorithms and does not utilise the more recent deep neural networks trained on very large datasets as ‘language models’, such as the well known BERT (Delvin et al., 2018). These models have been shown to set new benchmarks for a wide range of NLP tasks. However, we did not use BERT or similar language model based methods for a number of practical reasons.</p>\n<p>\\\nFirst, such models work in slightly different ways from classic algorithms in the sense that they take over the feature extraction process through a ‘text reading’ process analogous to humans. The idea is that through training such models using enormous data, they are expected to have a certain level of ‘understanding’ of human language, and therefore, can learn to automatically extract useful features from the input texts. This makes feature engineering not very compatible with such models, although one can still run such models as a ‘feature extractor’ to generate a feature representation vector, and combine it with other predefined features.</p>\n<p>\\\nSecond, such models are usually very resource intensive due to its complex architecture and the amount of data used to train them. As a result, they usually can only take a limited length of text. Popular options are a length of 256 or 512 tokens, with the second typically requiring significantly higher computing resources. This means that some of our tasks, such as page or table classification, may not fit well when the content is longer than this length, particularly the smaller option which is more affordable.</p>\n<p>\\\nThird, we experimented with a generic BERT model (English uncased, 256) on the lot item detection task using English training data only, and compared its performance against our best performing model, random forest. However, we did not notice significant gain in F1 by BERT (under 2 percentage points). We assume that a potential reason is that the generic BERT model is trained on general purpose corpus that may not be closely related to healthcare. Studies (Alsentzer et al., 2019; Beltagy et al., 2019) have shown that usually, language models need to be further trained using domain specific corpora when they are to be applied to domain specific contexts. This again requires significant data and computing resources, especially when we have to deal with multiple languages.</p>\n<p>\\\nTherefore, the next lesson we learned is that for industry projects, practicality is an important factor when it comes to choosing the methods. Resource constraints often outweigh algorithmic superiority, especially if the performance gain is small given the potential resource investment needed.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Performance Benefits Of Linux 6.12 LTS Over Linux 6.6 LTS","url":"https://www.phoronix.com/review/linux-66-612-lts","date":1735230600,"author":"Michael Larabel","unread":true,"desc":"","content":"Linux 6.12 was recently promoted to being this year's Long Term Support (LTS) kernel with it being the last major kernel release of 2024. For those enterprise Linux users, hyperscalers, and others typically jumping from one annual LTS kernel to the next, in this holiday article are some benchmarks looking at the performance benefits of Linux 6.12 LTS compared to Linux 6.6 LTS while testing on an AMD Ryzen Threadripper workstation.","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft-OpenAI Deal Defines AGI as $100 Billion Profit Milestone","url":"https://slashdot.org/story/24/12/26/1613249/microsoft-openai-deal-defines-agi-as-100-billion-profit-milestone?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735229520,"author":"msmash","unread":true,"desc":"","content":"OpenAI CEO Sam Altman is negotiating major changes to the company's $14 billion partnership with Microsoft. The companies have defined artificial general intelligence (AGI) as systems generating $100 billion in profits [non-paywalled source] -- the point at which OpenAI could end certain Microsoft agreements, The Information reports. \n\nAccording to their contract, AGI means AI that surpasses humans at \"most economically valuable work.\" The talks focus on Microsoft's equity stake, cloud exclusivity, and 20% revenue share as OpenAI aims to convert from nonprofit to for-profit status. The AI developer projects $4 billion in 2024 revenue.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft-OpenAI+Deal+Defines+AGI+as+%24100+Billion+Profit+Milestone%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F1613249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F1613249%2Fmicrosoft-openai-deal-defines-agi-as-100-billion-profit-milestone%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/26/1613249/microsoft-openai-deal-defines-agi-as-100-billion-profit-milestone?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561805&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The HackerNoon Newsletter: Do Honeypots Still Matter? (12/26/2024)","url":"https://hackernoon.com/12-26-2024-newsletter?source=rss","date":1735229103,"author":"Noonification","unread":true,"desc":"","content":"\n              \n        <p><strong>How are you, hacker?</strong></p>\n        <br />\n        <p>🪐 What’s happening in tech today, December 26, 2024?</p>\n        <br />\n        <p>\n          The\n          <a href=\"https://hackernoon.com/noonification\" target=\"_blank\" rel=\"noopener\"> HackerNoon Newsletter</a>\n          brings the HackerNoon \n          <a href=\"https://hackernoon.com\" target=\"_blank\" rel=\"noopener\">homepage</a>\n          straight to your inbox.\n          <a href=\"https://hackernoon.com/on-this-day\" target=\"_blank\" rel=\"noopener\">On this day,</a>\n          \n            <strong>George Washington Won First US Victory for the Continental Army</strong> in 1776,  <strong>Los Angeles Celebrated the First Kwanzaa</strong> in 1966,  <strong>FDR Officially Established the Modern Thanksgiving Holiday</strong> in 1941, \n          \n          and  we present you with these top quality stories. \n          \n            From \n        <a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\" class=\"eventTitle\"><strong>Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon</strong></a>\n       to \n        <a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\" class=\"eventTitle\"><strong>Ex-CEO Says Bitcoin Mining Could Have Been a Revenue Boom for the Pacific Island</strong></a>,\n       let’s dive right in.\n          \n        </p>\n      \n              \n          <h2><a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\">Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/5wpKgV75aONqkTJlafw2yQmK9yd2-ja0341z.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 2 Min read ] The R Systems BlogBook contest, powered by HackerNoon, is coming soon! Get ready to share your experiences and win exciting prizes—stay tuned for more details. <a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/do-honeypots-still-matter\">Do Honeypots Still Matter?</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/RHANbxrXjsYoxIMTyKJFleCFJyC3-2f0346v.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/salkimmich\">@salkimmich</a> [ 7 Min read ] In cybersecurity, honeypots are systems or environments designed to lure attackers. The roots of the honeypot idea go much deeper than digital security though. <a href=\"https://hackernoon.com/do-honeypots-still-matter\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\">Ex-CEO Says Bitcoin Mining Could Have Been a Revenue Boom for the Pacific Island</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-ka02tj8.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 3 Min read ] Former CEO says his company had the opportunity to invest in bitcoin mining but the proposal never came to the board. <a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/crypto-bull-run-attracts-new-developers-in-2024-report-from-electric-capital-finds\">Crypto Bull Run Attracts New Developers in 2024, Report From Electric Capital Finds </a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-cr035nf.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/danielmcglynn\">@danielmcglynn</a> [ 5 Min read ] Developer activity is one of the most fundamental metrics for evaluating the future of blockchain or digital asset projects. <a href=\"https://hackernoon.com/crypto-bull-run-attracts-new-developers-in-2024-report-from-electric-capital-finds\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/the-ai-chatbot-writing-contest-by-coze-and-hackernoon-results-announcement\">The #AI-chatbot Writing Contest by Coze  HackerNoon: Results Announcement 🎉</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/InxBRjRIs6M1kdhuWcyNHiiUrxm1-lm034i8.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 6 Min read ] Meet the finalists and winners of the #ai-chatbot writing contest presented by Coze and HackerNoon.  <a href=\"https://hackernoon.com/the-ai-chatbot-writing-contest-by-coze-and-hackernoon-results-announcement\">Read More.</a></p>\n        \n              \n        <br />\n        <p>🧑‍💻 What happened in your world this week?</p>\n        <p>\n          It's been said that\n          <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>.\n          Feeling stuck? We got you covered ⬇️⬇️⬇️\n        </p>\n        <br />\n        <p>\n          <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n        </p>\n        <br />\n        <p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>\n        <br />\n        <p><img src=\"https://cdn.hackernoon.com/images/the-hackernoon-newsletter-footer.png\" alt /></p>\n      \n            ","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon","url":"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon?source=rss","date":1735228823,"author":"HackerNoon Writing Contests Announcements","unread":true,"desc":"","content":"<p>Seasons greetings, folks! 🌲🥂🎉</p>\n<p>\\\n’Tis the season to be merry, and in that spirit, we’re thrilled to announce a unique partnership between R Systems and HackerNoon for a first-of-its-kind internal writing contest: <strong><em>R Systems BlogBook — Chapter 1.</em></strong></p>\n<p><img src=\"https://cdn.hackernoon.com/images/5wpKgV75aONqkTJlafw2yQmK9yd2-10634eo.gif.webp\" alt=\"\" /></p>\n<p>This contest is designed exclusively for R Systems staff to share your experiences, projects, and case studies, showcasing the hard work you've put in and how it contributes to R Systems' leadership in the digital transformation industry and its unique approach to software product engineering.</p>\n<h3 id=\"keycontestinfo\"><strong>Key Contest Info</strong></h3>\n<ul>\n<li><strong>Duration:</strong> 3 months,</li>\n<li><strong>Rounds:</strong> 3 (one per month)</li>\n<li><strong>Total Winners:</strong> 12 (4 winners per round)</li>\n<li><strong>Prizes:</strong></li>\n<li><strong>Grand Prize:</strong> Co-branded Laptop Sleeve</li>\n<li><strong>Top Participants:</strong> Co-branded Blogger Badge</li>\n</ul>\n<h3 id=\"conteststructure\"><strong>Contest Structure</strong></h3>\n<ul>\n<li>The contest kicks off in <strong>January 2025 (exact date TBA).</strong></li>\n<li>Each round will focus on two writing prompts, with one month for submissions.</li>\n<li>After each round, the editorial team will review ALL eligible submissions and select the top four stories. These will be featured on R Systems' blog and subsequently showcased on the company’s business page on HackerNoon.</li>\n</ul>\n<p>\\\n<strong>Participants are to use their projects and experience at R Systems to tackle one of two writing prompts each round, as follows:</strong></p>\n<h3 id=\"writingpromptsbyround\">Writing Prompts by Round</h3>\n<p><strong>Round 1</strong></p>\n<ul>\n<li>AI/ML Model Deployment with MLflow and Kubernetes</li>\n<li>Enhancing Developer Productivity with GitHub Copilot and Other AI Tools</li>\n</ul>\n<p>\\\n<strong>Round 2</strong></p>\n<ul>\n<li>Microservices Observability: Leveraging OpenTelemetry</li>\n<li>Implementing Zero Trust Security in Cloud-Native Environments</li>\n</ul>\n<p>\\\n<strong>Round 3</strong></p>\n<ul>\n<li><p>Exploring the Capabilities of WebAssembly for High-Performance Web Applications</p></li>\n<li><p>Integrating Generative AI into SaaS Applications: Best Practices and Use Cases</p>\n<p>\\</p></li>\n</ul>\n<p>Interested participants are encouraged to start brainstorming ideas and stay tuned for the official announcement with full details.</p>\n<p>:::tip\nBe the first to know when we share new updates by subscribing to the HackerNoon Contests Announcement Page [<strong><a href=\"https://hackernoon.com/u/hackernooncontests\">here</a></strong>].</p>\n<p>:::</p>\n<p>We can’t wait to read your work!</p>\n<p>\\\n\\\n\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Do Honeypots Still Matter?","url":"https://hackernoon.com/do-honeypots-still-matter?source=rss","date":1735228821,"author":"Sal Kimmich","unread":true,"desc":"","content":"<p>In 2023, I was reading the rather excellent technical book on <a href=\"https://link.springer.com/book/10.1007/978-3-031-16613-6\">Cyber Deception: Techniques, Strategies, and Human Aspects</a>, which turned suddenly into a nightmare in it’s final chapter: explaining that they had just encountered <em>significant</em> increase in bot-on-bot adversarial deception.</p>\n<p>\\\nThis was not a surprise in any way, but it made me reflect. Honeypots were designed traditionally as a form of protection from intelligent, human adversaries - specifically. I made a point to keep an eye on the change in defensive security as it grows to protect systems from intelligence with a computational cortex. To better understand this important cybersecurity practice, here is the history, foundational thinking, and the state of the art of what Honeypots look like today.</p>\n<p>\\\n<strong>Introduction: The Honey Trap Throughout History</strong></p>\n<p>\\\nThe concept of the honeypot, both as a literal object and a metaphor, has a long history rooted in deception. The term conjures imagery of sweet, irresistible bait, deliberately placed to attract and ensnare an adversarial actor. In cybersecurity, honeypots are systems or environments designed to lure attackers, offering them what appears to be valuable data or access. But the roots of the honeypot idea go much deeper than digital security.</p>\n<p>\\\nThe origins of deception as a defensive strategy are ancient. Military forces used decoys to mislead enemies, such as wooden fortifications or dummy armies meant to draw fire or resources away from real targets. Espionage also has its own version of the honeypot: operatives trained to seduce and compromise adversaries, baiting them into revealing secrets or making strategic errors.</p>\n<p>\\\nWhen computing entered the picture, the honeypot concept naturally transitioned into digital security. In 1989, Gene Spafford introduced active defence strategies that included deception, marking a turning point in how organisations thought about cybersecurity (<a href=\"https://arxiv.org/abs/2409.07194\">Cyber Deception: State of the Art, Trends, and Open Challenges</a>). By the 1990s, tools like Fred Cohen’s <a href=\"http://all.net/dtk/\">Deception Toolkit (DTK)</a> and the Honeynet Project formally brought the idea into practice. These early digital honeypots were static and straightforward, but they laid the groundwork for an entirely new approach to defence: luring attackers in to learn from their behavior, rather than merely keeping them out.</p>\n<p>\\\n<strong>Cyber Deception in the Digital Age</strong></p>\n<p>Today, honeypots are part of a broader strategy known as <a href=\"https://www.researchgate.net/publication/324117795_Cyber_Deception_Overview_and_the_Road_Ahead\">Cyber Deception (CYDEC)</a>. CYDEC uses deliberate misdirection to confuse attackers, increasing the cost of their operations while gathering valuable intelligence. Unlike firewalls or intrusion detection systems, which are designed to block or alert, honeypots serve as active tools for studying adversaries, learning their methods, and even deterring future attacks by introducing uncertainty into their efforts.</p>\n<p>\\\nModern honeypots align with CYDEC taxonomies, which categorise strategies across five layers: strategy (offensive or defensive), dimension (data, system, network), phase (prevention, detection, response), tactics (e.g., decoying), and techniques (e.g., honeypots, obfuscation). Honeypots excel as decoys, creating believable but fabricated environments that attackers cannot resist targeting, it’s really worth reviewing <a href=\"https://arxiv.org/abs/2409.07194\">Cyber Deception: State of the Art, Trends, and Open Challenges</a> to understand this.</p>\n<p>\\\n<strong>The Evolution of Honeypots</strong></p>\n<p>The static honeypots of the past were relatively simple—designed to mimic services like SSH or FTP servers, they recorded basic interactions to analyse what attackers were doing. These honeypots worked well for catching opportunistic hackers, but they struggled against more sophisticated adversaries. Modern honeypots, by contrast, are dynamic and intelligent, leveraging artificial intelligence and machine learning to engage with attackers in realistic, adaptive ways. Here are some of the most significant advancements:</p>\n<p>\\\n<strong>1. HoneyGPT: Bringing AI to the Frontline</strong> HoneyGPT represents a leap forward in honeypot technology. By integrating Large Language Models (LLMs) like ChatGPT, HoneyGPT can engage attackers in detailed, human-like interactions. Using structured prompt engineering, it sustains conversations, creating an illusion of authentic engagement. This approach helps defenders gather critical insights into attacker behavior, tactics, and objectives (<a href=\"https://arxiv.org/abs/2406.01882\">HoneyGPT</a>).</p>\n<p>\\\nThe brilliance of HoneyGPT lies in its ability to mimic real users or system administrators. For instance, an attacker probing a customer service chatbot may unwittingly interact with a honeypot, revealing phishing techniques or other exploits in the process. The intelligence gathered is invaluable for preempting similar attacks elsewhere. However, HoneyGPT is not without limitations—its effectiveness depends heavily on the quality of its prompts and its capacity to handle unstructured or unexpected inputs.</p>\n<p>\\\n<strong>2. LLM Honeypot: Proactive Cyber Defence</strong> The LLM Honeypot takes the concept of AI-driven honeypots further by fine-tuning pre-trained language models on datasets of known attacker behavior. This enables the honeypot to predict and adapt to adversarial tactics in real-time, shifting from reactive to proactive defence (<a href=\"https://arxiv.org/abs/2409.08234\">LLM Honeypot</a>).</p>\n<p>\\\nFor example, imagine a decoy administrative interface that not only responds to attacker queries but intelligently adjusts its behavior to prolong interaction and gather more data. While this approach has tremendous potential, it requires access to vast, high-quality datasets and substantial computational resources, making it less accessible to smaller organisations.</p>\n<p>\\\n<strong>3. HoneyDOC: Modular and Scalable Deception</strong> HoneyDOC introduces modularity to honeypot design, dividing it into Decoy, Captor, and Orchestrator components. This allows for tailored deployment in diverse environments, from enterprise networks to IoT systems (<a href=\"https://arxiv.org/abs/2402.06516\">HoneyDOC</a>).</p>\n<p>\\\nThis modularity is a game-changer, enabling organisations to build honeypots specific to their needs. For example, a healthcare provider could create a decoy electronic health record (EHR) system, while a manufacturing firm might mimic an IoT-enabled factory floor. However, deploying such systems in highly dynamic environments can pose integration and latency challenges.</p>\n<p>\\\n<strong>4. Industrial Honeypots: Protecting Critical Infrastructure</strong> Industrial honeypots focus on operational technology (OT), replicating environments like power grids, water treatment plants, and manufacturing systems. By mimicking complex industrial protocols, they provide a unique defence against adversaries targeting critical infrastructure. A notable example uses Long Short-Term Memory (LSTM) networks to emulate industrial processes in real time, creating convincing decoys for attackers (<a href=\"https://arxiv.org/abs/2410.21574\">Industrial Systems Honeypot</a>).</p>\n<p>\\\nThese honeypots address a critical need, as OT environments are often poorly secured and highly targeted. However, they require precise modeling of industrial systems to be effective, which can be a significant barrier.</p>\n<p>\\\n<strong>5. Blockchain and IoT Honeypots: Securing the Edge</strong> Emerging technologies like blockchain and IoT come with unique vulnerabilities. Honeypots designed for these environments leverage decentralised systems and smart contracts to deploy decoys dynamically across IoT networks. For instance, a fake blockchain node can attract attackers trying to exploit weaknesses in transaction validation (<a href=\"https://ieeexplore.ieee.org/document/10595866\">Blockchain IoT Honeypot</a>).</p>\n<p>\\\nWhile these systems are highly effective in addressing niche vulnerabilities, they can introduce computational overhead and may be less effective against adversaries familiar with blockchain and IoT environments.</p>\n<p>\\\n<strong>The Challenges Ahead</strong></p>\n<p>Despite their advancements, honeypots face significant challenges that are faced by all evolving AI systems:</p>\n<p>\\</p>\n<ul>\n<li><p><strong>Scalability</strong>: Creating and maintaining realistic decoys across large networks remains a technical hurdle.</p></li>\n<li><p><strong>AI Evolution</strong>: While AI-powered honeypots are promising, attackers are also using AI to identify and bypass decoys.</p></li>\n<li><p><strong>Dynamic Threats</strong>: As attackers become more sophisticated, honeypots must continually innovate to remain effective.</p>\n<p>\\</p></li>\n</ul>\n<p>Future research must address these challenges, particularly through automation and the integration of cutting-edge AI models. There are certainly more examples than those above, but I’m calling attention to those I want to call attention to, and leaving out those that are so good I don’t want adversarial actors to have a heads up. This is not a recreational architecture to stand up on your own personal architectures. <em>This article is for <a href=\"https://en.wikipedia.org/wiki/White_hat_(computer_security)\">White Hats</a>, exclusively.</em> There’s very good regulatory reasons for this:</p>\n<h4 id=\"thechallengesofdeployinghoneypots\"><strong>The Challenges of Deploying Honeypots</strong></h4>\n<p>While honeypots provide invaluable insights and defence capabilities, their deployment must be approached with caution to avoid legal, ethical, and operational pitfalls. By addressing these challenges through careful planning and legal consultation, organisations can deploy honeypots effectively while minimising risks:</p>\n<p>\\</p>\n<ul>\n<li><p><strong>Privacy Concerns</strong>: Honeypots often collect attacker data, including potentially identifiable information. In jurisdictions like the European Union, where IP addresses are classified as personal data under the General Data Protection Regulation (GDPR), this can create compliance risks. Organisations must ensure their honeypots are configured to handle data ethically and within legal frameworks. <em>Yes, even your adversarial attacker is probably GDPR protected (</em><a href=\"https://jis-eurasipjournals.springeropen.com/articles/10.1186/s13635-017-0057-4\">Honeypots and Honeynets: Issues of Privacy</a>).</p></li>\n<li><p><strong>Liability Risks</strong>: If a honeypot is compromised and used to launch attacks on other systems, the organisation deploying it could face liability for damages. Robust security measures must be in place to prevent such misuse (<a href=\"https://link.springer.com/chapter/10.1007/978-3-319-19419-6_9\">Deploying Honeypots and Honeynets: Issues of Liability</a>).</p></li>\n<li><p><strong>Entrapment Issues</strong>: While primarily a legal concern for law enforcement, the concept of entrapment—inducing someone to commit a crime they otherwise wouldn’t—is important to consider. Honeypots should passively observe and analyse attacker behavior rather than actively encouraging illegal actions (<a href=\"https://www.sans.org/white-papers/1746/\">CyberLaw 101: A primer on US laws related to honeypot deployments</a>).</p></li>\n<li><p><strong>Jurisdictional Challenges</strong>: Cyber activities often cross international borders, complicating enforcement and compliance. For example, data collected in one country may be subject to the privacy laws of another, creating legal grey areas (<a href=\"https://phys.org/news/2019-05-legal-ramifications-anti-hacker-honeypots.html\">Legal ramifications of anti-hacker honeypots</a>).</p>\n<p>\\</p></li>\n</ul>\n<p><strong>Conclusion: The Enduring Sweetness of Honeypots</strong></p>\n<p>Honeypots have transformed from simple traps into dynamic tools that play a critical role in modern cybersecurity. By integrating artificial intelligence, machine learning, and modular architectures, they remain indispensable in the fight against evolving cyber threats. Whether protecting critical infrastructure, defending IoT systems, or engaging adversaries in deceptive conversations, honeypots prove that the best defence often lies in strategic deception. As cybersecurity threats grow more sophisticated, the relevance of honeypots has only increased. Their ability to adapt, deceive, and gather intel will improve - as will the regulatory constraints of this evolving security practice, with ancient historical roots.</p>\n<p>\\\nAbsolutely yes, honeypots not only matter in the modern digital world — they are now <strong><em>sweeter than ever</em></strong>.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/RHANbxrXjsYoxIMTyKJFleCFJyC3-1d034cd.jpeg\" alt=\"Pyramid Honey: https://xkcd.com/1717/\" /></p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Unpacking The Starknet Bolt Upgrade","url":"https://hackernoon.com/unpacking-the-starknet-bolt-upgrade?source=rss","date":1735228818,"author":"2077 Research","unread":true,"desc":"","content":"<p>\\\nStarknet’s latest upgrade (v0.13.2) named <strong>Bolt</strong> brings two major changes: <strong>parallel execution</strong> and <strong>block-packing</strong>. Although independent of one another, both features support the push towards the goal of fast, cheap blockspace cryptographically secured by Ethereum.</p>\n<p>\\\nParallel execution allows non-contentious transactions (i.e., transactions that don’t touch the same state) to execute concurrently. By implementing parallel execution, L2s like Starknet can reduce execution time without increasing resource usage. This means lower transaction fees for users and significantly improved transaction confirmation times.</p>\n<p>\\\nBlock packing optimizes Starknet’s usage of blobspace on Ethereum L1: with block packing, sequencers can generate one proof to verify multiple Starknet L2 blocks simultaneously. This decouples usage of blobspace from the frequency of L2 block production and amortizes proof verification costs. Both reduce operating costs for the Starknet sequencer, which means users pay less per transaction.</p>\n<p>\\\nLike we said, Bolt makes Starknet cheaper and faster! This report will provide a detailed analysis of the Bolt upgrade–focusing on parallel execution and block packing–and explore the implications for Starknet’s performance.</p>\n<h2 id=\"aquickrefresheronrollups\">A quick refresher on rollups</h2>\n<p>Rollups are <a href=\"https://research.2077.xyz/the-practical-guide-to-ethereum-rollups\">layer two (L2) scaling solutions</a> that aim to scale the underlying layer one (L1) blockchain by moving computation off-chain. By moving execution off-chain, rollups can optimize for scalability (cheap and fast transactions), while the L1 provides security for L2 transactions.</p>\n<p>\\\nRollups are often said to “inherit security from the L1”. What this essentially means is that they inherit the consensus and data availability guarantees provided by the L1. In addition to this, the L1 also provides a security guarantee in the form of secure bridging between it and the rollup.</p>\n<p>\\\nWhen sequencers publish L2 blocks to the L1, the L1 provides guarantees of the availability as well as the ordering of this information. From here, L2 nodes can trustlessly compute the canonical L2 chain with this information along with the rollup’s rules around chain derivation and state transition described by the node implementation.</p>\n<p>\\\nIn order to facilitate secure bridging between the L1 and the L2, the L1 requires proof that the L2 chain it is currently following is correct and does not include illegal state changes (e.g. double spend). This need for rollups to prove the validity of state changes, ensures the L1 does not authorize withdrawals from the rollup based on illegal state.</p>\n<p>\\\nRollups differ based on how they prove validity of state changes to the L1:</p>\n<ul>\n<li>Validity rollups rely on <strong>validity proofs</strong> to objectively verify correctness of execution. Proposers are allowed to propose a new rollup state if they submit a validity proof to the rollup contract.</li>\n<li>Optimistic rollups rely on the absence of a <strong>fraud proof</strong> to subjectively verify correctness of execution. Proposers submit state updates without proofs, but the rollup contract can roll back any state update whose validity is successfully challenged by a fraud proof.</li>\n</ul>\n<p>\\\nRollups also provide the base layer with enough data for interested parties to reconstruct the L2 state. While optimistic rollups must publish full transaction data to enable challengers to compute fraud proofs, validity rollups have no such requirements (validity proofs guarantee correct execution). But posting full transaction data on L1 is still useful from a trust-minimization perspective (trustless reconstruction of state and permissionless withdrawals).</p>\n<p>\\\nStarknet is a validity rollup that uses <strong>S</strong>calable, <strong>T</strong>ransparent <strong>AR</strong>gument of <strong>K</strong>nowledge (STARKs) to prove the validity of state changes. The latest upgrade to Starknet–codenamed Bolt–adds parallel execution and block packing. In subsequent sections, we’ll explain how the two features work and what improvements they bring for Starknet users.</p>\n<h2 id=\"whatdidthestarknetboltupgradechange\">What did the Starknet Bolt upgrade change?</h2>\n<p>At a high level, the Bolt upgrade changed Starknet’s execution, proving and <a href=\"https://research.2077.xyz/data-availability-or-how-rollups-learned-to-stop-worrying-and-love-ethereum\">data availability</a> mechanisms.</p>\n<h3 id=\"optimizingexecution\">Optimizing execution</h3>\n<p>Before the Bolt upgrade, Starknet transactions were executed sequentially—one after the other–by the sequencer. Sequential execution is simple but also very inefficient. It’s inefficient because it does not take advantage of the multiple independent processing units that modern day computers offer and the parallelizability of a set of transactions.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.458Z-xvu6exe7ir9ty5yth0rx9dac\" alt=\"Sequential Execution\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.508Z-fr9t0x0ba0lysizcduhbhyn4\" alt=\"Parallel execution\" /></p>\n<p>Parallelizability is a measure of how independent the transactions in a given set are. For example, consider the set of three transactions below:</p>\n<ul>\n<li><p>Transaction 1: Alice wants to send Bob 1 STRK</p></li>\n<li><p>Transaction 2: Caitlyn wants to send Danny 100 ETH</p></li>\n<li><p>Transaction 3: Caitlyn wants to send Ella 100 ETH</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.510Z-lhg1p6y9mm4o6mod2ookg7rx\" alt=\"\" /></p></li>\n</ul>\n<p>Transaction 1 is completely independent of transactions 2 and 3–because it is accessing a different part of the state (Alice’s balance)–and can be executed concurrently. However, transaction 2 and 3 are conflicting because they want to access the same state—Caitlyn’s ETH balance. These transactions can not be executed concurrently or we’ll end up with conflicting results.</p>\n<p>\\\nTo illustrate:</p>\n<ul>\n<li>Say Caitlyn’s balance is 300 ETH and transactions 2 and 3 start at the same time. Both transactions will read the initial balance of Caitlyn’s account as 300 ETH, deduct the transfer amount from it (300 - 100 = 200), and write 200 ETH to the location in memory where Caitlyn’s account balance is stored.</li>\n<li>Transactions 2 and 3 will then read Danny and Ella’s balances respectively and add 100 ETH to both users’ balances. Caitlyn’s balance would reduce by 100 ETH, but 200 ETH would be credited–effectively printing 100 ETH out of thin air.</li>\n</ul>\n<p>\\\nAvoiding these types of conflicts (and the complex nature of mitigation mechanisms) is why Ethereum chose sequential execution. However, while sequential execution reduces complexity and improves security, it results in inefficient use of hardware. Worse still, the trend of hardware design suggests sequential execution will become increasingly inefficient in the coming years.</p>\n<p>\\\nFigure 4 shows the trend of hardware design in the last 50 years. The relevant takeaway? Single-thread performance (purple circles) has been plateauing since the mid 2000s while the number of logical cores has increased around the same time. We can make two conclusions based on this data:</p>\n<ul>\n<li><p>Hardware designers are scaling computer chips by adding more independent processing units rather than improving the performance of a single unit.</p></li>\n<li><p>Any system that continues to rely on increased performance of a single processing unit will experience a stall in performance gains even on newer hardware.</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.512Z-gqlbm9k7jp7zr7gggghp3inm\" alt=\"Figure 4: Microprocessor trends\" /></p></li>\n</ul>\n<p>\\\nIn recent years, sophisticated algorithms for managing transaction conflicts and ensuring correctness of parallel execution have appeared. Block-STM (based on a paper by Fikunmi et al*) is one such algorithm and forms the core part of Starknet’s new parallel execution engine.&nbsp; We analyze the Block-STM algorithm in later sections.</p>\n<h3 id=\"optimizingprovinganddataavailability\"><strong>Optimizing proving and data availability</strong></h3>\n<p>Starknet’s SHARP (short for Shared Prover) has always taken advantage of recursive proofs to reduce verification costs as much as possible. A recursive proof is essentially a “proof of proof” where one proof verifies that one or more proofs are correct. Below is a sketch of how SHARP generates a recursive proof:</p>\n<ul>\n<li><p>The SHARP system takes a set of programs to be executed (a “job”) as input and generates a proof of execution for the job. These “programs” are L2 blocks and the proof attests to correctness of transactions.</p></li>\n<li><p>The proof is sent to another program that verifies the proof and converts the proof verification program into a job. SHARP takes the new job as input and generates another proof (this proof confirms the validity of the previous proof).</p></li>\n<li><p>The process (proof → job → proof) restarts and continues until a target is reached at which point the final proof (which is now a highly compressed version of the original proof) is posted to the L1</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.671Z-eo0qw1nvie0bora3tavdenvd\" alt=\"Figure 5: Recursive proof generation\" /></p></li>\n</ul>\n<p>\\\nThis design greatly amortizes costs for two major reasons:</p>\n<ul>\n<li>The subsequent jobs* are not individual programs or transactions and proving costs grow sub-linearly. This means the larger the number of programs/transactions within a job, the greater the savings. By creating proofs per block instead of per transaction, transaction fees can be much cheaper.</li>\n<li>Recursion greatly compresses the proofs resulting in a “proof of proof” that is significantly cheaper to verify on the L1 than the initial proof or any of the intermediate proofs.</li>\n</ul>\n<p>\\\nWhile the proving system was good, there were missed chances to further save costs. For example, each job was a single Starknet block and each of these blocks were designed to take up one blob on the L1. This resulted in certain inefficiencies as described below:</p>\n<ul>\n<li>Prior to Bolt, Starknet did (and still does) not have regular blocktimes; instead an L2 block was published to the L1 under two conditions: (1) One blob’s worth of data was executed (2) Six minutes had elapsed from the previous block. Unfortunately, due to demand, most of the blocks were sent to the L1 because of the six minute limit (not DA limits).</li>\n<li>The above meant that blobs (not blocks) were often (severely) underutilized, resulting in unnecessarily high gas costs. Starknet blocks also had a <a href=\"https://community.starknet.io/t/upcoming-feature-starknet-applicative-recursion/113868#:~:text=Present%20and%20future-,Present,-We%20start%20off\">fixed cost</a>, which could theoretically be reduced by applying the same recursion techniques discussed above to produce proofs of multiple blocks.</li>\n</ul>\n<p>\\\nBlock packing tackles these problems by using a binary tree of recursive proofs. We discuss block packing in a later section of the article.</p>\n<h2 id=\"boltpart1parallelexecution\">Bolt Part 1: Parallel Execution</h2>\n<p>As discussed earlier, sequential execution is inefficient (and will only be more inefficient as time goes on) and naive parallel execution produces invalid results. Production parallel execution engines take care to prevent inconsistent results, however.</p>\n<p>\\\nThere are two approaches to tackling parallel execution: <strong>Pessimistic Concurrency Control (PCC)</strong> and <strong>Optimistic Concurrency Control (OCC)</strong>. PCC and OCC are transaction processing units (TPUs). Below is a definition of a transaction processing unit from <strong><a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">Block-STM vs. SVM: A Comparison of Parallel Execution Engines:</a></strong></p>\n<p>\\</p>\n<blockquote>\n  <p>The TPU is usually coupled with, but distinct from the Virtual Machine (VM). Blockchain VMs like the EVM, SVM, and MoveVM are high-level language VMs…The TPU, which is usually the subject of interest, subsumes the VM. It is tasked with the management of the entire transaction execution pipeline, including creating and managing instances of the VM.</p>\n</blockquote>\n<p>\\\nPessimistic concurrency control is designed based on the assumption that many of the transactions within the set of transactions to be executed will conflict, i.e., they will touch the same state. PCC&nbsp; <strong>prevents</strong> these conflicts.</p>\n<p>\\\nTo prevent conflicts, PCC requires that a transaction declare upfront what portions of state it will access during read/write operations. The transaction processing unit can use this information to schedule transactions in a way that ensures that conflicting transactions are executed sequentially (instead of concurrently). Some TPUs also use locks to enforce this behavior (a lock (a.k.a., mutex) is a mechanism used to prevent concurrent access to a memory location).</p>\n<p>\\\nThat said, PCC-based execution incurs certain tradeoffs. First, the requirement to provide access lists (which identify the memory slot a transaction touches) degrades the developer experience and reduces the range of possible applications. Second, scheduling transactions can incur unnecessary overhead–especially when there are no conflicts.</p>\n<p>\\\nOptimistic concurrency control is designed with the assumption that many of the transactions within the given set will not conflict, i.e. they will not write to the same state. As such, OCC TPUs execute the set of transactions with all the available resources and only try to <strong>detect</strong> conflicts. If a conflict is <strong>detected</strong> the transactions that conflict are executed and reverified until the entire set passes and can be committed.</p>\n<p>\\\nOCC TPUs don’t incur overhead from scheduling, so they tend to perform better when there are few conflicts. OCC-based transaction processing units also have better developer experience and a wider range of use cases because state dependencies don’t need to be known upfront.</p>\n<p>\\\nHowever, when the set of transactions are highly contentious, OCC performs worse than PCC. We cover TPU designs (in far more detail) and compare the OCC and PCC approaches in <a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">our article</a> on parallel execution.</p>\n<p>\\\nStarknet’s new TPU uses the OCC approach. More specifically, it is an implementation of the Block-STM algorithm. Block-STM executes transactions optimistically with all the available resources assuming none of them will conflict and verifies after execution that no conflicting transactions executed concurrently. Before we dive into Starknet’s new architecture, it’s important to go over some key definitions:</p>\n<ol>\n<li><strong>State</strong>: State is the condition of an object at an instance in time. In the blockchain context it usually refers to the value of a portion of memory, e.g., the balance of an address is (part of) its state.</li>\n<li><strong>Serializability</strong>: Parallel execution is said to have preserved the property of serializability if executing a set of transactions serially and concurrently produces the same results.</li>\n<li><strong>Conflict</strong>: Two transactions are said to conflict if and only if at least one of them wants to write to a portion of state that both want to access (can be read or write). If both transactions are only reading from a portion of state, then there’s no conflict but if at least one of them is writing to that portion of state, then the transactions can not be executed concurrently without breaking serializability. We covered a sample case above in the Caitlyn, Danny and Ella example.</li>\n<li><strong>Dependency</strong>: A transaction <code>txj</code> is said to be dependent on (or a dependency of) a transaction <code>txi</code> if and only if both transactions write to the same memory location and <code>txj</code> comes after <code>txi</code> in the serial ordering. If <code>txi</code> came after <code>txj</code>, <code>txi</code> would be dependent on <code>txj</code>.</li>\n<li><strong>Multi-version data structure</strong>: A multi-version data structure is one where a new version of the data structure is created for each write to the data structure. Instead of changing the value in place, a new write-specific version of the location to be changed is created. The value prop of multi-version data structures is that they allow highly concurrent reads from and writes to the same region in memory. We’ll explore how this is useful later.</li>\n</ol>\n<p>With the definitions out of the way we can move on to cover how Block-STM works.</p>\n<h2 id=\"howblockstmworks\">How Block-STM works</h2>\n<p>The input to Block-STM is a queue (an ordered list) of transactions, this list is often called a BLOCK. This list can be ordered in any manner; the only requirement is that there is a clearly defined order. So given a set of transactions T containing transactions <code>{t0…tn}</code>, the transactions are sorted such that <code>{t0 &gt; t1 &gt; t2 … &gt; tn}</code> (read as <code>t0</code> is of higher priority than <code>t1</code>,&nbsp; <code>t1</code> is of higher priority than <code>t2</code> etc.)</p>\n<p>\\\nAt the beginning of the execution process, two sets are created—an execution set E, and a validation set V. E tracks transactions that are yet to be executed while V tracks transactions that have been executed but are yet to be validated. Each transaction is also associated with an incarnation number n to track how many times it has been executed (and re-executed). The initial state of the sets is that E contains all the transactions and V is empty, i.e., <code>E = {t0,1 &gt; t1,1 &gt; t2,1 &gt; … &gt; tn,1}</code> and <code>V = {}</code>.</p>\n<p>\\\nWith these ordered sets of transactions, each thread used for execution cycles through a three stage loop:</p>\n<ol>\n<li>Check Done</li>\n<li>Find Next Task</li>\n<li>Perform Task</li>\n</ol>\n<h3 id=\"checkdone\">Check Done</h3>\n<p>During this step, the thread checks both V and E. If both are empty and no transaction is being executed then the current batch of transactions has been executed completely and the results can be committed to storage.</p>\n<h3 id=\"findnexttask\">Find Next task</h3>\n<p>If either V or E contains transactions, Block-STM selects the transaction with the lowest index (not incarnation number) from both set of transactions, i.e., if E contains <code>{t1,3 , t3,1 and t5,2}</code> and V contains <code>{t0,1, t2,4, t4,3}</code>, the validation task for transaction <code>t0</code> would be selected as the next task.</p>\n<h3 id=\"performtask\">Perform Task</h3>\n<p>Once the next task has been identified and selected, it is performed. At the end of this step, the algorithm loops back to Check Done. This process continues until both sets of transactions are empty.</p>\n<p>\\\nLet’s look at what happens during execution and validation:</p>\n<p>\\\nDuring execution of a transaction, the Block-STM algorithm populates two sets (per transaction); a read set (<code>Ri,n</code>) and a write set (<code>Wn,i</code>). The read set contains all the memory locations that a transaction read from during its execution while the write set contains all the memory locations it wrote to. During execution, the transactions apply their writes to the multi-version data structure, but reading is a little nuanced.</p>\n<p>\\\nIn Block-STM when a transaction wants to read from the data structure, it checks for the value written by the lowest priority transaction that has higher priority. For example if <code>tx1</code>, <code>tx2</code>, and <code>tx7</code> have all written to a memory location and <code>tx5</code> wants to read from this location, it reads the version of the data structure corresponding to <code>tx2</code>.</p>\n<p>\\\nThis is done to enforce serializability; since <code>tx5</code> should be executed after <code>tx2</code> and before <code>tx7</code>, it should use the values written by <code>tx2</code> not <code>tx7</code>. In this example, <code>tx7</code> will have to be re-executed because it should have read the values written by <code>tx5</code>, not <code>tx2</code> or any higher priority transactions. If a single-version data structure was used, the value written by <code>tx2</code> would be unavailable and a conflict is sure to occur.</p>\n<p>\\\nFor a validation task, the transaction’s read set is compared to the current values at the memory locations it read from during execution. For example, if <code>tx2</code> reads account B during execution, during validation, the memory location for account B is read (keeping the definition of read we established earlier in mind). If the two values are the same then it means that no higher priority transaction (say <code>tx0</code> or <code>tx1</code>) has written to that location during the execution of <code>tx2</code>. This results in <code>tx2</code> marked as validated but not safe to commit.</p>\n<p>\\\nThe transaction is not considered safe to commit because a lower priority transaction could, for any number of reasons, be executed after the transaction had been validated. In our running example if <code>tx1</code> touches account B and only touches it after, <code>tx2</code> passes validation then <code>tx2</code> needs to be re-executed.</p>\n<p>\\\nTo provision for this, anytime a transaction completes execution all lower priority transactions&nbsp; that had passed validation are revalidated to ensure they do not conflict with the transaction. For example, if <code>tx1</code>, <code>tx3</code> and <code>tx4</code> have been validated and <code>tx2</code> completes execution, <code>tx3</code> and <code>tx4</code> must be revalidated to ensure that they do not conflict with (and so are dependencies of) <code>tx2</code>.</p>\n<p>\\\nIf a transaction fails validation, i.e., a higher priority transaction that writes to the same state was executed concurrently with it, then the writes that the transaction made are dirty (because the values are wrong.) But instead of deleting these values from the database completely, they are flagged ESTIMATE.</p>\n<p>\\\nThe ESTIMATE flag tells any transaction reading that memory location that the values there are not correct and the transactions pause their execution. This is done in place of deletion because re-execution of the transaction that failed validation would likely result in writing to the same memory locations as the previous execution.</p>\n<p>\\\nBy marking the memory location as an estimate instead of deleting it, dependencies (of the transaction that failed validation) can be caught even before re-execution, preventing unnecessary re-executions. This heuristic greatly reduces wasted work.</p>\n<h3 id=\"puttingitalltogether\">Putting it all together</h3>\n<p>A complete overview of how Block-STM approaches parallelization can be summarized as:</p>\n<ul>\n<li>A <code>BLOCK</code> of transactions start out as an ordered list with a clearly defined serial order. These transactions are executed on all the available resources in priority order.</li>\n<li>During execution, the read and write sets of the transactions are tracked and reads and writes are performed from/to a multi-version data structure. When a transaction finishes execution, it is validated to ensure that it did not execute concurrently with any conflicting transactions.</li>\n<li>If a transaction passes validation, then it is removed from E and V. And when a transaction is validated, all transactions lower in priority than it that had passed validation are rescheduled for validation.</li>\n<li>If a transaction fails validation then it is rescheduled for execution. When the entire set of transactions have been executed and validated then the entire BLOCK is safe to commit and the results can be written to permanent storage.</li>\n</ul>\n<p>\\\nAn example is shown below:</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.479Z-jfw70yz60xrnm42dn9on5178\" alt=\"Figure 6: Block-STM example\" /></p>\n<p>\\\nThat is an overview of how Block-STM works, more details can be found in our report <a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">here</a> and the original Block-STM paper <a href=\"https://arxiv.org/abs/2203.06871\">here</a>.</p>\n<h3 id=\"howdoesblockstmimprovestarknetperformance\">How does Block-STM improve Starknet performance?</h3>\n<p>To quantify the significance of adding Block-STM, we performed a few benchmarks to evaluate the performance improvements it provides over sequential execution and the results are shown below.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.457Z-frrc7x2wlax56vqbfpwz9v0n\" alt=\"Figure 7: Block-STM performance at 1k blocksize\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.400Z-t5gfjgvk2kz033f8xymxeisa\" alt=\"Figure 8: Block-STM performance at 10k blocksize\" /></p>\n<p>\\\nThe results show that as the number of threads (analogous to independent processing units) used increases, performance also increases. The improvements are more pronounced with larger blocks giving as high as 9X performance improvements over sequential execution with just 16 threads. We found that the results are more pronounced with larger blocks.</p>\n<p>\\\nOur tests show that Block-STM performance does significantly degrade under highly contentious load but industry-standard practice is to fall back to sequential execution during such periods. We recommend the same mechanic to Starknet to preserve throughput under highly contentious workloads. But, by and large, the addition of Block-STM will significantly improve and futureproof Starknet.</p>\n<p>\\\nThe second major change bundled in the v0.13.2 upgrade is block packing and we’ll cover that next.</p>\n<h2 id=\"boltpart2blockpacking\">Bolt Part 2: Block Packing</h2>\n<p>As discussed earlier, prior to Bolt, each Starknet block was its own job resulting in a fixed per-block cost for every block. In addition, the system was designed such that each block required its own blob regardless of how much data was actually consumed by the block.</p>\n<p>\\\nIn a world where there was always high demand, this wouldn’t be a problem, but Starknet currently offers more blockspace than there is demand for and so there are a lot of wasted resources that could result in <a href=\"https://community.starknet.io/t/starknet-costs-and-fees/113853\">hundreds of ETH lost</a> over the course of a month. To further put into context the severity of the situation before Bolt, these are the costs associated with posting a block to L1:</p>\n<p>\\</p>\n<ol>\n<li>23K gas per fact registration – part of <a href=\"https://etherscan.io/tx/0x16731babd1ba57874ff4b6554aab379785d986b2aa6b4513d68fd19673bb441a\">Verify Proof and Register</a></li>\n<li>56K gas per <a href=\"https://etherscan.io/tx/0xd808cb7fa32e1a3a241f91e07587339d526d4c47eae8902075f02cabde4f7efc\">register SHARP memory page</a></li>\n<li>136K gas per <a href=\"https://etherscan.io/tx/0x08ce859bc5d0eb7a5c159d50428841e88878691e378704aa636a968b2a7a3ee8\">State Update</a></li>\n<li>50K gas for the KZG precompile to sample a blob,</li>\n<li>86K gas for running the state update function.</li>\n</ol>\n<p>\\\nThis totals out to 215k gas per block and this cost is flat, i.e., it’s the same regardless of how much data each block contains and related to the number of blocks by $Cost = num blocks * 215000$. The ideal solution to this problem would be for costs to be related to the amount of data posted instead of the amount of blocks. And that’s exactly what block packing achieves via SNAR trees.</p>\n<h3 id=\"snartries\">SNAR Tries</h3>\n<p>Starknet Applicative Recursive (SNAR) trees are a new type of binary tree introduced in Bolt to address the problems highlighted above. A SNAR Tree has the following structure: each leaf is a Starknet block and the nodes in all other levels are recursive proofs of their children. The root node which is a recursive proof of all other proofs is the final job that is sent to the SHARed Prover (SHARP).</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.256Z-kf8xoqfmknwm9x9yk28y39lq\" alt=\"Figure 9: SNAR Tree\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.244Z-wu0n0wm0kp61epo00broz5zg\" alt=\"Figure 10: SNAR Tree in Block packing workflow\" /></p>\n<h3 id=\"whatdoesthesnartreedo\">What does the SNAR Tree do?</h3>\n<p>The primary benefit of the SNAR Tree is that rather than posting one block per proof, many Starknet blocks can be amortized into the same L1 update. SNAR tree roots are now posted to the L1 only when one of two configurable limits is hit: either the DA limit (6 blobs worth of data) or after a certain number of leaves are added to the tree (where a leaf is a block).</p>\n<p>\\\nThis design decouples the cost for transactions from the number of blocks. Now, there is still some fixed cost for each block that arises from running the StarkNet OS (SNOS) in every block–but by and large the costs are decoupled. These are the numbers now:</p>\n<p>\\</p>\n<ol>\n<li>SHARP memory registration per-job: 23K gas, (same as before)</li>\n<li>SHARP memory page per-job: 36K gas (reduced from 56K thanks to SHARP optimization),</li>\n<li>State update per-job equal to:</li>\n<li>86K gas (same as before) +</li>\n<li>50K gas × number of blob used. (When one blob was used per block this was 50K x 1 resulting in the 136K gas number quoted above).</li>\n</ol>\n<p>\\\nThe plot in Figure 11 below shows how gas costs vary with block number in the previous design and now (under Bolt):</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.071Z-rj1wxee4ltguxaz5thwmsl71\" alt=\"Figure 11: Verification Costs with an without block-packing\" /></p>\n<p>\\\nIt’s fairly obvious that block packing greatly reduces the costs of verification on the L1 which will undoubtedly result in lower gas prices for Starknet users.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The effect of the changes made in Bolt: optimistic parallel execution via Block-STM and block-packing through the proprietary SNAR can be summarized as: faster and cheaper.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.870Z-c5eu1mngosjxt9cn24n3mz8u\" alt=\"\" /></p>\n<p>Parallel execution reduces execution time and by extension congestion which will reduce gas fees during periods of high traffic, while SNAR trees tackle the associated DA and proving costs. Interestingly, this upgrade makes Starknet the first L2 with parallel execution and sets it up to be a major contender in the L2 space. It’s important to note that it’s unlikely that the effect of these changes will be immediately evident, especially that of parallel execution, but they are crucial to future-proofing Starknet and the entire Ethereum ecosystem as a whole.</p>\n<p>\\\n<strong><em>Author’s note: A version of this article was previously published <a href=\"https://research.2077.xyz/unpacking-the-starknet-bolt-upgrade\">here</a>.</em></strong></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Overcoming Multilingual and Multi-Task Challenges in NLP","url":"https://hackernoon.com/overcoming-multilingual-and-multi-task-challenges-in-nlp?source=rss","date":1735228812,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"62dataheterogeneitymultilingualandmultitasknature\">6.2. Data heterogeneity, multilingual and multi-task nature</h2>\n<p>As already mentioned many times, compared to research as well as other industry text mining and NLP practices reported in the literature, the data we dealt with are multilingual and heterogeneous such that the goal of the project cannot be achieved by a single type of method, but relates to multiple subfields of text mining and NLP research. While there may be well-established solutions in each of these subfields, as discussed before, the difference in the raw data analysed, the multilingual nature and the lack of training data in our project makes adopting these methods very difficult and time-consuming. Considering the wider principle mentioned above, another lesson we learned is that given such a high level of complexity in our tasks, it is imperative to develop ‘lightweight’ methods that are easy to maintain, or ‘generalised’solutions that could apply to multiple tasks, or both.</p>\n<p>\\\nOn reflection, we opted for treating many tasks as text classification, using a feature representation scheme that is arguably language independent, and applies to, or can be easily adapted to, all of the tasks. Specifically, two components of our pipeline (lot zoning and lot item detection) deal with text classification at different granularity and therefore, the machine learning algorithms can be easily reused across. The feature representations are derived with reference to domain lexicons, which can be more easily and affordably translated into multiple languages - particularly considering the massive amount of multilingual documents we have to analyse, and the fact that only a fraction of them contain really useful content for analysis. Another added benefit of our approach is that it enables domain experts and the system administrators to update the trained models by simply revising the domain lexicons during re-training. To the best of our knowledge, there is no prior literature that describes in detail a holistic text mining or NLP process composed of multiple sub-tasks, or develops generalisable solutions like ours. Therefore, our work sets an important reference for future industry projects dealing with complex tasks.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ex-CEO Ranks the One Skill That Helped Him Navigate His Life","url":"https://hackernoon.com/ex-ceo-ranks-the-one-skill-that-helped-him-navigate-his-life?source=rss","date":1735228536,"author":"Edwin Liava'a","unread":true,"desc":"","content":"<p>As I sit here anticipating Christmas Eve, wrapping up two project proposals that consumed my entire weekend responding to comments from an evaluator, I've reached an unexpected moment of clarity in my career. Throughout my journey from hands-on engineering roles to executive positions as CEO of Tonga Cable Ltd, CTO at PowerPlay, Corporate and Regional Director at Kacific Broadband Satellites. I've always found my comfort zone in the engine room, deep in the technical trenches where logic and precision reign supreme.</p>\n<p>\\\nMy engineering DNA, forged through decades of work across diverse domains from geospatial systems to blockchain technology, from submarine fiber optic cables to satellite communications has always favored efficiency: bullet points, clear metrics, and concise technical summaries. It's a language that resonates perfectly with fellow engineers in my domain, whether we're discussing disaster risk reduction policies for utilities in Micronesia or developing smart contracts on Ethereum, EVM Chains, Hedera and Rootstock.</p>\n<p>\\\nHowever, my recent experience in consultancy has brought an interesting challenge to light. As someone who has led digital transformation initiatives across the Pacific, from expanding broadband coverage to championing Web3 technologies, I've found myself increasingly adapting my communication style to meet the expectations of evaluators who prefer their technical content served with a generous helping of narrative prose, what I playfully call \"sugar coating.\"</p>\n<p>\\\nThis weekend's proposal marathon has been particularly enlightening. As I transformed technical specifications into flowing narratives, I realized something crucial: perhaps it's time for me to evolve once again. Not away from engineering, but rather up the stack, where I can serve as a bridge between the engine room and the boardroom. After all, isn't this what I've been unconsciously doing throughout my career, whether it was making satellite communications accessible across the Pacific, developing GIS solutions for 14 Pacific Island nations, or leading blockchain awareness initiatives.</p>\n<p>\\\nThe younger generation of engineers shouldn't have to spend countless hours converting their precise, technical thinking into elaborate prose just to get their brilliant ideas across. They should be free to focus on what they do best, innovating and solving complex technical challenges. Whether they're working on smart contract security, developing geospatial databases, or expanding digital connectivity, their time is better spent pushing technological boundaries than wrestling with report aesthetics.</p>\n<p>\\\nThis realization aligns perfectly with my ongoing work in digital skills development and capacity building across the Pacific. As someone who has consistently worked to bridge digital divides and remove barriers to technology adoption, perhaps this is my next calling, to be the translator, the facilitator who can help streamline this process. Having been both in the engine room and the boardroom, understanding both languages fluently, I can create more value by helping these talented engineers navigate the sometimes Byzantine world of corporate communication.</p>\n<p>\\\nAs I serenade Christmas tunes after submitting these proposals, I'm energized by this new perspective. My journey from a humble beginnings of a computer operator at the Tonga Electric Power Board to leading major digital infrastructure projects has taught me that sometimes the most valuable revelations come not from the work itself, but from reflecting on how we do that work and why. It's time to leverage this experience to create pathways for the next generation of Pacific engineers, ensuring their brilliant technical solutions don't get lost in translation.</p>\n<p>\\\nWishing you all a Merry Christmas and a Prosperous New Year! The journey continues…</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"US Data Center Boom Creates Windfall For Electricians","url":"https://news.slashdot.org/story/24/12/26/1513222/us-data-center-boom-creates-windfall-for-electricians?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735225980,"author":"msmash","unread":true,"desc":"","content":"Data center construction is driving an unprecedented influx of electricians to central Washington state, where abundant hydropower and tax incentives have attracted major tech companies building AI infrastructure, New York Times is reporting. \n\nMicrosoft alone projects needing 2,300 electricians in coming years for facilities across three counties along the Columbia River. Union electricians earning up to $2,800 weekly after taxes are transforming agricultural communities like Quincy, where data centers now account for 75% of local tax revenue. \n\nWhile the construction boom has funded community improvements including a new high school, rising housing costs and limited long-term employment opportunities raise concerns about sustainable economic benefits for longtime residents.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Data+Center+Boom+Creates+Windfall+For+Electricians%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F1513222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F1513222%2Fus-data-center-boom-creates-windfall-for-electricians%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/1513222/us-data-center-boom-creates-windfall-for-electricians?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561767&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Startups Begin Geoengineering the Sea","url":"https://spectrum.ieee.org/ocean-carbon-removal","date":1735225203,"author":"Emily Waltz","unread":true,"desc":"","content":"<p>These companies are trying to make the oceans a better carbon sink</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4MjcxMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4ODU5NzEzMX0.CNnLVw9aKAkD-FClxWi6UyAmrKIPYjSx0uS7LTxLyLs/image.jpg?width=600","enclosureMime":""},{"title":"Microsoft Is Forcing Its AI Assistant on People - And Making Them Pay","url":"https://slashdot.org/story/24/12/26/140236/microsoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735221660,"author":"msmash","unread":true,"desc":"","content":"Microsoft has integrated its AI assistant Copilot into Microsoft 365 subscriptions in Australia and Southeast Asia, simultaneously raising prices for all users. The move forces customers to pay for AI features regardless of interest, prompting complaints about intrusive pop-ups and price hikes, WSJ reports. From the report: Some users said on social media that Copilot pop-ups reminded them of Clippy, Microsoft's widely derided Office helper from the late 1990s, that would frequently offer unsolicited help. \n\n[...] The change demonstrates the lengths to which Microsoft is going to try to profit from its huge investments in AI. Copilot, which is built with technology from OpenAI, is a key part of Chief Executive Satya Nadella's plan to keep expanding Microsoft's software business for consumer and corporate customers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Is+Forcing+Its+AI+Assistant+on+People+-+And+Making+Them+Pay%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F140236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F140236%2Fmicrosoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/26/140236/microsoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561719&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"These were the badly handled data breaches of 2024","url":"https://techcrunch.com/2024/12/26/badly-handled-data-breaches-2024/","date":1735221638,"author":"Zack Whittaker, Carly Page","unread":true,"desc":"","content":"<p>Blaming victims, months of silence, and suing security researchers all featured in cybersecurity in 2024.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Top 8 Computing Stories of 2024","url":"https://spectrum.ieee.org/top-computing-stories-2024","date":1735221602,"author":"Dina Genkina","unread":true,"desc":"","content":"<p>AI coding, software bloat, the open-source crisis—and a science fiction original story</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4NDQwNS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc1ODYzOTc4NH0.T_T4zyB2uWZsCcO0QDJc-B3JP9K62Z1Bz2ZWufCnG8A/image.jpg?width=600","enclosureMime":""},{"title":"Intel Linux Performance Optimizations & Intel's Other Open-Source Wins From 2024","url":"https://www.phoronix.com/news/Intel-Linux-Open-Source-2024","date":1735221300,"author":"Michael Larabel","unread":true,"desc":"","content":"In addition to the exciting hardware launches this year particularly around Xeon 6 Granite Rapids, Lunar Lake processors, and the new low-cost Battlemage graphics cards, what remains particularly exciting and consistent are all of Intel's great investments around open-source and Linux. Over 2024 there were many exciting performance optimizations, new Linux kernel features, GCC and LLVM/Clang compiler toolchain improvements, and countless other enhancements made throughout the open-source ecosystem by Intel engineers...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"James Bond Battles a New Foe: Amazon","url":"https://entertainment.slashdot.org/story/24/12/26/0922211/james-bond-battles-a-new-foe-amazon?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735218060,"author":"msmash","unread":true,"desc":"","content":"An anonymous reader writes: James Bond has dodged more than 4,000 bullets. He has jumped from an airplane, skied off a cliff and escaped castration by laser beam. \n\nNow, 007 is in a new kind of peril. Nearly three years after Amazon acquired the right to release Bond movies through its $6.5 billion purchase of the Metro-Goldwyn-Mayer Studio, the relationship between the family that oversees the franchise and the ecommerce giant has all but collapsed, WSJ reports.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=James+Bond+Battles+a+New+Foe%3A+Amazon%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F26%2F0922211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F26%2F0922211%2Fjames-bond-battles-a-new-foe-amazon%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/26/0922211/james-bond-battles-a-new-foe-amazon?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561565&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"2024: The year AI drove everyone crazy","url":"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/","date":1735214425,"author":"Benj Edwards","unread":true,"desc":"","content":"\n              <p>It's been a wild year in tech thanks to the intersection between humans and artificial intelligence. 2024 brought a parade of AI oddities, mishaps, and wacky moments that inspired odd behavior from both machines and man. From AI-generated rat genitals to search engines telling people to eat rocks, this year proved that AI has been having a weird impact on the world.</p>\n<p>Why the weirdness? If we had to guess, it may be due to the novelty of it all. Generative AI and applications built upon <a href=\"https://arstechnica.com/ai/2024/11/chatgpts-success-could-have-come-sooner-says-former-google-ai-researcher/\">Transformer-based</a> AI models are still so new that people are throwing everything at the wall to see what sticks. People have been struggling to grasp both the implications and potential applications of the new technology. Riding along with the hype, different types of AI that may end up being ill-advised, such as automated military targeting systems, have also been introduced.</p>\n<p>It's worth mentioning that aside from crazy news, we saw fewer weird AI advances in 2024 as well. For example, Claude 3.5 Sonnet <a href=\"https://arstechnica.com/information-technology/2024/06/anthropics-latest-best-ai-model-is-twice-as-fast-and-still-terrible-at-dad-jokes/\">launched in June</a> held off the competition as a top model for most of the year, while <a href=\"https://arstechnica.com/information-technology/2024/09/openais-new-reasoning-ai-models-are-here-o1-preview-and-o1-mini/\">OpenAI's o1</a> used runtime compute to expand GPT-4o's capabilities with simulated reasoning. <a href=\"https://arstechnica.com/ai/2024/09/talking-to-chatgpt-for-the-first-time-is-a-surreal-experience/\">Advanced Voice Mode</a> and <a href=\"https://arstechnica.com/ai/2024/09/fake-ai-podcasters-are-reviewing-my-book-and-its-freaking-me-out/\">NotebookLM</a> also emerged as novel applications of AI tech, and the year saw the rise of more capable <a href=\"https://arstechnica.com/information-technology/2024/04/new-ai-music-generator-udio-synthesizes-realistic-music-on-demand/\">music synthesis models</a> and also better <a href=\"https://arstechnica.com/ai/2024/10/is-china-pulling-ahead-in-ai-video-synthesis-we-put-minimax-to-the-test/\">AI video generators</a>, including several from China.</p><p><a href=\"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/#comments\">Comments</a></p>\n\n            ","flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2024/12/addled_by_AI_header-1152x648.jpg","enclosureMime":""},{"title":"AMD Ryzen PCs May See More Power Savings Out-Of-The-Box With Linux 6.14","url":"https://www.phoronix.com/news/AMD-P-State-Ryzen-Linux-6.14","date":1735214100,"author":"Michael Larabel","unread":true,"desc":"","content":"AMD Ryzen systems with the upcoming Linux 6.14 kernel may see increased power savings out-of-the-box due to an AMD P-State driver change queued up as part of the new power management code for this next version of the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Reiser5 Would Be Turning Five Years Old But Remains Dead","url":"https://www.phoronix.com/news/Reiser5-Five-Years-Old","date":1735213651,"author":"Michael Larabel","unread":true,"desc":"","content":"It was on New Year's Eve 2019 that Edward Shishkin announced the Reiser5 file-system as an evolution of the out-of-tree Reiser4 file-system code. While next week would mark five years of Reiser5, the Reiser4/Reiser5 file-system still appears effectively dead and hasn't been touched in quite a while...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Pre-Content fanotify / fanotify Hierarchical Storage Management Expected For Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-precontent-fanotify","date":1735212167,"author":"Michael Larabel","unread":true,"desc":"","content":"Queued up by way of linux-fs.git's \"for_next\" Git branch is the fanotify HSM (Hierarchical Storage Management) implementation via the pre-content fanotify patch series...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Flying Was Already the Worst. Then America Stopped Using Headphones.","url":"https://tech.slashdot.org/story/24/12/26/0912215/flying-was-already-the-worst-then-america-stopped-using-headphones?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735210920,"author":"msmash","unread":true,"desc":"","content":"Airports are facing a growing nuisance as travelers increasingly watch videos and take calls on speakerphone without headphones, creating tension among passengers at gates and lounges. \n\nFlight attendants at American Airlines, Alaska Air, and Delta have begun addressing the issue through announcements and website notices, though enforcement remains challenging, WSJ reports. Passengers report confrontations rarely end well, with offenders often dismissive or hostile when asked to use headphones. The story adds: The headphones-optional attitude isn't limited to air travel. Podcasts and sports games blare in open-plan offices. You can catch snippets of conversations on the sidewalk, some phones held aloft for video calls. Transit authorities in big cities have struggled to get passengers to keep their music to themselves on subways and commuter trains. \n\nWitnesses say offenders span the generational and socioeconomic spectrum, from grandparents on speakerphone to toddlers on iPads and from first class to coach. \n\nAir travel already overloads the senses with a cacophony of boarding announcements, beeping vehicles and crying babies. U.S. airlines generally don't allow voice and video calls in the air. But by takeoff, the damage has been done.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Flying+Was+Already+the+Worst.+Then+America+Stopped+Using+Headphones.%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F0912215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F0912215%2Fflying-was-already-the-worst-then-america-stopped-using-headphones%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/26/0912215/flying-was-already-the-worst-then-america-stopped-using-headphones?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561557&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Hash-Based Integrity Checking Proposed For Linux To Help With Reproducible Builds","url":"https://www.phoronix.com/news/Hash-Based-Integrity-Linux-RB","date":1735210815,"author":"Michael Larabel","unread":true,"desc":"","content":"An interesting request for comments (RFC) patch series was posted on Christmas for introducing hash-based integrity checking to help with the reproducible builds initiative around the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bald Eagle Officially Declared US National Bird After 250 Years","url":"https://news.slashdot.org/story/24/12/26/0854206/bald-eagle-officially-declared-us-national-bird-after-250-years?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735203660,"author":"msmash","unread":true,"desc":"","content":"The bald eagle is now officially the national bird of the US, after President Joe Biden signed a law on Christmas Eve bestowing the honour upon the white-headed and yellow-beaked bird of prey. BBC News: The bird has been a national emblem in the US for years, appearing on the Great Seal of the US -- used on US documents -- since 1782. But it had not been officially designated to be the national bird until Congress passed the bill last week, sending it to Biden's desk to be signed. \n\n\"For nearly 250 years, we called the bald eagle the national bird when it wasn't,\" said Jack Davis, co-chair of the National Bird Initiative for the National Eagle Center, in a statement. \"But now the title is official, and no bird is more deserving.\" Not everyone has always agreed about the national status of the bald eagle. Founding Father Benjamin Franklin objected to the creature being chosen to represent the country, calling it a \"bird of bad moral character.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bald+Eagle+Officially+Declared+US+National+Bird+After+250+Years%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0854206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0854206%2Fbald-eagle-officially-declared-us-national-bird-after-250-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/0854206/bald-eagle-officially-declared-us-national-bird-after-250-years?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561553&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Japan Airlines Hit By Cyberattack, Delaying Flights During Year-End Holiday Season","url":"https://it.slashdot.org/story/24/12/26/0544247/japan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735198200,"author":"msmash","unread":true,"desc":"","content":"Japan Airlines said it was hit by a cyberattack Thursday, causing delays to more than 20 domestic flights but the carrier said there was no impact on flight safety. From a report: JAL said the problem started Thursday morning when the company's network connecting internal and external systems began malfunctioning. The airline said the cyberattack had delayed 24 domestic flights for more than 30 minutes, and the impact could expand later in the day.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Japan+Airlines+Hit+By+Cyberattack%2C+Delaying+Flights+During+Year-End+Holiday+Season%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F0544247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F0544247%2Fjapan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/26/0544247/japan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561483&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"PharmEasy investor cuts value of its stake drastically, implying new valuation of $456M","url":"https://techcrunch.com/2024/12/25/pharmeasy-valued-at-456-million-vs-peak-5-6-billion-investor-data-shows/","date":1735195760,"author":"Manish Singh","unread":true,"desc":"","content":"<p>Indian online pharmacy PharmEasy is now being valued at about $456 million after its investor Janus Henderson said in a filing that it valued its stake of 12.9 million shares in the startup at $766,043. The asset manager&#8217;s Global Research Fund had originally spent $9.4 million to acquire these shares. This valuation is 92% less [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bluesky is testing a trending topics feature","url":"https://techcrunch.com/2024/12/25/bluesky-starts-testing-a-trending-topics-feature/","date":1735194119,"author":"Ivan Mehta","unread":true,"desc":"","content":"<p>Social network Bluesky said on Christmas that it is testing a trending topics view. The trending topics are visible both on the desktop and mobile apps of the social network for users across the world. On the desktop, you can see trending topics on the right sidebar, and on the mobile app, you can tap [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Germany Joins EU's 'Ultra-Low' Fertility Club","url":"https://news.slashdot.org/story/24/12/26/0333203/germany-joins-eus-ultra-low-fertility-club?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735189200,"author":"msmash","unread":true,"desc":"","content":"Three more EU member states -- including the most populous, Germany -- have joined the list of countries with \"ultra-low\" fertility rates [non-paywalled source], highlighting the extent of the region's demographic challenges. Financial Times: Official statistics show Germany's birth rate fell to 1.35 children per woman in 2023, below the UN's \"ultra-low\" threshold of 1.4 -- characterising a scenario where falling birth rates become tough to reverse. \n\nEstonia and Austria also passed under the 1.4 threshold, joining the nine EU countries -- including Spain, Greece and Italy -- that in 2022 had fertility rates below 1.4 children per woman. The fall in birth rates partially reflects the \"postponement of parenthood until the 30s,\" which involves a \"higher likelihood that you will not have as many children as you would like because of the biological clock,\" said Willem Adema, senior economist at the OECD.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Germany+Joins+EU's+'Ultra-Low'+Fertility+Club%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0333203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0333203%2Fgermany-joins-eus-ultra-low-fertility-club%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/0333203/germany-joins-eus-ultra-low-fertility-club?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561425&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Apple Explains Why It Doesn't Plan To Build a Search Engine","url":"https://apple.slashdot.org/story/24/12/26/0255257/apple-explains-why-it-doesnt-plan-to-build-a-search-engine?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735181760,"author":"msmash","unread":true,"desc":"","content":"Apple has no plans to develop its own search engine despite potential restrictions on its lucrative revenue-sharing deal with Google, citing billions in required investment and rapidly evolving AI technology as key deterrents, according to a court filing [PDF]. \n\nIn a declaration filed with the U.S. District Court in Washington, Apple Senior Vice President Eddy Cue said creating a search engine would require diverting significant capital and employees, while recent AI developments make such an investment \"economically risky.\" \n\nApple received approximately $20 billion from Google in 2022 under a deal that makes Google the default search engine on Safari browsers. This arrangement is now under scrutiny in the U.S. government's antitrust case against Google. \n\nCue said Apple lacks the specialized professionals and infrastructure needed for search advertising, which would be essential for a viable search engine. While Apple operates niche advertising like the App Store, search advertising is \"outside of Apple's core expertise,\" he said. Building a search advertising business would also need to be balanced against Apple's privacy commitments, according to his declaration.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Explains+Why+It+Doesn't+Plan+To+Build+a+Search+Engine%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F26%2F0255257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F26%2F0255257%2Fapple-explains-why-it-doesnt-plan-to-build-a-search-engine%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/12/26/0255257/apple-explains-why-it-doesnt-plan-to-build-a-search-engine?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561403&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Russia Bans Crypto Mining in Multiple Regions, Citing Energy Concerns","url":"https://hardware.slashdot.org/story/24/12/25/2232247/russia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735173000,"author":"msmash","unread":true,"desc":"","content":"The Russian government has banned crypto mining in ten regions for a period of six years, according to reporting by the state-owned news agency Tass. Engadget adds: Russia has cited the industry's high power consumption rates as the primary reason behind the ban. Crypto is particularly power-hungry, as mining operations already account for nearly 2.5 percent of US energy use. \n\nThis ban takes effect on January 1 and lasts until March 15, 2031. The country's Council of Ministers has also stated that additional bans may be required in other regions during periods of peak energy demand. It could also go the other way. The ban could be temporarily lifted or altered in certain regions if a government commission examines changes in energy demand and deems it necessary.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russia+Bans+Crypto+Mining+in+Multiple+Regions%2C+Citing+Energy+Concerns%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F25%2F2232247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F25%2F2232247%2Frussia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/25/2232247/russia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561267&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Porch Pirates Are Now Raising the Price You Pay at Checkout","url":"https://slashdot.org/story/24/12/25/2222227/porch-pirates-are-now-raising-the-price-you-pay-at-checkout?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735167660,"author":"msmash","unread":true,"desc":"","content":"Lost deliveries, shipping delays and theft on the front porch have become such growing problems that companies are making consumers pay for package protection. From a report: Tens of thousands of online retailers now offer the service for a few dollars per order. The fees go to young companies -- Route and Corso, to name two -- that promise to make customers whole without charging the merchant if a delivery doesn't arrive. Consumers are finding that retailers either ask them to pay for package protection or draw a harder line when it comes to replacing a missing item. Some retailers are making the fees mandatory, spreading the burden of package theft among all customers. \n\nTo know whether you are paying the fee, review your order before you press purchase. Sometimes it is named after the company offering protection, and sometimes it is called shipping insurance or package protection. Skincare brand Topicals began using Corso two years ago after seeing 30% of its packages were regularly marked delivered but not received, according to customer insights manager Deja Jefferson. By requiring protection, which Topicals discloses on its shipping page, the company doesn't have to worry about convincing customers to opt in. \"We actually don't get any complaints on it whatsoever,\" she said. Further reading: Porch Pirates Steal So Many Packages That Now You Can Get Insurance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Porch+Pirates+Are+Now+Raising+the+Price+You+Pay+at+Checkout%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F25%2F2222227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F25%2F2222227%2Fporch-pirates-are-now-raising-the-price-you-pay-at-checkout%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/25/2222227/porch-pirates-are-now-raising-the-price-you-pay-at-checkout?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561257&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Elon Musk’s xAI lands $6B in new cash to fuel AI ambitions","url":"https://techcrunch.com/2024/12/25/elon-musks-xai-lands-billions-in-new-cash-to-fuel-ai-ambitions/","date":1735157820,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>Updated December 25, 12:21 p.m. Pacific: Added details of xAI&#8217;s valuation and Kingdom Holdings&#8217; contribution. xAI, Elon Musk&#8217;s AI company, has raised $6 billion in a Series C financing round. The company announced this week that Andreessen Horowitz , Blackrock, Fidelity, Lightspeed, MGX, Morgan Stanley, OIA, QIA, Sequoia Capital, Valor Equity Partners, Vy Capital, Nvidia, [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux RNDIS Removal Branch Updated For Disabling Microsoft RNDIS Protocol Drivers","url":"https://www.phoronix.com/news/Linux-RNDIS-Removal-EOY2024","date":1735147999,"author":"Michael Larabel","unread":true,"desc":"","content":"There's activity again around potentially disabling and then ultimately removing the RNDIS Linux kernel code for those drivers complying with the Microsoft Remote Network Driver Interface Specification (RNDIS) protocol specification. RNDIS was used atop USB for virtual Ethernet but has proven insecure and problematic...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"$132K – $149K, here’s what seed-stage founders pay early employees, based on data","url":"https://techcrunch.com/2024/12/25/132k-149k-heres-what-seed-stage-founders-pay-early-employees-based-on-data/","date":1735147659,"author":"Julie Bort","unread":true,"desc":"","content":"<p>Once a startup has raised its seed round, the perennial question becomes how much should the founders pay themselves and their first few employees? Kruze Consulting, a CPA firm that specializes in venture-backed startups, recently analyzed average salary ranges for over 450 seed-stage startups and shared that data with TechCrunch. The following averages are based [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"GV, the VC team backed by Google, has a broad remit, but it can’t do one thing","url":"https://techcrunch.com/2024/12/25/gv-the-vc-team-backed-by-google-has-a-broad-remit-but-it-cant-do-one-thing/","date":1735147347,"author":"Connie Loizos","unread":true,"desc":"","content":"<p>David Krane is in an enviable position. As the CEO of GV, the venture firm that is funded entirely by Google to the tune of $1 billion a year, his team of roughly 100 gets to make a lot of bets — with just a couple of notable restrictions. During a TechCrunch StrictlyVC event in [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AMD’s CES 2025 press conference: How to watch","url":"https://techcrunch.com/2024/12/25/amds-ces-2025-press-conference-how-to-watch/","date":1735142400,"author":"Brian Heater","unread":true,"desc":"","content":"<p>AMD has its work cut out for it at CES 2025. Competitor Nvidia has been sucking the oxygen out of every room it graces, as the chipmaker remains at the forefront of the AI boom. So, how will AMD compete with Nvidia’s reported RTX 5000 announcement? The company should show off its own next-gen GPU. [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Coming to Theaters: An AI-Generated Bollywood Movie","url":"https://spectrum.ieee.org/ai-movie","date":1735138802,"author":"Edd Gent","unread":true,"desc":"","content":"<p>Makers of the first AI feature film confront the tech's continuity problems </p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4NzA3OC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTczOTI1NDUzM30.oEbWKHcVDoAf8I3nOLlO-wddngh7Y8StCUTeeIJi14U/image.png?width=600","enclosureMime":""},{"title":"systemd Highlights For 2024 From Run0 To Varlink To Advancing systemd-homed","url":"https://www.phoronix.com/news/systemd-2024-highlights","date":1735138002,"author":"Michael Larabel","unread":true,"desc":"","content":"Systemd had another busy year working on many new features from run0 as a sudo alternative to making systemd-homed more robust, increasing Varlink use, systemd-boot continuing to gain more traction, and more...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Top 8 Consumer Electronics Stories of 2024","url":"https://spectrum.ieee.org/top-consumer-electronics-2024","date":1735135202,"author":"Matthew S. Smith","unread":true,"desc":"","content":"<p>\"Re-buttonization,\" Meta's pricey AR glasses, and the story of the first Fitbit</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM1MjIyMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTczOTQ5Mzc0NX0.GAnviXGsiVcrMq0QYSMfiHbsdEzZvgGZWliepv4qNdA/image.jpg?width=600","enclosureMime":""},{"title":"Home for the holidays? Share this top cybersecurity advice with friends and family","url":"https://techcrunch.com/2024/12/25/home-for-the-holidays-share-this-top-cybersecurity-advice-with-friends-and-family/","date":1735131630,"author":"Zack Whittaker","unread":true,"desc":"","content":"<p>Sharing security advice can go a long way in protecting your loved ones from the most common and damaging online threats. </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Intel Mesa Code Lands Big Patch Series For Treating Convergent Values As SIMD8","url":"https://www.phoronix.com/news/Intel-Mesa-Conv-SIMD8","date":1735127166,"author":"Michael Larabel","unread":true,"desc":"","content":"A patch series six months in the making and consisting of 24 patches by longtime Intel Linux graphics engineer Ian Romanick was merged on Christmas Eve for Mesa 25.0...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ruby 3.4 Programming Language Brings \"it\", Better Performance For YJIT","url":"https://www.phoronix.com/news/Ruby-3.4-Released","date":1735124990,"author":"Michael Larabel","unread":true,"desc":"","content":"Ruby 3.4 is out today as yet another annual major feature release for this programming language known for its major updates on Christmas Day...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New Intel Mesa Driver Patches Implement AV1 Decode For Vulkan Video","url":"https://www.phoronix.com/news/Intel-ANV-Vulkan-Video-AV1-Dec","date":1735120800,"author":"Michael Larabel","unread":true,"desc":"","content":"While there has been Vulkan Video support within Intel's open-source \"ANV\" driver since early 2023 and extended over time to handle H.265/HEVC decode, H.264 and H.265 encode, and more, the AV1 decode support has lagged behind until now...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"CachyOS Had A Really Great Year Advancing This Performance-Optimized Arch Linux Platform","url":"https://www.phoronix.com/news/CachyOS-2024-Highlights","date":1735113600,"author":"Michael Larabel","unread":true,"desc":"","content":"The CachyOS Linux distribution has really been on fire this year delivering impressive new features and performance optimizations for this Arch Linux derived OS...","flags":null,"enclosureUrl":"","enclosureMime":""}]}