{"id":"2k6wXud2N91xpf4PwnSfo4j5WSuTNX5k","title":"Tech News - Last 2 days","displayTitle":"Tech News - Last 2 days","url":"","feedLink":"","items":[{"title":"DeepSeek’s new AI model appears to be one of the best ‘open’ challengers yet","url":"https://techcrunch.com/2024/12/26/deepseeks-new-ai-model-appears-to-be-one-of-the-best-open-challengers-yet/","date":1735242290,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>DeepSeek V3 can handle a range of text-based workloads and tasks, like coding, translating, and writing essays and emails from a descriptive prompt.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"6G-AI Mashups Will Reshape the Telecom Industry","url":"https://spectrum.ieee.org/6g-ai-mashup","date":1735239603,"author":"Shashi Raj Pandey","unread":true,"desc":"","content":"<p>EU-U.S. joint initiatives are paving the way for next-gen wireless networks</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM5MzQ4MS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc3Njc4Njk5M30.pXJ_ULd_m4voeDiJwKghWc7oAMv_kZaQ0g4Ht-OidOk/image.jpg?width=600","enclosureMime":""},{"title":"Scientists Explore Longevity Drugs For Dogs That Could Also 'Extend Human Life'","url":"https://science.slashdot.org/story/24/12/26/1824221/scientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735237440,"author":"msmash","unread":true,"desc":"","content":"U.S. biotech startup Loyal plans to launch a lifespan-extending drug for dogs in early 2025, potentially offering insights into human longevity. The San Francisco-based company has secured $125 million in funding for LOY-002, a beef-flavored daily pill designed to extend canine lifespans by at least one year. The drug works by targeting age-related metabolic changes and insulin regulation, according to Loyal CEO Celine Halioua. \n\nSimultaneously, the Dog Aging Project is studying rapamycin, an immunosuppressant drug, which preliminary research suggests could add three years to dogs' lives. Researchers believe these canine studies could accelerate human longevity research, though experts note the lack of standardized aging biomarkers remains a significant hurdle for human trials.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Scientists+Explore+Longevity+Drugs+For+Dogs+That+Could+Also+'Extend+Human+Life'%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F26%2F1824221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F12%2F26%2F1824221%2Fscientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://science.slashdot.org/story/24/12/26/1824221/scientists-explore-longevity-drugs-for-dogs-that-could-also-extend-human-life?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561905&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The fall of EV startup Fisker: A comprehensive timeline","url":"https://techcrunch.com/2024/12/26/the-fall-of-ev-startup-fisker-a-comprehensive-timeline/","date":1735234920,"author":"Henry Pickavet, Sean O'Kane","unread":true,"desc":"","content":"<p>Here is a timeline of the events that led fledgling automaker Fisker to file for bankruptcy.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"KDE Enjoyed A Stellar 2024 With The Debut Of The Plasma 6 Desktop","url":"https://www.phoronix.com/news/KDE-2024-Highlights","date":1735234200,"author":"Michael Larabel","unread":true,"desc":"","content":"The KDE desktop progress made over the course of 2024 was particularly stand-out thanks to the Plasma 6.0 debut near the beginning of the year and then Plasma 6.1 and 6.2 further stabilizing and polishing this open-source desktop. It was a very fine year for the KDE desktop...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Even Apple Wasn't Able To Make VR Headsets Mainstream in 2024","url":"https://tech.slashdot.org/story/24/12/26/1722240/even-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735233720,"author":"msmash","unread":true,"desc":"","content":"Apple's $3,499 Vision Pro headset has failed to gain widespread adoption despite advanced technology, with consumers preferring discreet wearables like smartwatches. The Verge: Nearly a year from launch, though, Apple hasn't done enough to demonstrate why the Vision Pro should be a potential showcase of the future of computing. It's taking a long time to put together its immersive content library, and while those are great demonstrations of what's possible, the videos have been short and isolating. There aren't many great games, either. \n\nYes, Apple keeps adding cool new software features. The wide and ultra widescreen settings for using a Mac display seem exceptionally useful. But those are pretty specific options for pretty specific use cases. There still isn't an immediate, obvious reason to buy a Vision Pro the way there usually is with the company's newest iPhones and Macs. If I bought a Vision Pro today, I wouldn't know what to do with it besides give myself a bigger Mac screen or watch movies, and I don't think either of those are worth the exorbitant price.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Even+Apple+Wasn't+Able+To+Make+VR+Headsets+Mainstream+in+2024%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F1722240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F1722240%2Feven-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/26/1722240/even-apple-wasnt-able-to-make-vr-headsets-mainstream-in-2024?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561847&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft and OpenAI have a financial definition of AGI: Report","url":"https://techcrunch.com/2024/12/26/microsoft-and-openai-have-a-financial-definition-of-agi-report/","date":1735233362,"author":"Maxwell Zeff","unread":true,"desc":"","content":"<p>Microsoft and OpenAI have a very specific, internal definition of artificial general intelligence (AGI) based on the startup&#8217;s profits, according to a new report from The Information. And by this definition, OpenAI is many years away from reaching it. The two companies reportedly signed an agreement last year stating OpenAI has only achieved AGI when [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Executive assistants, high salaries, and other ways early-stage founders will trigger a seed VC","url":"https://techcrunch.com/2024/12/26/executive-assistants-high-salaries-and-other-ways-early-stage-founders-will-trigger-a-seed-vc/","date":1735233229,"author":"Julie Bort","unread":true,"desc":"","content":"<p>While most seed investors believe founders should spend their raised cash however they want to, those VCs will still be judging founders’ cash management.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Elon Musk’s jets made 355 trips in 2024, including 31 to or from the Mar-a-Lago area","url":"https://techcrunch.com/2024/12/26/elon-musks-jets-made-355-trips-in-2024-including-31-to-or-from-the-mar-a-lago-area/","date":1735232970,"author":"Margaux MacColl","unread":true,"desc":"","content":"<p>Elon Musk’s jets took over 355 flights this year, with 31 of those flights heading to or from near Mar-a-Lago. </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Redefining Network Solutions for Edge Computing: Ishan Bhatt's Vision for AI and ML Workloads","url":"https://hackernoon.com/redefining-network-solutions-for-edge-computing-ishan-bhatts-vision-for-ai-and-ml-workloads?source=rss","date":1735232417,"author":"Jon Stojan Media","unread":true,"desc":"","content":"<p>\\\nEdge computing has emerged as a transformative force in today’s technological landscape, particularly in the fields of artificial intelligence (AI) and machine learning (ML). By enabling data processing to occur closer to its source, this approach minimizes dependence on centralized data centers. The result is faster processing speeds, reduced latency, and enhanced security—qualities that are indispensable for AI and ML, where real-time data analysis and response are critical.</p>\n<p>\\\nAt the forefront of this revolution is Ishan Bhatt, whose innovative work with Google Distributed Cloud Connected addresses the complex challenges of implementing edge computing for AI and ML workloads. Ishan’s solutions deliver the low-latency, high-performance networking essential for applications such as autonomous vehicles and advanced healthcare technologies.</p>\n<p>\\\nBy focusing on optimizing network performance and achieving seamless cloud integration, Ishan is redefining standards for efficiency and innovation in this dynamic and rapidly advancing domain.</p>\n<h3 id=\"crackingthelowlatencycode\"><strong>Cracking the low-latency code</strong></h3>\n<p>Developing low-latency, high-performance networking solutions for edge deployments comes with significant challenges, as Ishan explains. One of the primary hurdles lies in the limited computational and energy resources at the edge. To address this, Ishan notes, “It is crucial to optimize software and protocols to minimize resource usage while also leveraging advanced hardware accelerators like GPUs and FPGAs to offload tasks efficiently.” Additionally, he employs dynamic power management techniques to maintain a balance between energy consumption and system performance.</p>\n<p>\\\nAnother critical challenge is achieving the ultra-low latency required for edge applications. Ishan emphasizes the importance of strategies such as edge caching and data prefetching, which reduce the need for remote data retrieval, and advanced routing algorithms to ensure data transmission via the shortest possible paths. To manage unpredictable workloads and maintain scalability across distributed nodes, Ishan highlights the need for adaptive traffic management systems that allocate bandwidth dynamically based on real-time demand and microservice-based deployments for flexible scaling. These carefully integrated approaches reflect his commitment to addressing the unique demands of edge networking with precision and innovation.</p>\n<h3 id=\"networkingforedgeai\"><strong>Networking for edge AI</strong></h3>\n<p>Supporting AI and ML workloads at the edge demands a unique set of networking requirements to handle their high complexity and resource demands. Ishan highlights the necessity for high-bandwidth networking to handle the volume efficiently, especially when processing large datasets such as video streams or real-time telemetry. Unlike traditional networks, which prioritize general-purpose data transfer, edge AI solutions require robust throughput to prevent bottlenecks in the processing pipeline.</p>\n<p>\\\nUltra-low latency is another critical factor, as many AI tasks, including real-time object detection and autonomous decision-making, rely on instantaneous responses. Ishan explains, “Edge AI systems must minimize latency to support these time-sensitive operations,\" whereas traditional networks can tolerate delays typical of batch-processing tasks. Additionally, AI at the edge benefits from distributed architectures that decentralize processing, enabling localized data handling and coordination among geographically dispersed nodes. Ishan contrasts this with traditional systems, which typically centralize processing in data centers, making them less suited for the decentralized nature of edge AI. Tailoring networks to these unique demands is essential to unlocking the full potential of AI and ML at the edge.</p>\n<h3 id=\"acceleratingperformanceinedgecomputing\"><strong>Accelerating performance in edge computing</strong></h3>\n<p>Achieving low-latency performance in edge deployments requires a combination of advanced strategies and innovative technologies, as outlined by Ishan. A key approach involves bringing computation closer to data sources. Ishan explains, \"Deploy compute resources at the network edge to handle time-sensitive tasks locally,\" minimizing the distance data must travel and reducing reliance on centralized servers through localized caching. To further optimize speed, he recommends modernizing communication protocols, such as replacing traditional TCP with alternatives like QUIC or RDMA, which reduce overhead and improve efficiency for specific use cases.</p>\n<p>\\\nDynamic traffic management also plays a crucial role. Ishan utilizes software-defined networking (SDN) to \"dynamically optimize traffic routing and resource allocation,\" ensuring latency-sensitive tasks receive priority. Similarly, network function virtualization (NFV) replaces hardware-based network appliances with virtualized functions, bringing critical processes closer to the edge and reducing delays. Advanced hardware, such as FPGA and ASIC accelerators, combined with intelligent routing algorithms and real-time congestion control mechanisms, ensures data flows along the most efficient paths. These techniques, paired with continuous latency monitoring and hybrid edge-cloud architectures, enable networks to meet the rigorous demands of AI, IoT, and other real-time applications.</p>\n<h3 id=\"scalingedgeintelligence\"><strong>Scaling edge intelligence</strong></h3>\n<p>Scalability in edge networks, especially for AI and ML applications, demands innovative design and strategic resource management. Ishan emphasizes the importance of modular architectures, stating, “They allow seamless addition of edge nodes or components as demand grows.\" This approach relies on microservices for specific network functions, distributed edge infrastructures to reduce bottlenecks, and hierarchical edge tiers to balance workloads effectively across layers.</p>\n<p>\\\nDynamic resource allocation also plays a critical role in scaling efficiently. Ishan points out the value of using containerized environments like Kubernetes, which can dynamically orchestrate workloads across edge nodes and implement auto-scaling to adjust resources in real time. Additionally, AI-specific strategies such as federated learning frameworks enable distributed processing across edge nodes, reducing reliance on centralized training. By integrating advanced technologies like Time-Sensitive Networking (TSN) and leveraging high-performance hardware such as TPUs and FPGAs, Ishan ensures scalability without compromising the performance, adaptability, or reliability of edge networks designed to meet the increasing demands of AI and ML workloads.</p>\n<h3 id=\"automationinaction\"><strong>Automation in action</strong></h3>\n<p>Automation is a cornerstone of efficient edge network deployment, as Ishan’s experience with Google Distributed Cloud Connected demonstrates. By employing the widely used gcloud API, Ishan ensures that edge device configurations are automated to maintain consistency across large-scale deployments. “It reduces manual errors and accelerates setup from days to hours,” Ishan explains, emphasizing the tangible improvements in speed and accuracy. This approach also abstracts complex technical details, making the deployment process more user-friendly and streamlined.</p>\n<p>\\\nIshan envisions automation evolving further as it integrates with advanced technologies and trends. “AI and ML enhance network management by predicting traffic patterns, automating fault detection, and optimizing resource allocation,” he notes, underscoring the role of AI-powered automation in shaping next-generation networks. Tools like digital twins, which simulate and optimize network performance, and AI-driven anomaly detection are set to strengthen security and operational efficiency in increasingly complex environments.</p>\n<p>\\\nEmerging trends such as federated learning and quantum networking will also benefit from automation. Ishan highlights the need to design networks that facilitate federated learning for distributed AI processing while integrating quantum networking for unparalleled security and speed. These advancements, paired with automation, will enable networks to handle the growing demands of AI and edge workloads while maintaining scalability and adaptability.</p>\n<p>\\\nThis forward-looking integration of automation with innovations in hardware and sustainability reflects Ishan’s commitment to driving impactful advancements. Implementing energy-saving algorithms and hardware optimizations for AI workloads is a key focus, aligning operational efficiency with environmental responsibility. Ishan’s vision ensures that edge networks remain agile, secure, and ready for future demands.</p>\n<h3 id=\"realworldimpact\"><strong>Real-world impact</strong></h3>\n<p>The integration of AI and ML at the edge is revolutionizing real-world applications by enabling faster, more secure, and efficient processing of data. Ishan explains that edge AI systems eliminate the need to send data to the cloud, significantly reducing latency. \"AI-driven healthcare devices at hospitals detect irregular heart rhythms and alert doctors within milliseconds, potentially saving lives,\" Ishan highlights, demonstrating the life-saving potential of localized decision-making. Additionally, this approach enhances privacy and security by minimizing the transmission of sensitive data, as seen in facial recognition systems at airports that process images locally while maintaining compliance with privacy regulations.</p>\n<p>\\\nEffective network design underpins these advancements by ensuring low-latency communication and dynamic resource allocation. Ishan points out, \"Networks with automated resource scaling ensure efficient handling of fluctuating AI/ML workloads,\" which is critical during peak demand periods, such as in e-commerce for AI-driven recommendation systems. Moreover, distributed architectures improve resilience, enabling systems like industrial IoT to maintain operations even during disruptions. Ishan underscores the broader impact of these designs, stating that optimized networks reduce energy consumption and operational costs, making edge AI more sustainable. These innovations not only enhance current applications but also set the stage for continuous innovation across industries.</p>\n<p>\\\nAs networking solutions continue to progress, Ishan’s leadership serves as a guiding light. His forward-thinking strategies remain instrumental as we prepare for the continuous integration of AI and ML into various sectors. The convergence of next-generation technologies, such as 5G and AI automation, into edge networks will only heighten the impact of his work. Ishan’s commitment to innovation and excellence ensures he remains a leader, steering these advancements with a vision that anticipates and meets future demands. \"The next generation of network solutions for edge and AI workloads will be shaped by advancements in hardware, software, and architectural paradigms,\" Ishan notes, reflecting his insightful understanding of the technological landscape.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Divide of Failed Economy and Its Citizens","url":"https://hackernoon.com/the-divide-of-failed-economy-and-its-citizens?source=rss","date":1735232414,"author":"Eaelll Leon Faust","unread":true,"desc":"","content":"<p>\\\n<em>A note from Leon Faust on starting MyPursePay</em>: Economies and governments can be categorically a catastrophe, but the individual citizen's wealth economy does not have to be.</p>\n<p>\\\nNow, what is the question? It is a chicken on every homely table. The question is not merely an idea — it is an argument on what is truly attainable in a world economy presented with a paradox in its bother to counter lack with radical supply… one it possesses certainly.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-ik234aq.jpeg\" alt=\"1928 Republican Newspaper Advertisement: This advertisement, associated with Herbert Hoover's campaign, embodies the promise of prosperity.\" /></p>\n<p>\\\n\\\nBut we are realists, and we know as things are: a chicken for every pot is a wrong ask. It is a naïve ask.</p>\n<p>\\\nSo, let us make an agenda (because we bother). Even in our educated agenda, the divide of efforts and reason, and of reason for execution, is substantial:</p>\n<p>\\</p>\n<ol>\n<li><p>The amateurish.</p></li>\n<li><p>Strong capitals of intelligence, resource, and networks, armed agendas with shareholder objectives.</p>\n<p>\\</p></li>\n</ol>\n<p>Firstly, enjoin me to a definition: amateur.</p>\n<p>\\\nThe amateur engages in an activity for pleasure rather than as a profession or for financial gain. That is in no way a proclamation of a virtuous high ground — in fact, it is only circumstances that have nudged me to my position — I would not necessarily have chosen it.</p>\n<p>\\\nHow does the citizen of a failing economy survive? what do they do when they have no control over the bigger picture? I am not an economist, nor a politically literate individual, but I am an engineer who have Identified a rather non problematic fix for the individual experience, and leaving the macroeconomic schematics to those who bother. The citizens of Nigeria are in trouble. The naira (the Nigerian currency) kept losing its value each day to inflation, so much it was disorienting. Just so you understand — if you earned one naira every single day, for four years straight, you still would not make a dollar.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-qe334wy.gif.webp\" alt=\"\" /></p>\n<p>It would be odd for the average citizen in an economy as that to stand non-disoriented — much beyond acquainted with it. The federal minimum wage remains less than 50 dollars a month — that is largely unsubstantial. Poverty increases; the wealth divide grows larger.</p>\n<p>\\\nThere was a lot to pack in, most of it another tragedy — but one thing is understood by anyone who sleeps with the intent to wake:</p>\n<p>\\</p>\n<ul>\n<li><p>You either make more money,</p></li>\n<li><p>Or make the most of any you control.</p>\n<p>\\</p></li>\n</ul>\n<p>The former certainly is most appealing, but not very reachable for most, for obvious reasons. The latter? We can work with that. The question for me was, how do I make the most out of the money I have, while I try navigating the crisis of expenditure, and the hard work of earning more. To do this, I had to get back to my priority list, but this time, with a gun to my head.</p>\n<p>\\\nDid I really have to buy the fifth snack for the day? No.</p>\n<p>Did I really have to cook my noodles with four eggs? No.</p>\n<p>Did I really have to lend my roommate cash whenever he asked for it? No.</p>\n<p>Did I really have to eat my oatmeal with that much milk? No.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-rt434oc.gif.webp\" alt=\"\" /></p>\n<p>As It turns out, when you are under pressure, there is a place where you could see quite clearly. Now, what do I do? It was true I did not need any more motivation to cut back on the spending, but heavens know it is all easier said than done. If I had a way of simply not having access to the money I would very much not like to waste. I am a software engineer, so getting the idea for an app was most natural, as I knew what could be done. Sadly, I could not find any existing apps doing this, so I was not getting a save. But I could do it for others. And I did ask — had a conversation with a couple of friends of mine, and they concurred on a relevance.</p>\n<p>\\\nGet acquainted with MyPursePay, a fintech app that allows users to schedule their money into days, weeks, or months — enabling them to lock it, and only allowing them to spend the amount they set on the event of the schedule they made.</p>\n<p>\\\nTo put that into perspective, if you had 30 dollars to spend for 30 days (a month) on transportation, and it cost a dollar a day for a bus ride, to ensure you never end up running out of money for that, due to unexpected expenses or casual spontaneous purchases, you can schedule a dollar a day on the MyPurse app. Every morning, a dollar is released to you for your bus ride, while the rest of the money remains inaccessible to you until the next day.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/6SmKD9YTi8b2HqzaEVy2WeHHv7p2-nd634m4.gif.webp\" alt=\"\" /></p>\n<p>\\\nThe Nigerian citizens are widely digitally engaged, so there will be no usability or entry barriers. As for the idea, it will have to prove itself. The bureaucracies, political jargon, and unempathetic details on why the economy has fallen in ruins will elude the layman. They cannot control what they do not know, and have no power over. Words do not mean much in Nigeria, not on any level that concerns the ideals of democracy. What the citizen can do is adapt, and survive.</p>\n<p>\\\nNow, for your considerations, I am the subject of definition : the amateur. I have come to see my enterprise find an entanglement with empathy for the well-being of the common citizen. I am Nigerian anyways, and what is any man without the will to serve his homeland? But this enterprise is young — it is inexperienced and, naturally, challenged. But it will give its best regardless. Because that is what survivors do.</p>\n<p>\\\nCheers,</p>\n<p><strong>Leon</strong></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The High Cost of Training Data in NLP Projects","url":"https://hackernoon.com/the-high-cost-of-training-data-in-nlp-projects?source=rss","date":1735231515,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"64thecostoftrainingdata\">6.4. The cost of training data</h2>\n<p>In the project, we used a mixture of supervised and unsupervised (rules) methods. There are many practical reasons for this choice, but contrary to the scientific literature that is predominantly based on supervised machine learning methods (Suganthan et al., 2015), the main reasons for not opting for a fully supervised approach is the cost. This may be explained from many factors, such as the human labour, the time required, the number (and complexity) of tasks to be addressed, and the tools needed for developing the training data.</p>\n<p>\\\nThe project uses a process that involves multiple tasks of varying complexity. Developing training data for the two zoning tasks is relatively low-cost, as they do not require specialist tools to support the annotation process. In both tasks, annotators were given the extracted text passages either in raw text or CSV (for tables only), together with the original document for reference. The annotation task is also fairly easy, as it only requires skimming through these documents, and does not require extensive reading. In contrast, annotating lot items (lot item detection) and their specific attributes (lot parsing) are much lower granularity tasks, and require examining content at sentence or phrase level. The data also needs to be transformed into formats that can be loaded into state of the art annotation tools that are not always available for our data format. For example, the widely used ‘spacyNER’ annotation format requires parallel sequences of tokens and their labels for each sentence. Such data is very expensive to develop from a business perspective.</p>\n<p>\\\nFurther, as already raised in earlier studies, industrial solutions often favour rules over supervised models as the latter offers easier interpretability and maintainability. These are crucial factors as the needs for their applications can evolve over time and therefore, the solutions must be easy to modify over time. In these cases, changing rules may be a much lighter effort than recreating training data and retraining the system. For these reasons, training data for supervised models can be a barrier to the adoption of methods developed in the research communities, when it comes to developing industrial applications.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Why Classic Algorithms Still Matter in Modern Natural Language Processing","url":"https://hackernoon.com/why-classic-algorithms-still-matter-in-modern-natural-language-processing?source=rss","date":1735230618,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"63thedilemmaofalgorithmicchoices\">6.3. The dilemma of algorithmic choices</h2>\n<p>Our classification method is based on ‘classic’ machine learning algorithms and does not utilise the more recent deep neural networks trained on very large datasets as ‘language models’, such as the well known BERT (Delvin et al., 2018). These models have been shown to set new benchmarks for a wide range of NLP tasks. However, we did not use BERT or similar language model based methods for a number of practical reasons.</p>\n<p>\\\nFirst, such models work in slightly different ways from classic algorithms in the sense that they take over the feature extraction process through a ‘text reading’ process analogous to humans. The idea is that through training such models using enormous data, they are expected to have a certain level of ‘understanding’ of human language, and therefore, can learn to automatically extract useful features from the input texts. This makes feature engineering not very compatible with such models, although one can still run such models as a ‘feature extractor’ to generate a feature representation vector, and combine it with other predefined features.</p>\n<p>\\\nSecond, such models are usually very resource intensive due to its complex architecture and the amount of data used to train them. As a result, they usually can only take a limited length of text. Popular options are a length of 256 or 512 tokens, with the second typically requiring significantly higher computing resources. This means that some of our tasks, such as page or table classification, may not fit well when the content is longer than this length, particularly the smaller option which is more affordable.</p>\n<p>\\\nThird, we experimented with a generic BERT model (English uncased, 256) on the lot item detection task using English training data only, and compared its performance against our best performing model, random forest. However, we did not notice significant gain in F1 by BERT (under 2 percentage points). We assume that a potential reason is that the generic BERT model is trained on general purpose corpus that may not be closely related to healthcare. Studies (Alsentzer et al., 2019; Beltagy et al., 2019) have shown that usually, language models need to be further trained using domain specific corpora when they are to be applied to domain specific contexts. This again requires significant data and computing resources, especially when we have to deal with multiple languages.</p>\n<p>\\\nTherefore, the next lesson we learned is that for industry projects, practicality is an important factor when it comes to choosing the methods. Resource constraints often outweigh algorithmic superiority, especially if the performance gain is small given the potential resource investment needed.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Performance Benefits Of Linux 6.12 LTS Over Linux 6.6 LTS","url":"https://www.phoronix.com/review/linux-66-612-lts","date":1735230600,"author":"Michael Larabel","unread":true,"desc":"","content":"Linux 6.12 was recently promoted to being this year's Long Term Support (LTS) kernel with it being the last major kernel release of 2024. For those enterprise Linux users, hyperscalers, and others typically jumping from one annual LTS kernel to the next, in this holiday article are some benchmarks looking at the performance benefits of Linux 6.12 LTS compared to Linux 6.6 LTS while testing on an AMD Ryzen Threadripper workstation.","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft-OpenAI Deal Defines AGI as $100 Billion Profit Milestone","url":"https://slashdot.org/story/24/12/26/1613249/microsoft-openai-deal-defines-agi-as-100-billion-profit-milestone?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735229520,"author":"msmash","unread":true,"desc":"","content":"OpenAI CEO Sam Altman is negotiating major changes to the company's $14 billion partnership with Microsoft. The companies have defined artificial general intelligence (AGI) as systems generating $100 billion in profits [non-paywalled source] -- the point at which OpenAI could end certain Microsoft agreements, The Information reports. \n\nAccording to their contract, AGI means AI that surpasses humans at \"most economically valuable work.\" The talks focus on Microsoft's equity stake, cloud exclusivity, and 20% revenue share as OpenAI aims to convert from nonprofit to for-profit status. The AI developer projects $4 billion in 2024 revenue.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft-OpenAI+Deal+Defines+AGI+as+%24100+Billion+Profit+Milestone%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F1613249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F1613249%2Fmicrosoft-openai-deal-defines-agi-as-100-billion-profit-milestone%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/26/1613249/microsoft-openai-deal-defines-agi-as-100-billion-profit-milestone?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561805&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The HackerNoon Newsletter: Do Honeypots Still Matter? (12/26/2024)","url":"https://hackernoon.com/12-26-2024-newsletter?source=rss","date":1735229103,"author":"Noonification","unread":true,"desc":"","content":"\n              \n        <p><strong>How are you, hacker?</strong></p>\n        <br />\n        <p>🪐 What’s happening in tech today, December 26, 2024?</p>\n        <br />\n        <p>\n          The\n          <a href=\"https://hackernoon.com/noonification\" target=\"_blank\" rel=\"noopener\"> HackerNoon Newsletter</a>\n          brings the HackerNoon \n          <a href=\"https://hackernoon.com\" target=\"_blank\" rel=\"noopener\">homepage</a>\n          straight to your inbox.\n          <a href=\"https://hackernoon.com/on-this-day\" target=\"_blank\" rel=\"noopener\">On this day,</a>\n          \n            <strong>George Washington Won First US Victory for the Continental Army</strong> in 1776,  <strong>Los Angeles Celebrated the First Kwanzaa</strong> in 1966,  <strong>FDR Officially Established the Modern Thanksgiving Holiday</strong> in 1941, \n          \n          and  we present you with these top quality stories. \n          \n            From \n        <a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\" class=\"eventTitle\"><strong>Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon</strong></a>\n       to \n        <a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\" class=\"eventTitle\"><strong>Ex-CEO Says Bitcoin Mining Could Have Been a Revenue Boom for the Pacific Island</strong></a>,\n       let’s dive right in.\n          \n        </p>\n      \n              \n          <h2><a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\">Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/5wpKgV75aONqkTJlafw2yQmK9yd2-ja0341z.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 2 Min read ] The R Systems BlogBook contest, powered by HackerNoon, is coming soon! Get ready to share your experiences and win exciting prizes—stay tuned for more details. <a href=\"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/do-honeypots-still-matter\">Do Honeypots Still Matter?</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/RHANbxrXjsYoxIMTyKJFleCFJyC3-2f0346v.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/salkimmich\">@salkimmich</a> [ 7 Min read ] In cybersecurity, honeypots are systems or environments designed to lure attackers. The roots of the honeypot idea go much deeper than digital security though. <a href=\"https://hackernoon.com/do-honeypots-still-matter\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\">Ex-CEO Says Bitcoin Mining Could Have Been a Revenue Boom for the Pacific Island</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/2jqChkrv03exBUgkLrDzIbfM99q2-ka02tj8.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/edwinliavaa\">@edwinliavaa</a> [ 3 Min read ] Former CEO says his company had the opportunity to invest in bitcoin mining but the proposal never came to the board. <a href=\"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/crypto-bull-run-attracts-new-developers-in-2024-report-from-electric-capital-finds\">Crypto Bull Run Attracts New Developers in 2024, Report From Electric Capital Finds </a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-cr035nf.jpeg\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/danielmcglynn\">@danielmcglynn</a> [ 5 Min read ] Developer activity is one of the most fundamental metrics for evaluating the future of blockchain or digital asset projects. <a href=\"https://hackernoon.com/crypto-bull-run-attracts-new-developers-in-2024-report-from-electric-capital-finds\">Read More.</a></p>\n        \n          <h2><a href=\"https://hackernoon.com/the-ai-chatbot-writing-contest-by-coze-and-hackernoon-results-announcement\">The #AI-chatbot Writing Contest by Coze  HackerNoon: Results Announcement 🎉</a></h2>\n          <p><img src=\"https://cdn.hackernoon.com/images/InxBRjRIs6M1kdhuWcyNHiiUrxm1-lm034i8.png\" alt /> </p>\n          <br />\n          <p>By <a href=\"https://hackernoon.com/u/hackernooncontests\">@hackernooncontests</a> [ 6 Min read ] Meet the finalists and winners of the #ai-chatbot writing contest presented by Coze and HackerNoon.  <a href=\"https://hackernoon.com/the-ai-chatbot-writing-contest-by-coze-and-hackernoon-results-announcement\">Read More.</a></p>\n        \n              \n        <br />\n        <p>🧑‍💻 What happened in your world this week?</p>\n        <p>\n          It's been said that\n          <a href=\"https://hackernoon.com/developers-the-why-and-how-to-writing-technical-articles-54e824789ef6\">writing can help consolidate technical knowledge</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\">establish credibility</a>,\n          <a href=\"https://hackernoon.com/how-can-non-writers-become-effective-bloggers-1pq32wd\"> and contribute to emerging community standards</a>.\n          Feeling stuck? We got you covered ⬇️⬇️⬇️\n        </p>\n        <br />\n        <p>\n          <a href=\"https://app.hackernoon.com/mobile/lZx3fmlPdlPJpVBIdble\">ANSWER THESE GREATEST INTERVIEW QUESTIONS OF ALL TIME</a>\n        </p>\n        <br />\n        <p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>\n        <br />\n        <p><img src=\"https://cdn.hackernoon.com/images/the-hackernoon-newsletter-footer.png\" alt /></p>\n      \n            ","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Coming Soon: R Systems BlogBook – Chapter 1, Powered by HackerNoon","url":"https://hackernoon.com/coming-soon-r-systems-blogbook-chapter-1-powered-by-hackernoon?source=rss","date":1735228823,"author":"HackerNoon Writing Contests Announcements","unread":true,"desc":"","content":"<p>Seasons greetings, folks! 🌲🥂🎉</p>\n<p>\\\n’Tis the season to be merry, and in that spirit, we’re thrilled to announce a unique partnership between R Systems and HackerNoon for a first-of-its-kind internal writing contest: <strong><em>R Systems BlogBook — Chapter 1.</em></strong></p>\n<p><img src=\"https://cdn.hackernoon.com/images/5wpKgV75aONqkTJlafw2yQmK9yd2-10634eo.gif.webp\" alt=\"\" /></p>\n<p>This contest is designed exclusively for R Systems staff to share your experiences, projects, and case studies, showcasing the hard work you've put in and how it contributes to R Systems' leadership in the digital transformation industry and its unique approach to software product engineering.</p>\n<h3 id=\"keycontestinfo\"><strong>Key Contest Info</strong></h3>\n<ul>\n<li><strong>Duration:</strong> 3 months,</li>\n<li><strong>Rounds:</strong> 3 (one per month)</li>\n<li><strong>Total Winners:</strong> 12 (4 winners per round)</li>\n<li><strong>Prizes:</strong></li>\n<li><strong>Grand Prize:</strong> Co-branded Laptop Sleeve</li>\n<li><strong>Top Participants:</strong> Co-branded Blogger Badge</li>\n</ul>\n<h3 id=\"conteststructure\"><strong>Contest Structure</strong></h3>\n<ul>\n<li>The contest kicks off in <strong>January 2025 (exact date TBA).</strong></li>\n<li>Each round will focus on two writing prompts, with one month for submissions.</li>\n<li>After each round, the editorial team will review ALL eligible submissions and select the top four stories. These will be featured on R Systems' blog and subsequently showcased on the company’s business page on HackerNoon.</li>\n</ul>\n<p>\\\n<strong>Participants are to use their projects and experience at R Systems to tackle one of two writing prompts each round, as follows:</strong></p>\n<h3 id=\"writingpromptsbyround\">Writing Prompts by Round</h3>\n<p><strong>Round 1</strong></p>\n<ul>\n<li>AI/ML Model Deployment with MLflow and Kubernetes</li>\n<li>Enhancing Developer Productivity with GitHub Copilot and Other AI Tools</li>\n</ul>\n<p>\\\n<strong>Round 2</strong></p>\n<ul>\n<li>Microservices Observability: Leveraging OpenTelemetry</li>\n<li>Implementing Zero Trust Security in Cloud-Native Environments</li>\n</ul>\n<p>\\\n<strong>Round 3</strong></p>\n<ul>\n<li><p>Exploring the Capabilities of WebAssembly for High-Performance Web Applications</p></li>\n<li><p>Integrating Generative AI into SaaS Applications: Best Practices and Use Cases</p>\n<p>\\</p></li>\n</ul>\n<p>Interested participants are encouraged to start brainstorming ideas and stay tuned for the official announcement with full details.</p>\n<p>:::tip\nBe the first to know when we share new updates by subscribing to the HackerNoon Contests Announcement Page [<strong><a href=\"https://hackernoon.com/u/hackernooncontests\">here</a></strong>].</p>\n<p>:::</p>\n<p>We can’t wait to read your work!</p>\n<p>\\\n\\\n\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Do Honeypots Still Matter?","url":"https://hackernoon.com/do-honeypots-still-matter?source=rss","date":1735228821,"author":"Sal Kimmich","unread":true,"desc":"","content":"<p>In 2023, I was reading the rather excellent technical book on <a href=\"https://link.springer.com/book/10.1007/978-3-031-16613-6\">Cyber Deception: Techniques, Strategies, and Human Aspects</a>, which turned suddenly into a nightmare in it’s final chapter: explaining that they had just encountered <em>significant</em> increase in bot-on-bot adversarial deception.</p>\n<p>\\\nThis was not a surprise in any way, but it made me reflect. Honeypots were designed traditionally as a form of protection from intelligent, human adversaries - specifically. I made a point to keep an eye on the change in defensive security as it grows to protect systems from intelligence with a computational cortex. To better understand this important cybersecurity practice, here is the history, foundational thinking, and the state of the art of what Honeypots look like today.</p>\n<p>\\\n<strong>Introduction: The Honey Trap Throughout History</strong></p>\n<p>\\\nThe concept of the honeypot, both as a literal object and a metaphor, has a long history rooted in deception. The term conjures imagery of sweet, irresistible bait, deliberately placed to attract and ensnare an adversarial actor. In cybersecurity, honeypots are systems or environments designed to lure attackers, offering them what appears to be valuable data or access. But the roots of the honeypot idea go much deeper than digital security.</p>\n<p>\\\nThe origins of deception as a defensive strategy are ancient. Military forces used decoys to mislead enemies, such as wooden fortifications or dummy armies meant to draw fire or resources away from real targets. Espionage also has its own version of the honeypot: operatives trained to seduce and compromise adversaries, baiting them into revealing secrets or making strategic errors.</p>\n<p>\\\nWhen computing entered the picture, the honeypot concept naturally transitioned into digital security. In 1989, Gene Spafford introduced active defence strategies that included deception, marking a turning point in how organisations thought about cybersecurity (<a href=\"https://arxiv.org/abs/2409.07194\">Cyber Deception: State of the Art, Trends, and Open Challenges</a>). By the 1990s, tools like Fred Cohen’s <a href=\"http://all.net/dtk/\">Deception Toolkit (DTK)</a> and the Honeynet Project formally brought the idea into practice. These early digital honeypots were static and straightforward, but they laid the groundwork for an entirely new approach to defence: luring attackers in to learn from their behavior, rather than merely keeping them out.</p>\n<p>\\\n<strong>Cyber Deception in the Digital Age</strong></p>\n<p>Today, honeypots are part of a broader strategy known as <a href=\"https://www.researchgate.net/publication/324117795_Cyber_Deception_Overview_and_the_Road_Ahead\">Cyber Deception (CYDEC)</a>. CYDEC uses deliberate misdirection to confuse attackers, increasing the cost of their operations while gathering valuable intelligence. Unlike firewalls or intrusion detection systems, which are designed to block or alert, honeypots serve as active tools for studying adversaries, learning their methods, and even deterring future attacks by introducing uncertainty into their efforts.</p>\n<p>\\\nModern honeypots align with CYDEC taxonomies, which categorise strategies across five layers: strategy (offensive or defensive), dimension (data, system, network), phase (prevention, detection, response), tactics (e.g., decoying), and techniques (e.g., honeypots, obfuscation). Honeypots excel as decoys, creating believable but fabricated environments that attackers cannot resist targeting, it’s really worth reviewing <a href=\"https://arxiv.org/abs/2409.07194\">Cyber Deception: State of the Art, Trends, and Open Challenges</a> to understand this.</p>\n<p>\\\n<strong>The Evolution of Honeypots</strong></p>\n<p>The static honeypots of the past were relatively simple—designed to mimic services like SSH or FTP servers, they recorded basic interactions to analyse what attackers were doing. These honeypots worked well for catching opportunistic hackers, but they struggled against more sophisticated adversaries. Modern honeypots, by contrast, are dynamic and intelligent, leveraging artificial intelligence and machine learning to engage with attackers in realistic, adaptive ways. Here are some of the most significant advancements:</p>\n<p>\\\n<strong>1. HoneyGPT: Bringing AI to the Frontline</strong> HoneyGPT represents a leap forward in honeypot technology. By integrating Large Language Models (LLMs) like ChatGPT, HoneyGPT can engage attackers in detailed, human-like interactions. Using structured prompt engineering, it sustains conversations, creating an illusion of authentic engagement. This approach helps defenders gather critical insights into attacker behavior, tactics, and objectives (<a href=\"https://arxiv.org/abs/2406.01882\">HoneyGPT</a>).</p>\n<p>\\\nThe brilliance of HoneyGPT lies in its ability to mimic real users or system administrators. For instance, an attacker probing a customer service chatbot may unwittingly interact with a honeypot, revealing phishing techniques or other exploits in the process. The intelligence gathered is invaluable for preempting similar attacks elsewhere. However, HoneyGPT is not without limitations—its effectiveness depends heavily on the quality of its prompts and its capacity to handle unstructured or unexpected inputs.</p>\n<p>\\\n<strong>2. LLM Honeypot: Proactive Cyber Defence</strong> The LLM Honeypot takes the concept of AI-driven honeypots further by fine-tuning pre-trained language models on datasets of known attacker behavior. This enables the honeypot to predict and adapt to adversarial tactics in real-time, shifting from reactive to proactive defence (<a href=\"https://arxiv.org/abs/2409.08234\">LLM Honeypot</a>).</p>\n<p>\\\nFor example, imagine a decoy administrative interface that not only responds to attacker queries but intelligently adjusts its behavior to prolong interaction and gather more data. While this approach has tremendous potential, it requires access to vast, high-quality datasets and substantial computational resources, making it less accessible to smaller organisations.</p>\n<p>\\\n<strong>3. HoneyDOC: Modular and Scalable Deception</strong> HoneyDOC introduces modularity to honeypot design, dividing it into Decoy, Captor, and Orchestrator components. This allows for tailored deployment in diverse environments, from enterprise networks to IoT systems (<a href=\"https://arxiv.org/abs/2402.06516\">HoneyDOC</a>).</p>\n<p>\\\nThis modularity is a game-changer, enabling organisations to build honeypots specific to their needs. For example, a healthcare provider could create a decoy electronic health record (EHR) system, while a manufacturing firm might mimic an IoT-enabled factory floor. However, deploying such systems in highly dynamic environments can pose integration and latency challenges.</p>\n<p>\\\n<strong>4. Industrial Honeypots: Protecting Critical Infrastructure</strong> Industrial honeypots focus on operational technology (OT), replicating environments like power grids, water treatment plants, and manufacturing systems. By mimicking complex industrial protocols, they provide a unique defence against adversaries targeting critical infrastructure. A notable example uses Long Short-Term Memory (LSTM) networks to emulate industrial processes in real time, creating convincing decoys for attackers (<a href=\"https://arxiv.org/abs/2410.21574\">Industrial Systems Honeypot</a>).</p>\n<p>\\\nThese honeypots address a critical need, as OT environments are often poorly secured and highly targeted. However, they require precise modeling of industrial systems to be effective, which can be a significant barrier.</p>\n<p>\\\n<strong>5. Blockchain and IoT Honeypots: Securing the Edge</strong> Emerging technologies like blockchain and IoT come with unique vulnerabilities. Honeypots designed for these environments leverage decentralised systems and smart contracts to deploy decoys dynamically across IoT networks. For instance, a fake blockchain node can attract attackers trying to exploit weaknesses in transaction validation (<a href=\"https://ieeexplore.ieee.org/document/10595866\">Blockchain IoT Honeypot</a>).</p>\n<p>\\\nWhile these systems are highly effective in addressing niche vulnerabilities, they can introduce computational overhead and may be less effective against adversaries familiar with blockchain and IoT environments.</p>\n<p>\\\n<strong>The Challenges Ahead</strong></p>\n<p>Despite their advancements, honeypots face significant challenges that are faced by all evolving AI systems:</p>\n<p>\\</p>\n<ul>\n<li><p><strong>Scalability</strong>: Creating and maintaining realistic decoys across large networks remains a technical hurdle.</p></li>\n<li><p><strong>AI Evolution</strong>: While AI-powered honeypots are promising, attackers are also using AI to identify and bypass decoys.</p></li>\n<li><p><strong>Dynamic Threats</strong>: As attackers become more sophisticated, honeypots must continually innovate to remain effective.</p>\n<p>\\</p></li>\n</ul>\n<p>Future research must address these challenges, particularly through automation and the integration of cutting-edge AI models. There are certainly more examples than those above, but I’m calling attention to those I want to call attention to, and leaving out those that are so good I don’t want adversarial actors to have a heads up. This is not a recreational architecture to stand up on your own personal architectures. <em>This article is for <a href=\"https://en.wikipedia.org/wiki/White_hat_(computer_security)\">White Hats</a>, exclusively.</em> There’s very good regulatory reasons for this:</p>\n<h4 id=\"thechallengesofdeployinghoneypots\"><strong>The Challenges of Deploying Honeypots</strong></h4>\n<p>While honeypots provide invaluable insights and defence capabilities, their deployment must be approached with caution to avoid legal, ethical, and operational pitfalls. By addressing these challenges through careful planning and legal consultation, organisations can deploy honeypots effectively while minimising risks:</p>\n<p>\\</p>\n<ul>\n<li><p><strong>Privacy Concerns</strong>: Honeypots often collect attacker data, including potentially identifiable information. In jurisdictions like the European Union, where IP addresses are classified as personal data under the General Data Protection Regulation (GDPR), this can create compliance risks. Organisations must ensure their honeypots are configured to handle data ethically and within legal frameworks. <em>Yes, even your adversarial attacker is probably GDPR protected (</em><a href=\"https://jis-eurasipjournals.springeropen.com/articles/10.1186/s13635-017-0057-4\">Honeypots and Honeynets: Issues of Privacy</a>).</p></li>\n<li><p><strong>Liability Risks</strong>: If a honeypot is compromised and used to launch attacks on other systems, the organisation deploying it could face liability for damages. Robust security measures must be in place to prevent such misuse (<a href=\"https://link.springer.com/chapter/10.1007/978-3-319-19419-6_9\">Deploying Honeypots and Honeynets: Issues of Liability</a>).</p></li>\n<li><p><strong>Entrapment Issues</strong>: While primarily a legal concern for law enforcement, the concept of entrapment—inducing someone to commit a crime they otherwise wouldn’t—is important to consider. Honeypots should passively observe and analyse attacker behavior rather than actively encouraging illegal actions (<a href=\"https://www.sans.org/white-papers/1746/\">CyberLaw 101: A primer on US laws related to honeypot deployments</a>).</p></li>\n<li><p><strong>Jurisdictional Challenges</strong>: Cyber activities often cross international borders, complicating enforcement and compliance. For example, data collected in one country may be subject to the privacy laws of another, creating legal grey areas (<a href=\"https://phys.org/news/2019-05-legal-ramifications-anti-hacker-honeypots.html\">Legal ramifications of anti-hacker honeypots</a>).</p>\n<p>\\</p></li>\n</ul>\n<p><strong>Conclusion: The Enduring Sweetness of Honeypots</strong></p>\n<p>Honeypots have transformed from simple traps into dynamic tools that play a critical role in modern cybersecurity. By integrating artificial intelligence, machine learning, and modular architectures, they remain indispensable in the fight against evolving cyber threats. Whether protecting critical infrastructure, defending IoT systems, or engaging adversaries in deceptive conversations, honeypots prove that the best defence often lies in strategic deception. As cybersecurity threats grow more sophisticated, the relevance of honeypots has only increased. Their ability to adapt, deceive, and gather intel will improve - as will the regulatory constraints of this evolving security practice, with ancient historical roots.</p>\n<p>\\\nAbsolutely yes, honeypots not only matter in the modern digital world — they are now <strong><em>sweeter than ever</em></strong>.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/RHANbxrXjsYoxIMTyKJFleCFJyC3-1d034cd.jpeg\" alt=\"Pyramid Honey: https://xkcd.com/1717/\" /></p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Unpacking The Starknet Bolt Upgrade","url":"https://hackernoon.com/unpacking-the-starknet-bolt-upgrade?source=rss","date":1735228818,"author":"2077 Research","unread":true,"desc":"","content":"<p>\\\nStarknet’s latest upgrade (v0.13.2) named <strong>Bolt</strong> brings two major changes: <strong>parallel execution</strong> and <strong>block-packing</strong>. Although independent of one another, both features support the push towards the goal of fast, cheap blockspace cryptographically secured by Ethereum.</p>\n<p>\\\nParallel execution allows non-contentious transactions (i.e., transactions that don’t touch the same state) to execute concurrently. By implementing parallel execution, L2s like Starknet can reduce execution time without increasing resource usage. This means lower transaction fees for users and significantly improved transaction confirmation times.</p>\n<p>\\\nBlock packing optimizes Starknet’s usage of blobspace on Ethereum L1: with block packing, sequencers can generate one proof to verify multiple Starknet L2 blocks simultaneously. This decouples usage of blobspace from the frequency of L2 block production and amortizes proof verification costs. Both reduce operating costs for the Starknet sequencer, which means users pay less per transaction.</p>\n<p>\\\nLike we said, Bolt makes Starknet cheaper and faster! This report will provide a detailed analysis of the Bolt upgrade–focusing on parallel execution and block packing–and explore the implications for Starknet’s performance.</p>\n<h2 id=\"aquickrefresheronrollups\">A quick refresher on rollups</h2>\n<p>Rollups are <a href=\"https://research.2077.xyz/the-practical-guide-to-ethereum-rollups\">layer two (L2) scaling solutions</a> that aim to scale the underlying layer one (L1) blockchain by moving computation off-chain. By moving execution off-chain, rollups can optimize for scalability (cheap and fast transactions), while the L1 provides security for L2 transactions.</p>\n<p>\\\nRollups are often said to “inherit security from the L1”. What this essentially means is that they inherit the consensus and data availability guarantees provided by the L1. In addition to this, the L1 also provides a security guarantee in the form of secure bridging between it and the rollup.</p>\n<p>\\\nWhen sequencers publish L2 blocks to the L1, the L1 provides guarantees of the availability as well as the ordering of this information. From here, L2 nodes can trustlessly compute the canonical L2 chain with this information along with the rollup’s rules around chain derivation and state transition described by the node implementation.</p>\n<p>\\\nIn order to facilitate secure bridging between the L1 and the L2, the L1 requires proof that the L2 chain it is currently following is correct and does not include illegal state changes (e.g. double spend). This need for rollups to prove the validity of state changes, ensures the L1 does not authorize withdrawals from the rollup based on illegal state.</p>\n<p>\\\nRollups differ based on how they prove validity of state changes to the L1:</p>\n<ul>\n<li>Validity rollups rely on <strong>validity proofs</strong> to objectively verify correctness of execution. Proposers are allowed to propose a new rollup state if they submit a validity proof to the rollup contract.</li>\n<li>Optimistic rollups rely on the absence of a <strong>fraud proof</strong> to subjectively verify correctness of execution. Proposers submit state updates without proofs, but the rollup contract can roll back any state update whose validity is successfully challenged by a fraud proof.</li>\n</ul>\n<p>\\\nRollups also provide the base layer with enough data for interested parties to reconstruct the L2 state. While optimistic rollups must publish full transaction data to enable challengers to compute fraud proofs, validity rollups have no such requirements (validity proofs guarantee correct execution). But posting full transaction data on L1 is still useful from a trust-minimization perspective (trustless reconstruction of state and permissionless withdrawals).</p>\n<p>\\\nStarknet is a validity rollup that uses <strong>S</strong>calable, <strong>T</strong>ransparent <strong>AR</strong>gument of <strong>K</strong>nowledge (STARKs) to prove the validity of state changes. The latest upgrade to Starknet–codenamed Bolt–adds parallel execution and block packing. In subsequent sections, we’ll explain how the two features work and what improvements they bring for Starknet users.</p>\n<h2 id=\"whatdidthestarknetboltupgradechange\">What did the Starknet Bolt upgrade change?</h2>\n<p>At a high level, the Bolt upgrade changed Starknet’s execution, proving and <a href=\"https://research.2077.xyz/data-availability-or-how-rollups-learned-to-stop-worrying-and-love-ethereum\">data availability</a> mechanisms.</p>\n<h3 id=\"optimizingexecution\">Optimizing execution</h3>\n<p>Before the Bolt upgrade, Starknet transactions were executed sequentially—one after the other–by the sequencer. Sequential execution is simple but also very inefficient. It’s inefficient because it does not take advantage of the multiple independent processing units that modern day computers offer and the parallelizability of a set of transactions.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.458Z-xvu6exe7ir9ty5yth0rx9dac\" alt=\"Sequential Execution\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.508Z-fr9t0x0ba0lysizcduhbhyn4\" alt=\"Parallel execution\" /></p>\n<p>Parallelizability is a measure of how independent the transactions in a given set are. For example, consider the set of three transactions below:</p>\n<ul>\n<li><p>Transaction 1: Alice wants to send Bob 1 STRK</p></li>\n<li><p>Transaction 2: Caitlyn wants to send Danny 100 ETH</p></li>\n<li><p>Transaction 3: Caitlyn wants to send Ella 100 ETH</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.510Z-lhg1p6y9mm4o6mod2ookg7rx\" alt=\"\" /></p></li>\n</ul>\n<p>Transaction 1 is completely independent of transactions 2 and 3–because it is accessing a different part of the state (Alice’s balance)–and can be executed concurrently. However, transaction 2 and 3 are conflicting because they want to access the same state—Caitlyn’s ETH balance. These transactions can not be executed concurrently or we’ll end up with conflicting results.</p>\n<p>\\\nTo illustrate:</p>\n<ul>\n<li>Say Caitlyn’s balance is 300 ETH and transactions 2 and 3 start at the same time. Both transactions will read the initial balance of Caitlyn’s account as 300 ETH, deduct the transfer amount from it (300 - 100 = 200), and write 200 ETH to the location in memory where Caitlyn’s account balance is stored.</li>\n<li>Transactions 2 and 3 will then read Danny and Ella’s balances respectively and add 100 ETH to both users’ balances. Caitlyn’s balance would reduce by 100 ETH, but 200 ETH would be credited–effectively printing 100 ETH out of thin air.</li>\n</ul>\n<p>\\\nAvoiding these types of conflicts (and the complex nature of mitigation mechanisms) is why Ethereum chose sequential execution. However, while sequential execution reduces complexity and improves security, it results in inefficient use of hardware. Worse still, the trend of hardware design suggests sequential execution will become increasingly inefficient in the coming years.</p>\n<p>\\\nFigure 4 shows the trend of hardware design in the last 50 years. The relevant takeaway? Single-thread performance (purple circles) has been plateauing since the mid 2000s while the number of logical cores has increased around the same time. We can make two conclusions based on this data:</p>\n<ul>\n<li><p>Hardware designers are scaling computer chips by adding more independent processing units rather than improving the performance of a single unit.</p></li>\n<li><p>Any system that continues to rely on increased performance of a single processing unit will experience a stall in performance gains even on newer hardware.</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.512Z-gqlbm9k7jp7zr7gggghp3inm\" alt=\"Figure 4: Microprocessor trends\" /></p></li>\n</ul>\n<p>\\\nIn recent years, sophisticated algorithms for managing transaction conflicts and ensuring correctness of parallel execution have appeared. Block-STM (based on a paper by Fikunmi et al*) is one such algorithm and forms the core part of Starknet’s new parallel execution engine.&nbsp; We analyze the Block-STM algorithm in later sections.</p>\n<h3 id=\"optimizingprovinganddataavailability\"><strong>Optimizing proving and data availability</strong></h3>\n<p>Starknet’s SHARP (short for Shared Prover) has always taken advantage of recursive proofs to reduce verification costs as much as possible. A recursive proof is essentially a “proof of proof” where one proof verifies that one or more proofs are correct. Below is a sketch of how SHARP generates a recursive proof:</p>\n<ul>\n<li><p>The SHARP system takes a set of programs to be executed (a “job”) as input and generates a proof of execution for the job. These “programs” are L2 blocks and the proof attests to correctness of transactions.</p></li>\n<li><p>The proof is sent to another program that verifies the proof and converts the proof verification program into a job. SHARP takes the new job as input and generates another proof (this proof confirms the validity of the previous proof).</p></li>\n<li><p>The process (proof → job → proof) restarts and continues until a target is reached at which point the final proof (which is now a highly compressed version of the original proof) is posted to the L1</p>\n<p>\\</p>\n<p><img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.671Z-eo0qw1nvie0bora3tavdenvd\" alt=\"Figure 5: Recursive proof generation\" /></p></li>\n</ul>\n<p>\\\nThis design greatly amortizes costs for two major reasons:</p>\n<ul>\n<li>The subsequent jobs* are not individual programs or transactions and proving costs grow sub-linearly. This means the larger the number of programs/transactions within a job, the greater the savings. By creating proofs per block instead of per transaction, transaction fees can be much cheaper.</li>\n<li>Recursion greatly compresses the proofs resulting in a “proof of proof” that is significantly cheaper to verify on the L1 than the initial proof or any of the intermediate proofs.</li>\n</ul>\n<p>\\\nWhile the proving system was good, there were missed chances to further save costs. For example, each job was a single Starknet block and each of these blocks were designed to take up one blob on the L1. This resulted in certain inefficiencies as described below:</p>\n<ul>\n<li>Prior to Bolt, Starknet did (and still does) not have regular blocktimes; instead an L2 block was published to the L1 under two conditions: (1) One blob’s worth of data was executed (2) Six minutes had elapsed from the previous block. Unfortunately, due to demand, most of the blocks were sent to the L1 because of the six minute limit (not DA limits).</li>\n<li>The above meant that blobs (not blocks) were often (severely) underutilized, resulting in unnecessarily high gas costs. Starknet blocks also had a <a href=\"https://community.starknet.io/t/upcoming-feature-starknet-applicative-recursion/113868#:~:text=Present%20and%20future-,Present,-We%20start%20off\">fixed cost</a>, which could theoretically be reduced by applying the same recursion techniques discussed above to produce proofs of multiple blocks.</li>\n</ul>\n<p>\\\nBlock packing tackles these problems by using a binary tree of recursive proofs. We discuss block packing in a later section of the article.</p>\n<h2 id=\"boltpart1parallelexecution\">Bolt Part 1: Parallel Execution</h2>\n<p>As discussed earlier, sequential execution is inefficient (and will only be more inefficient as time goes on) and naive parallel execution produces invalid results. Production parallel execution engines take care to prevent inconsistent results, however.</p>\n<p>\\\nThere are two approaches to tackling parallel execution: <strong>Pessimistic Concurrency Control (PCC)</strong> and <strong>Optimistic Concurrency Control (OCC)</strong>. PCC and OCC are transaction processing units (TPUs). Below is a definition of a transaction processing unit from <strong><a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">Block-STM vs. SVM: A Comparison of Parallel Execution Engines:</a></strong></p>\n<p>\\</p>\n<blockquote>\n  <p>The TPU is usually coupled with, but distinct from the Virtual Machine (VM). Blockchain VMs like the EVM, SVM, and MoveVM are high-level language VMs…The TPU, which is usually the subject of interest, subsumes the VM. It is tasked with the management of the entire transaction execution pipeline, including creating and managing instances of the VM.</p>\n</blockquote>\n<p>\\\nPessimistic concurrency control is designed based on the assumption that many of the transactions within the set of transactions to be executed will conflict, i.e., they will touch the same state. PCC&nbsp; <strong>prevents</strong> these conflicts.</p>\n<p>\\\nTo prevent conflicts, PCC requires that a transaction declare upfront what portions of state it will access during read/write operations. The transaction processing unit can use this information to schedule transactions in a way that ensures that conflicting transactions are executed sequentially (instead of concurrently). Some TPUs also use locks to enforce this behavior (a lock (a.k.a., mutex) is a mechanism used to prevent concurrent access to a memory location).</p>\n<p>\\\nThat said, PCC-based execution incurs certain tradeoffs. First, the requirement to provide access lists (which identify the memory slot a transaction touches) degrades the developer experience and reduces the range of possible applications. Second, scheduling transactions can incur unnecessary overhead–especially when there are no conflicts.</p>\n<p>\\\nOptimistic concurrency control is designed with the assumption that many of the transactions within the given set will not conflict, i.e. they will not write to the same state. As such, OCC TPUs execute the set of transactions with all the available resources and only try to <strong>detect</strong> conflicts. If a conflict is <strong>detected</strong> the transactions that conflict are executed and reverified until the entire set passes and can be committed.</p>\n<p>\\\nOCC TPUs don’t incur overhead from scheduling, so they tend to perform better when there are few conflicts. OCC-based transaction processing units also have better developer experience and a wider range of use cases because state dependencies don’t need to be known upfront.</p>\n<p>\\\nHowever, when the set of transactions are highly contentious, OCC performs worse than PCC. We cover TPU designs (in far more detail) and compare the OCC and PCC approaches in <a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">our article</a> on parallel execution.</p>\n<p>\\\nStarknet’s new TPU uses the OCC approach. More specifically, it is an implementation of the Block-STM algorithm. Block-STM executes transactions optimistically with all the available resources assuming none of them will conflict and verifies after execution that no conflicting transactions executed concurrently. Before we dive into Starknet’s new architecture, it’s important to go over some key definitions:</p>\n<ol>\n<li><strong>State</strong>: State is the condition of an object at an instance in time. In the blockchain context it usually refers to the value of a portion of memory, e.g., the balance of an address is (part of) its state.</li>\n<li><strong>Serializability</strong>: Parallel execution is said to have preserved the property of serializability if executing a set of transactions serially and concurrently produces the same results.</li>\n<li><strong>Conflict</strong>: Two transactions are said to conflict if and only if at least one of them wants to write to a portion of state that both want to access (can be read or write). If both transactions are only reading from a portion of state, then there’s no conflict but if at least one of them is writing to that portion of state, then the transactions can not be executed concurrently without breaking serializability. We covered a sample case above in the Caitlyn, Danny and Ella example.</li>\n<li><strong>Dependency</strong>: A transaction <code>txj</code> is said to be dependent on (or a dependency of) a transaction <code>txi</code> if and only if both transactions write to the same memory location and <code>txj</code> comes after <code>txi</code> in the serial ordering. If <code>txi</code> came after <code>txj</code>, <code>txi</code> would be dependent on <code>txj</code>.</li>\n<li><strong>Multi-version data structure</strong>: A multi-version data structure is one where a new version of the data structure is created for each write to the data structure. Instead of changing the value in place, a new write-specific version of the location to be changed is created. The value prop of multi-version data structures is that they allow highly concurrent reads from and writes to the same region in memory. We’ll explore how this is useful later.</li>\n</ol>\n<p>With the definitions out of the way we can move on to cover how Block-STM works.</p>\n<h2 id=\"howblockstmworks\">How Block-STM works</h2>\n<p>The input to Block-STM is a queue (an ordered list) of transactions, this list is often called a BLOCK. This list can be ordered in any manner; the only requirement is that there is a clearly defined order. So given a set of transactions T containing transactions <code>{t0…tn}</code>, the transactions are sorted such that <code>{t0 &gt; t1 &gt; t2 … &gt; tn}</code> (read as <code>t0</code> is of higher priority than <code>t1</code>,&nbsp; <code>t1</code> is of higher priority than <code>t2</code> etc.)</p>\n<p>\\\nAt the beginning of the execution process, two sets are created—an execution set E, and a validation set V. E tracks transactions that are yet to be executed while V tracks transactions that have been executed but are yet to be validated. Each transaction is also associated with an incarnation number n to track how many times it has been executed (and re-executed). The initial state of the sets is that E contains all the transactions and V is empty, i.e., <code>E = {t0,1 &gt; t1,1 &gt; t2,1 &gt; … &gt; tn,1}</code> and <code>V = {}</code>.</p>\n<p>\\\nWith these ordered sets of transactions, each thread used for execution cycles through a three stage loop:</p>\n<ol>\n<li>Check Done</li>\n<li>Find Next Task</li>\n<li>Perform Task</li>\n</ol>\n<h3 id=\"checkdone\">Check Done</h3>\n<p>During this step, the thread checks both V and E. If both are empty and no transaction is being executed then the current batch of transactions has been executed completely and the results can be committed to storage.</p>\n<h3 id=\"findnexttask\">Find Next task</h3>\n<p>If either V or E contains transactions, Block-STM selects the transaction with the lowest index (not incarnation number) from both set of transactions, i.e., if E contains <code>{t1,3 , t3,1 and t5,2}</code> and V contains <code>{t0,1, t2,4, t4,3}</code>, the validation task for transaction <code>t0</code> would be selected as the next task.</p>\n<h3 id=\"performtask\">Perform Task</h3>\n<p>Once the next task has been identified and selected, it is performed. At the end of this step, the algorithm loops back to Check Done. This process continues until both sets of transactions are empty.</p>\n<p>\\\nLet’s look at what happens during execution and validation:</p>\n<p>\\\nDuring execution of a transaction, the Block-STM algorithm populates two sets (per transaction); a read set (<code>Ri,n</code>) and a write set (<code>Wn,i</code>). The read set contains all the memory locations that a transaction read from during its execution while the write set contains all the memory locations it wrote to. During execution, the transactions apply their writes to the multi-version data structure, but reading is a little nuanced.</p>\n<p>\\\nIn Block-STM when a transaction wants to read from the data structure, it checks for the value written by the lowest priority transaction that has higher priority. For example if <code>tx1</code>, <code>tx2</code>, and <code>tx7</code> have all written to a memory location and <code>tx5</code> wants to read from this location, it reads the version of the data structure corresponding to <code>tx2</code>.</p>\n<p>\\\nThis is done to enforce serializability; since <code>tx5</code> should be executed after <code>tx2</code> and before <code>tx7</code>, it should use the values written by <code>tx2</code> not <code>tx7</code>. In this example, <code>tx7</code> will have to be re-executed because it should have read the values written by <code>tx5</code>, not <code>tx2</code> or any higher priority transactions. If a single-version data structure was used, the value written by <code>tx2</code> would be unavailable and a conflict is sure to occur.</p>\n<p>\\\nFor a validation task, the transaction’s read set is compared to the current values at the memory locations it read from during execution. For example, if <code>tx2</code> reads account B during execution, during validation, the memory location for account B is read (keeping the definition of read we established earlier in mind). If the two values are the same then it means that no higher priority transaction (say <code>tx0</code> or <code>tx1</code>) has written to that location during the execution of <code>tx2</code>. This results in <code>tx2</code> marked as validated but not safe to commit.</p>\n<p>\\\nThe transaction is not considered safe to commit because a lower priority transaction could, for any number of reasons, be executed after the transaction had been validated. In our running example if <code>tx1</code> touches account B and only touches it after, <code>tx2</code> passes validation then <code>tx2</code> needs to be re-executed.</p>\n<p>\\\nTo provision for this, anytime a transaction completes execution all lower priority transactions&nbsp; that had passed validation are revalidated to ensure they do not conflict with the transaction. For example, if <code>tx1</code>, <code>tx3</code> and <code>tx4</code> have been validated and <code>tx2</code> completes execution, <code>tx3</code> and <code>tx4</code> must be revalidated to ensure that they do not conflict with (and so are dependencies of) <code>tx2</code>.</p>\n<p>\\\nIf a transaction fails validation, i.e., a higher priority transaction that writes to the same state was executed concurrently with it, then the writes that the transaction made are dirty (because the values are wrong.) But instead of deleting these values from the database completely, they are flagged ESTIMATE.</p>\n<p>\\\nThe ESTIMATE flag tells any transaction reading that memory location that the values there are not correct and the transactions pause their execution. This is done in place of deletion because re-execution of the transaction that failed validation would likely result in writing to the same memory locations as the previous execution.</p>\n<p>\\\nBy marking the memory location as an estimate instead of deleting it, dependencies (of the transaction that failed validation) can be caught even before re-execution, preventing unnecessary re-executions. This heuristic greatly reduces wasted work.</p>\n<h3 id=\"puttingitalltogether\">Putting it all together</h3>\n<p>A complete overview of how Block-STM approaches parallelization can be summarized as:</p>\n<ul>\n<li>A <code>BLOCK</code> of transactions start out as an ordered list with a clearly defined serial order. These transactions are executed on all the available resources in priority order.</li>\n<li>During execution, the read and write sets of the transactions are tracked and reads and writes are performed from/to a multi-version data structure. When a transaction finishes execution, it is validated to ensure that it did not execute concurrently with any conflicting transactions.</li>\n<li>If a transaction passes validation, then it is removed from E and V. And when a transaction is validated, all transactions lower in priority than it that had passed validation are rescheduled for validation.</li>\n<li>If a transaction fails validation then it is rescheduled for execution. When the entire set of transactions have been executed and validated then the entire BLOCK is safe to commit and the results can be written to permanent storage.</li>\n</ul>\n<p>\\\nAn example is shown below:</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.479Z-jfw70yz60xrnm42dn9on5178\" alt=\"Figure 6: Block-STM example\" /></p>\n<p>\\\nThat is an overview of how Block-STM works, more details can be found in our report <a href=\"https://research.2077.xyz/block-stm_vs_sealevel\">here</a> and the original Block-STM paper <a href=\"https://arxiv.org/abs/2203.06871\">here</a>.</p>\n<h3 id=\"howdoesblockstmimprovestarknetperformance\">How does Block-STM improve Starknet performance?</h3>\n<p>To quantify the significance of adding Block-STM, we performed a few benchmarks to evaluate the performance improvements it provides over sequential execution and the results are shown below.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.457Z-frrc7x2wlax56vqbfpwz9v0n\" alt=\"Figure 7: Block-STM performance at 1k blocksize\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.400Z-t5gfjgvk2kz033f8xymxeisa\" alt=\"Figure 8: Block-STM performance at 10k blocksize\" /></p>\n<p>\\\nThe results show that as the number of threads (analogous to independent processing units) used increases, performance also increases. The improvements are more pronounced with larger blocks giving as high as 9X performance improvements over sequential execution with just 16 threads. We found that the results are more pronounced with larger blocks.</p>\n<p>\\\nOur tests show that Block-STM performance does significantly degrade under highly contentious load but industry-standard practice is to fall back to sequential execution during such periods. We recommend the same mechanic to Starknet to preserve throughput under highly contentious workloads. But, by and large, the addition of Block-STM will significantly improve and futureproof Starknet.</p>\n<p>\\\nThe second major change bundled in the v0.13.2 upgrade is block packing and we’ll cover that next.</p>\n<h2 id=\"boltpart2blockpacking\">Bolt Part 2: Block Packing</h2>\n<p>As discussed earlier, prior to Bolt, each Starknet block was its own job resulting in a fixed per-block cost for every block. In addition, the system was designed such that each block required its own blob regardless of how much data was actually consumed by the block.</p>\n<p>\\\nIn a world where there was always high demand, this wouldn’t be a problem, but Starknet currently offers more blockspace than there is demand for and so there are a lot of wasted resources that could result in <a href=\"https://community.starknet.io/t/starknet-costs-and-fees/113853\">hundreds of ETH lost</a> over the course of a month. To further put into context the severity of the situation before Bolt, these are the costs associated with posting a block to L1:</p>\n<p>\\</p>\n<ol>\n<li>23K gas per fact registration – part of <a href=\"https://etherscan.io/tx/0x16731babd1ba57874ff4b6554aab379785d986b2aa6b4513d68fd19673bb441a\">Verify Proof and Register</a></li>\n<li>56K gas per <a href=\"https://etherscan.io/tx/0xd808cb7fa32e1a3a241f91e07587339d526d4c47eae8902075f02cabde4f7efc\">register SHARP memory page</a></li>\n<li>136K gas per <a href=\"https://etherscan.io/tx/0x08ce859bc5d0eb7a5c159d50428841e88878691e378704aa636a968b2a7a3ee8\">State Update</a></li>\n<li>50K gas for the KZG precompile to sample a blob,</li>\n<li>86K gas for running the state update function.</li>\n</ol>\n<p>\\\nThis totals out to 215k gas per block and this cost is flat, i.e., it’s the same regardless of how much data each block contains and related to the number of blocks by $Cost = num blocks * 215000$. The ideal solution to this problem would be for costs to be related to the amount of data posted instead of the amount of blocks. And that’s exactly what block packing achieves via SNAR trees.</p>\n<h3 id=\"snartries\">SNAR Tries</h3>\n<p>Starknet Applicative Recursive (SNAR) trees are a new type of binary tree introduced in Bolt to address the problems highlighted above. A SNAR Tree has the following structure: each leaf is a Starknet block and the nodes in all other levels are recursive proofs of their children. The root node which is a recursive proof of all other proofs is the final job that is sent to the SHARed Prover (SHARP).</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.256Z-kf8xoqfmknwm9x9yk28y39lq\" alt=\"Figure 9: SNAR Tree\" /></p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.244Z-wu0n0wm0kp61epo00broz5zg\" alt=\"Figure 10: SNAR Tree in Block packing workflow\" /></p>\n<h3 id=\"whatdoesthesnartreedo\">What does the SNAR Tree do?</h3>\n<p>The primary benefit of the SNAR Tree is that rather than posting one block per proof, many Starknet blocks can be amortized into the same L1 update. SNAR tree roots are now posted to the L1 only when one of two configurable limits is hit: either the DA limit (6 blobs worth of data) or after a certain number of leaves are added to the tree (where a leaf is a block).</p>\n<p>\\\nThis design decouples the cost for transactions from the number of blocks. Now, there is still some fixed cost for each block that arises from running the StarkNet OS (SNOS) in every block–but by and large the costs are decoupled. These are the numbers now:</p>\n<p>\\</p>\n<ol>\n<li>SHARP memory registration per-job: 23K gas, (same as before)</li>\n<li>SHARP memory page per-job: 36K gas (reduced from 56K thanks to SHARP optimization),</li>\n<li>State update per-job equal to:</li>\n<li>86K gas (same as before) +</li>\n<li>50K gas × number of blob used. (When one blob was used per block this was 50K x 1 resulting in the 136K gas number quoted above).</li>\n</ol>\n<p>\\\nThe plot in Figure 11 below shows how gas costs vary with block number in the previous design and now (under Bolt):</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:16.071Z-rj1wxee4ltguxaz5thwmsl71\" alt=\"Figure 11: Verification Costs with an without block-packing\" /></p>\n<p>\\\nIt’s fairly obvious that block packing greatly reduces the costs of verification on the L1 which will undoubtedly result in lower gas prices for Starknet users.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The effect of the changes made in Bolt: optimistic parallel execution via Block-STM and block-packing through the proprietary SNAR can be summarized as: faster and cheaper.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/WSQJfCSXOxWphTNQ7sneVvhdWGu1-2024-12-26T16:00:15.870Z-c5eu1mngosjxt9cn24n3mz8u\" alt=\"\" /></p>\n<p>Parallel execution reduces execution time and by extension congestion which will reduce gas fees during periods of high traffic, while SNAR trees tackle the associated DA and proving costs. Interestingly, this upgrade makes Starknet the first L2 with parallel execution and sets it up to be a major contender in the L2 space. It’s important to note that it’s unlikely that the effect of these changes will be immediately evident, especially that of parallel execution, but they are crucial to future-proofing Starknet and the entire Ethereum ecosystem as a whole.</p>\n<p>\\\n<strong><em>Author’s note: A version of this article was previously published <a href=\"https://research.2077.xyz/unpacking-the-starknet-bolt-upgrade\">here</a>.</em></strong></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Overcoming Multilingual and Multi-Task Challenges in NLP","url":"https://hackernoon.com/overcoming-multilingual-and-multi-task-challenges-in-nlp?source=rss","date":1735228812,"author":"Text Mining","unread":true,"desc":"","content":"<h2 id=\"tableoflinks\">Table of Links</h2>\n<ol>\n<li><p><strong><a href=\"http://hackernoon.com/preview/Atw2lXsJWRm7osebJVC4\">Abstract and Introduction</a></strong> </p></li>\n<li><p><strong>Domain and Task</strong></p>\n<p><a href=\"http://hackernoon.com/preview/gvqItA7L7XcwOscgpVRv\">2.1. Data sources and complexity</a></p>\n<p><a href=\"https://hackernoon.com/preview/R1BMUbJynlWisxzqtyvL\">2.2. Task definition</a></p></li>\n<li><p><strong>Related Work</strong></p>\n<p><a href=\"http://hackernoon.com/preview/ggE1hh1mjlcaq5MrutFn\">3.1. Text mining and NLP research overview</a></p>\n<p><a href=\"http://hackernoon.com/preview/AUv9CZr7tGRr5elsMN8X\">3.2. Text mining and NLP in industry use</a></p>\n<p><a href=\"https://hackernoon.com/preview/dUdr6501Qkznn9WsBzBp\">3.3. Text mining and NLP for procurement</a></p>\n<p><a href=\"https://hackernoon.com/preview/LKqNcddfhrU7dFsV3hGt\">3.4. Conclusion from literature review</a> </p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/dzaiPOIeeNWOvy7pyVxH\">Proposed Methodology</a></strong></p>\n<p><a href=\"https://hackernoon.com/preview/8kr4hXfHGdIN8ZOjWGAz\">4.1. Domain knowledge</a></p>\n<p><a href=\"http://hackernoon.com/preview/syVznwufC8PMzC9oWyUI\">4.2. Content extraction</a> </p>\n<p><a href=\"http://hackernoon.com/preview/2ZaedkHF3BhVfCWWSMCO\">4.3. Lot zoning</a></p>\n<p><a href=\"http://hackernoon.com/preview/5fA4qLCUPOoYXYNDBUHP\">4.4. Lot item detection</a></p>\n<p><a href=\"http://hackernoon.com/preview/WTGOpAVi074ru4w0lxAR\">4.5. Lot parsing</a></p>\n<p><a href=\"https://hackernoon.com/preview/g0BnpjBuopJ7MTBFP9qe\">4.6. XML parsing, data joining, and risk indices development</a> </p></li>\n<li><p><strong>Experiment and Demonstration</strong></p>\n<p><a href=\"http://hackernoon.com/preview/LwyoC4qwOoLoAKnK8LYb\">5.1. Component evaluation</a></p>\n<p><a href=\"http://hackernoon.com/preview/YBbAig8izEdZZL5u7eQZ\">5.2. System demonstration</a></p></li>\n<li><p><strong>Discussion</strong></p>\n<p><a href=\"http://hackernoon.com/preview/6EjxR7lfbBmYk49dtvD8\">6.1. The ‘industry’ focus of the project</a></p>\n<p><a href=\"http://hackernoon.com/preview/7FFoTAXtjIQbEDUh4Q8g\">6.2. Data heterogeneity, multilingual and multi-task nature</a></p>\n<p><a href=\"http://hackernoon.com/preview/FkIne96ouCUZSuPDk6Ld\">6.3. The dilemma of algorithmic choices</a></p>\n<p><a href=\"http://hackernoon.com/preview/IkjSfkHYJzl3W6iiRM7W\">6.4. The cost of training data</a></p></li>\n<li><p><strong><a href=\"http://hackernoon.com/preview/4e5ESlbIi35CTBb8s7c8\">Conclusion, Acknowledgements, and References</a></strong></p></li>\n</ol>\n<h2 id=\"62dataheterogeneitymultilingualandmultitasknature\">6.2. Data heterogeneity, multilingual and multi-task nature</h2>\n<p>As already mentioned many times, compared to research as well as other industry text mining and NLP practices reported in the literature, the data we dealt with are multilingual and heterogeneous such that the goal of the project cannot be achieved by a single type of method, but relates to multiple subfields of text mining and NLP research. While there may be well-established solutions in each of these subfields, as discussed before, the difference in the raw data analysed, the multilingual nature and the lack of training data in our project makes adopting these methods very difficult and time-consuming. Considering the wider principle mentioned above, another lesson we learned is that given such a high level of complexity in our tasks, it is imperative to develop ‘lightweight’ methods that are easy to maintain, or ‘generalised’solutions that could apply to multiple tasks, or both.</p>\n<p>\\\nOn reflection, we opted for treating many tasks as text classification, using a feature representation scheme that is arguably language independent, and applies to, or can be easily adapted to, all of the tasks. Specifically, two components of our pipeline (lot zoning and lot item detection) deal with text classification at different granularity and therefore, the machine learning algorithms can be easily reused across. The feature representations are derived with reference to domain lexicons, which can be more easily and affordably translated into multiple languages - particularly considering the massive amount of multilingual documents we have to analyse, and the fact that only a fraction of them contain really useful content for analysis. Another added benefit of our approach is that it enables domain experts and the system administrators to update the trained models by simply revising the domain lexicons during re-training. To the best of our knowledge, there is no prior literature that describes in detail a holistic text mining or NLP process composed of multiple sub-tasks, or develops generalisable solutions like ours. Therefore, our work sets an important reference for future industry projects dealing with complex tasks.</p>\n<p>\\</p>\n<p>:::info\n<strong>Authors:</strong></p>\n<p>(1) Ziqi Zhang*, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Ziqi.Zhang@sheffield.ac.uk);</p>\n<p>(2) Tomas Jasaitis, Vamstar Ltd., London (Tomas.Jasaitis@vamstar.io);</p>\n<p>(3) Richard Freeman, Vamstar Ltd., London (Richard.Freeman@vamstar.io);</p>\n<p>(4) Rowida Alfrjani, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Rowida.Alfrjani@sheffield.ac.uk);</p>\n<p>(5) Adam Funk, Information School, the University of Sheffield, Regent Court, Sheffield, UKS1 4DP (Adam.Funk@sheffield.ac.uk).</p>\n<p>:::</p>\n<hr />\n<p>:::info\nThis paper is <strong><a href=\"https://arxiv.org/abs/2301.03458\">available on arxiv</a></strong> under CC BY 4.0 license.</p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ex-CEO Ranks the One Skill That Helped Him Navigate His Life","url":"https://hackernoon.com/ex-ceo-ranks-the-one-skill-that-helped-him-navigate-his-life?source=rss","date":1735228536,"author":"Edwin Liava'a","unread":true,"desc":"","content":"<p>As I sit here anticipating Christmas Eve, wrapping up two project proposals that consumed my entire weekend responding to comments from an evaluator, I've reached an unexpected moment of clarity in my career. Throughout my journey from hands-on engineering roles to executive positions as CEO of Tonga Cable Ltd, CTO at PowerPlay, Corporate and Regional Director at Kacific Broadband Satellites. I've always found my comfort zone in the engine room, deep in the technical trenches where logic and precision reign supreme.</p>\n<p>\\\nMy engineering DNA, forged through decades of work across diverse domains from geospatial systems to blockchain technology, from submarine fiber optic cables to satellite communications has always favored efficiency: bullet points, clear metrics, and concise technical summaries. It's a language that resonates perfectly with fellow engineers in my domain, whether we're discussing disaster risk reduction policies for utilities in Micronesia or developing smart contracts on Ethereum, EVM Chains, Hedera and Rootstock.</p>\n<p>\\\nHowever, my recent experience in consultancy has brought an interesting challenge to light. As someone who has led digital transformation initiatives across the Pacific, from expanding broadband coverage to championing Web3 technologies, I've found myself increasingly adapting my communication style to meet the expectations of evaluators who prefer their technical content served with a generous helping of narrative prose, what I playfully call \"sugar coating.\"</p>\n<p>\\\nThis weekend's proposal marathon has been particularly enlightening. As I transformed technical specifications into flowing narratives, I realized something crucial: perhaps it's time for me to evolve once again. Not away from engineering, but rather up the stack, where I can serve as a bridge between the engine room and the boardroom. After all, isn't this what I've been unconsciously doing throughout my career, whether it was making satellite communications accessible across the Pacific, developing GIS solutions for 14 Pacific Island nations, or leading blockchain awareness initiatives.</p>\n<p>\\\nThe younger generation of engineers shouldn't have to spend countless hours converting their precise, technical thinking into elaborate prose just to get their brilliant ideas across. They should be free to focus on what they do best, innovating and solving complex technical challenges. Whether they're working on smart contract security, developing geospatial databases, or expanding digital connectivity, their time is better spent pushing technological boundaries than wrestling with report aesthetics.</p>\n<p>\\\nThis realization aligns perfectly with my ongoing work in digital skills development and capacity building across the Pacific. As someone who has consistently worked to bridge digital divides and remove barriers to technology adoption, perhaps this is my next calling, to be the translator, the facilitator who can help streamline this process. Having been both in the engine room and the boardroom, understanding both languages fluently, I can create more value by helping these talented engineers navigate the sometimes Byzantine world of corporate communication.</p>\n<p>\\\nAs I serenade Christmas tunes after submitting these proposals, I'm energized by this new perspective. My journey from a humble beginnings of a computer operator at the Tonga Electric Power Board to leading major digital infrastructure projects has taught me that sometimes the most valuable revelations come not from the work itself, but from reflecting on how we do that work and why. It's time to leverage this experience to create pathways for the next generation of Pacific engineers, ensuring their brilliant technical solutions don't get lost in translation.</p>\n<p>\\\nWishing you all a Merry Christmas and a Prosperous New Year! The journey continues…</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Meet PiHow, AVJ HR Solutions & PAY HERO KENYA: HackerNoon Startups Of The Week","url":"https://hackernoon.com/meet-pihow-avj-hr-solutions-and-pay-hero-kenya-hackernoon-startups-of-the-week?source=rss","date":1735227015,"author":"Startups Of The Week","unread":true,"desc":"","content":"<p>HackerNoon is back with Startups of The Week! We highlight a list of notable startups weekly from our <strong><a href=\"https://hackernoon.com/startups?ref=hackernoon.com\">Startups of The Year database</a></strong>. All these startups have been nominated as one of the best in their respective category or region.</p>\n<p>\\\nThis week, let’s meet <a href=\"https://hackernoon.com/company/pihow\">PiHow</a>, <a href=\"https://hackernoon.com/company/avjhrsolutions\">AVJ HR Solutions</a>, and <a href=\"https://hackernoon.com/company/payherokenya\">PAY HERO KENYA</a>.</p>\n<p>\\</p>\n<p>:::tip\nWant to be nominated for HackerNoon’s Startups of The Year? Learn how<a href=\"https://hackernoon.com/preview/YFQ5Qp6aEayC9yDUFq14\"> </a><strong><a href=\"https://hackernoon.com/preview/YFQ5Qp6aEayC9yDUFq14\">here</a></strong>.</p>\n<p>:::</p>\n<p>\\</p>\n<h2 id=\"meetstartupsoftheweek\">Meet Startups of The Week</h2>\n<h3 id=\"pihowhttpshackernooncomcompanypihow\"><a href=\"https://hackernoon.com/company/pihow\">PiHow</a></h3>\n<p>PiHow provides personalized web development and design solutions, with a mission of helping companies across multiple industries to enhance their digital presence. Starting out as a freelance gig, the PiHow team quickly grew as demands rose, consistently delivering quality and innovative projects tailored to each client’s needs.</p>\n<p>\\\nPiHow has received nominations for being one of the best <a href=\"https://hackernoon.com/startups/industry/creative-agency?stup=66f322f16ea4677e23e0d25b\">Creative Agencies</a> in <a href=\"https://hackernoon.com/startups/industry/art?stup=66f322f16ea4677e23e0d25b\">Art</a> and <a href=\"https://hackernoon.com/startups/industry/design?stup=66f322f16ea4677e23e0d25b\">Design</a>.</p>\n<p>\\</p>\n<p>:::info\n<strong>Support PiHow - Vote <strong><a href=\"https://hackernoon.com/startups/industry/creative-agency?stup=66f322f16ea4677e23e0d25b\">here</a></strong>!</strong></p>\n<p>:::</p>\n<p>\\</p>\n<h3 id=\"avjhrsolutionshttpshackernooncomcompanyavjhrsolutions\"><a href=\"https://hackernoon.com/company/avjhrsolutions\">AVJ HR Solutions</a></h3>\n<p>AVJ HR Solutions provides professional human resource services across India. With the motto of “WIN-WIN Hiring”, the company ensures candidates with the best long-term career and minimizes bad hiring decisions for partnered companies. Additionally, AVJ HR Solutions offers services like recruitment outsourcing, resume and interview tips, CTC guidance, apprentice and industrial training, and campus placements.</p>\n<p>\\\nBased in <a href=\"https://hackernoon.com/startups/asia/asia-rajasthan-india?stup=66f319e76ea4677e23da70bf\">Rajasthan, India</a>; the company has been nominated as one of the best startups in <a href=\"https://hackernoon.com/startups/industry/professional-services?stup=66f319e76ea4677e23da70bf\">Professional Services</a>, <a href=\"https://hackernoon.com/startups/industry/consulting?stup=66f319e76ea4677e23da70bf\">Consulting</a>, and <a href=\"https://hackernoon.com/startups/industry/business-development?stup=66f319e76ea4677e23da70bf\">Business Development</a>.</p>\n<p>\\</p>\n<p>:::info\n<strong>Support</strong> <strong>AVJ HR Solutions</strong> <strong>- Vote <a href=\"https://hackernoon.com/startups/asia/asia-rajasthan-india?stup=66f319e76ea4677e23da70bf\">here</a>!</strong></p>\n<p>:::</p>\n<p>\\</p>\n<h3 id=\"payherokenyahttpshackernooncomcompanypayherokenya\"><a href=\"https://hackernoon.com/company/payherokenya\">PAY HERO KENYA</a></h3>\n<p>Bringing the values of Innovation, Customer-centricity, Security, and Reliability, Pay Hero Kenya provides streamlined and innovative payment solutions for micro, small, and medium enterprises in Africa. With users in mind, Pay Hero assures fast and efficient payments across banks and platforms.</p>\n<p>\\\nPAY HERO KENYA has been nominated as one of the best startups in <strong><a href=\"https://hackernoon.com/startups/africa/africa-nairobi-kenya?stup=66f327b26ea4677e23e47bc2\">Nairobi, Kenya</a></strong>; with additional nominations in <a href=\"https://hackernoon.com/startups/industry/fintech?stup=66f327b26ea4677e23e47bc2\">FinTech</a>,&nbsp;<a href=\"https://hackernoon.com/startups/industry/banking?stup=66f327b26ea4677e23e47bc2\">Banking</a>, and&nbsp;<a href=\"https://hackernoon.com/startups/industry/investing?stup=66f327b26ea4677e23e47bc2\">Investing categories</a>.</p>\n<p>\\</p>\n<p>:::info\n<strong>Support PAY HERO KENYA - Vote <strong><a href=\"https://hackernoon.com/startups/africa/africa-nairobi-kenya?stup=66f327b26ea4677e23e47bc2\">here</a></strong>!</strong></p>\n<p>:::</p>\n<p>\\</p>\n<h2 id=\"featuredinterviewoftheweek\">Featured Interview of The Week</h2>\n<p>Take <a href=\"https://hackernoon.com/u/pihow\">PiHow</a>’s lead, <a href=\"https://hackernoon.com/hackernoon-profile-pages-reimagined-a-walkthrough-of-the-latest-updates\">create your own business page on HackerNoon</a>, and share your startup journeys with the world using one of the following interview templates <strong><a href=\"https://hackernoon.com/startups-of-the-year-2024-interview-series-how-to-get-featured-on-hackernoon-tech-publication\">here</a></strong>.</p>\n<p><a href=\"https://hackernoon.com/leading-the-charge-in-digital-transformation-interview-with-soty-2024-nominee-pihow?embedable=true\">https://hackernoon.com/leading-the-charge-in-digital-transformation-interview-with-soty-2024-nominee-pihow?embedable=true</a></p>\n<p>\\\nThis time let’s explore the <a href=\"https://hackernoon.com/startups-of-the-year-2024-healthcare-interview\">Healthcare Interview Template</a>. Showcase your startup’s vision, achievements, and strategies in the healthcare space. Provide valuable insights into the evolution of the healthcare industry by leveraging digital advancement for various treatments, and your company’s position amongst upcoming changes in the industry.</p>\n<p>\\\n<strong>Here’s a quote from <a href=\"https://hackernoon.com/u/pihow\">PiHow</a> in their <a href=\"https://hackernoon.com/leading-the-charge-in-digital-transformation-interview-with-soty-2024-nominee-pihow\">published interview</a>, telling us why they decided to participate in Startups of The Year:</strong></p>\n<p>\\</p>\n<blockquote>\n  <p>Being recognized in HackerNoon's Startups of The Year is an exciting opportunity to showcase our work and connect with a wider community of innovators. It validates our efforts and helps us reach new clients who are looking for dependable freelance web development services.</p>\n</blockquote>\n<p>\\</p>\n<p>:::tip\n<strong>Want to be featured on HackerNoon’s Startups of the Week? Share your startup's story - <strong><a href=\"https://app.hackernoon.com/new?template=soty2024-healthcare-interview&ref=hackernoon.com\">use this interview template</a></strong>.</strong></p>\n<p>Here’s how the 2023 nominees did it: <strong><a href=\"https://hackernoon.com/centering-user-accessibility-in-e-commerce-interview-with-startups-of-the-year-nominee-meetanshi\">Meetanshi</a></strong>,<a href=\"https://hackernoon.com/vote-for-sniperxyz-in-hackernoons-startups-of-the-year-award\"> </a><strong><a href=\"https://hackernoon.com/vote-for-sniperxyz-in-hackernoons-startups-of-the-year-award\">Sniper.xyz</a></strong>,<a href=\"https://hackernoon.com/building-a-cash-lite-society-interview-with-startups-of-the-year-nominee-wallet-factory\"> </a><strong><a href=\"https://hackernoon.com/building-a-cash-lite-society-interview-with-startups-of-the-year-nominee-wallet-factory\">Wallet Factory</a></strong>,<a href=\"https://hackernoon.com/vote-for-grownu-workforce-management-system-in-hackernoons-startups-of-the-year\"> </a><strong><a href=\"https://hackernoon.com/vote-for-grownu-workforce-management-system-in-hackernoons-startups-of-the-year\">Grownu Workforce Management System</a></strong>,<a href=\"https://hackernoon.com/scaling-luxe-lifestyle-fashion-and-beauty-brands-interview-with-startups-of-the-year-nominee-motif\"> </a><strong><a href=\"https://hackernoon.com/scaling-luxe-lifestyle-fashion-and-beauty-brands-interview-with-startups-of-the-year-nominee-motif\">Motif</a></strong>,<a href=\"https://hackernoon.com/observability-done-right-interview-with-startups-of-the-year-nominee-lightrun\"> </a><strong><a href=\"https://hackernoon.com/observability-done-right-interview-with-startups-of-the-year-nominee-lightrun\">Lightrun</a></strong></p>\n<p>:::</p>\n<p>\\</p>\n<h2 id=\"featuredstartupsspecialpackage\">Featured Startups Special Package</h2>\n<p>Use HackerNoon’s Startups of The Year as the perfect launchpad to increase your digital presence! We offer you <a href=\"https://hackernoon.com/p/startup-special-packages?ref=hackernoon.com\">startup-friendly packages</a> that help jumpstart your marketing journey -- from brand awareness to generating leads. Let’s check out the <a href=\"https://hackernoon.com/p/startup-special-packages/lead-generation?ref=hackernoon.com\">lead generation package</a> and what it has to offer.</p>\n<p>\\\n\\\n <img src=\"https://cdn.hackernoon.com/images/eQHzh6rz7ETBHLjs0KzCl1Dooqp2-t4536t0.jpeg\" alt=\"\" /></p>\n<p>\\\n<strong>With this package, you’ll receive:</strong></p>\n<ul>\n<li>4 Total Newsletters Sent: 325,000 per send (85% of subscribers reside in the US)</li>\n<li>Open Rate: 13% - 15%</li>\n<li>Click-to-Open Rate: 13.61%</li>\n<li>Sample:&nbsp;<a href=\"https://hackernoon.com/preview/the-hackernoon-newsletter?ref=hackernoon.com\">Here</a></li>\n<li>Your&nbsp;<a href=\"https://hackernoon.com/companies?ref=hackernoon.com\">Evergreen Tech Company News Page</a></li>\n</ul>\n<p>\\\nThat will be all for today! Congrats to all the nominated startups, and best of luck with your Startups of The Year 2024 campaign!</p>\n<p>\\\nCatch y’all later hackers!</p>\n<p><em>The HackerNoon Team</em></p>\n<hr />\n<h2 id=\"abouthackernoonsstartupsoftheyear\">About HackerNoon’s Startups of The Year</h2>\n<p><a href=\"https://hackernoon.com/startups?ref=hackernoon.com\">Startups of The Year 2024</a>&nbsp;is HackerNoon’s flagship community-driven event celebrating startups, technology, and the spirit of innovation. Currently in its third iteration, the prestigious Internet award recognizes and celebrates tech startups of all shapes and sizes. This year, over 150,000 entities across 4200+ cities, 6 continents, and 100+ industries will participate in a bid to be crowned the best startup of the year! Millions of votes have been cast over the past few years, and&nbsp;<a href=\"https://hackernoon.com/tagged/startups-of-the-year?ref=hackernoon.com\">many stories</a>&nbsp;have been written about these daring and rising startups. \\n </p>\n<p>The winners will get a&nbsp;<a href=\"https://hackernoon.com/preview/qmwXDlvRj5sYQX8V1ITj?ref=hackernoon.com\">free interview</a>&nbsp;on HackerNoon and an&nbsp;<a href=\"https://hackernoon.com/companies?ref=hackernoon.com\">Evergreen Tech Company News</a>&nbsp;page.</p>\n<p>\\\nVisit our&nbsp;<a href=\"https://startups.hackernoon.com/faq?ref=hackernoon.com\">FAQ</a>&nbsp;page to learn more.</p>\n<p>\\\nDownload our design assets&nbsp;<a href=\"https://tracking.hackernoon.com/tracking/click?d=XcHGnOzpvE2DxPC14w-ihaHRkPn4awd4yis2pkvOcID509oTQWwqC9tFUOzgU01FYhtFeNvbASKz0nfKnEPzfEmoUDNXb1gvAaMe0lSLKgbNaBOVawZARZYRNOqqcDlCp3vqChdcsJi4EMaD0JRaC_cmO9FmSTtRUfSUOx2zz1BEoNaP_4MFoONMsn6YVo_-6g2&ref=hackernoon.com\">here</a>.</p>\n<p>\\n Check out the Startups of the Year Merch Shop&nbsp;<a href=\"https://tracking.hackernoon.com/tracking/click?d=oNfy6WTYxusrbP3w-kukga8Kwo5hIywyQh1z9maJPAnPj3Iin8AFn-k8GIGBk970YxRqcGiN59ny63efol-D_Ya6UEEbxV84sBQ4XbM1TgmIrhc2VzA8vSCDw-eID6Bcv4csQq1OOEVMHh5Ab39AQKyLbESJY1CYHHkyllTQ6BqBftsTG0EkOnb5XYKLZmhjOw2&ref=hackernoon.com\">here</a>. \\n </p>\n<p>HackerNoon’s Startups of The Year is a branding opportunity unlike any other. Whether your goal is brand awareness or lead generation, HackerNoon has curated&nbsp;<a href=\"https://hackernoon.com/p/startup-special-packages?ref=hackernoon.com\">startup-friendly packages</a>&nbsp;to solve your marketing challenges. \\n </p>\n<h3 id=\"meetoursponsors\"><strong>Meet our sponsors:</strong></h3>\n<p><strong>Wellfound:</strong>&nbsp;At Wellfound, we're not just a job board—we're the place where top startup talent and the world's most exciting companies connect to build the future.</p>\n<p>\\\n<strong>Notion:</strong>&nbsp;Notion is trusted and loved by thousands of startups as their connected workspace—from building product roadmaps to tracking fundraising.&nbsp;<strong>Try Notion with unlimited AI, FREE for up to 6 months</strong>, to build and scale your company with one powerful tool. <a href=\"https://2ly.link/1zvfy?ref=hackernoon.com\">Get your offer now</a><a href=\"https://ntn.so/nhnsoty?ref=hackernoon.com\">!</a> \\n </p>\n<p><strong>Hubspot</strong>: If you’re looking for a smart CRM platform that meets the needs of small businesses, look no further than HubSpot. Seamlessly connect your data, teams, and customers in one easy-to-use scalable platform that grows with your business. \\n </p>\n<p><strong>Bright Data:</strong>&nbsp;Startups that leverage public web data can make faster, data-driven decisions, giving them a competitive edge. With Bright Data, businesses can grow from a small operation to an enterprise by harnessing insights at every stage.</p>\n<p>\\\n<strong>Algolia:</strong>&nbsp;Algolia NeuralSearch is the world's only&nbsp;combining powerful keyword and natural language processing in a single API.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"US Data Center Boom Creates Windfall For Electricians","url":"https://news.slashdot.org/story/24/12/26/1513222/us-data-center-boom-creates-windfall-for-electricians?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735225980,"author":"msmash","unread":true,"desc":"","content":"Data center construction is driving an unprecedented influx of electricians to central Washington state, where abundant hydropower and tax incentives have attracted major tech companies building AI infrastructure, New York Times is reporting. \n\nMicrosoft alone projects needing 2,300 electricians in coming years for facilities across three counties along the Columbia River. Union electricians earning up to $2,800 weekly after taxes are transforming agricultural communities like Quincy, where data centers now account for 75% of local tax revenue. \n\nWhile the construction boom has funded community improvements including a new high school, rising housing costs and limited long-term employment opportunities raise concerns about sustainable economic benefits for longtime residents.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Data+Center+Boom+Creates+Windfall+For+Electricians%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F1513222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F1513222%2Fus-data-center-boom-creates-windfall-for-electricians%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/1513222/us-data-center-boom-creates-windfall-for-electricians?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561767&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Key to Helping Autonomous Vehicles See and Navigate Safely Lies in Annotated Data","url":"https://hackernoon.com/the-key-to-helping-autonomous-vehicles-see-and-navigate-safely-lies-in-annotated-data?source=rss","date":1735225424,"author":"mcmullen","unread":true,"desc":"","content":"<p>An estimated 1.19 million people are killed in automobile accidents each year (<strong><a href=\"https://www.who.int/news-room/fact-sheets/detail/road-traffic-injuries\">WHO</a></strong>). The majority of the road users that are at risk in this situation are motorcyclists, cyclists, and pedestrians.</p>\n<p>\\\nThis startlingly high death toll emphasizes how crucial safe driving is. The fact that AI technology is emerging as a solution with autonomous vehicles (AVs) aiming to achieve flawless navigation and prioritize safety is futuristic, inspirational, and innovative.</p>\n<h2 id=\"aboutautonomousvehicleannotation\">About Autonomous Vehicle Annotation</h2>\n<p>Accurate annotation serves as a basis for autonomous vehicle model training. It is a prerequisite for self-driving cars work, particularly for address-to-address navigation, where vehicles encounter numerous intersections with static objects to navigate roads safely and efficiently.</p>\n<p>\\\nAnnotation is the process of labeling data, images, videos, and LiDAR scans that teaches AI models to recognize and react to the world. Without precise annotation, the dream of self-driving technology would remain a dream. But how does this process work, and why is it so critical to the future of autonomous vehicle technology? Let’s find out!</p>\n<p>\\\n<a href=\"https://hackernoon.com/top-15-datasets-for-autonomous-driving-ea2u35ej\">Top 15 Datasets for Autonomous Driving</a></p>\n<h2 id=\"whatareguidedsystemsinavs\">What are Guided Systems in AVs?</h2>\n<p>AVs rely on guided systems powered by annotated data. These pre-labeled datasets help AV models understand and interact with their surroundings, enabling tasks such as object detection, lane and road sign recognition, and pedestrian or obstacle detection. Annotated data is regarded as key training information for algorithms to perform well in making real-time, in-the-moment driving decisions.</p>\n<p>\\\nML models use this training data to assess traffic conditions, identify impediments, and make quick decisions. By differentiating between a cyclist and a pedestrian, identifying traffic signals, or detecting a stop sign that is partially hidden by greenery, annotated datasets improve algorithms in AV systems.</p>\n<h2 id=\"whatobjectsareannotatedforautonomousdriving\">What Objects are Annotated for Autonomous Driving?</h2>\n<p>Finding and annotating objects in an image/video is known as object detection, and is a computer vision task. Object annotation in AVs refers to the following:</p>\n<p>\\\n<strong>1- Traffic Signals Annotation</strong></p>\n<p>With the aid of videos and annotated images, the New AV models are trained to correctly identify lanes and signs. It enables them to follow speed restrictions and traffic lights, change lanes, and stay in their lane. This means that labeling tasks comprise traffic lights, road signs, and lane markings. It further helps to detect speed limits, stop signs, and directional signals that are aligned with traffic rules and regulatory information.</p>\n<p>\\\n<strong>2- Vehicles Annotation</strong></p>\n<p>Vehicle annotation includes cars, trucks, motorcycles, bicycles, and other moving vehicles that recognize, track, and respond to traffic rules correctly.</p>\n<p>\\\n<strong>3- Cyclists Annotation</strong></p>\n<p>Annotating cyclists for building driverless vehicles refers to tracking their speed, direction, and interactions with other road users. Rich labeled data enables safe and accurate navigation and supports AV innovation.</p>\n<p>\\\n<strong>4- Pedestrians Annotation</strong></p>\n<p>To maintain training data quality, pedestrian annotation becomes important so that AV models can detect human/biological figures such as adults, children, and even animals to predict their movements and prevent collisions.</p>\n<p>\\\n<strong>5- Other Object Annotation</strong></p>\n<p>Other annotations may be needed in addition to those mentioned above for AV model training. Such annotation measures the distance and dimensions of objects on the road and also identifies them, such as dividers/median strips, crosswalks, lane markings, speed bumps, road edges/curb lines, and tunnels.</p>\n<p>\\\nThe above types of annotations help in building powerful AV models that emphasize safety, compliance, and seamless navigation and concentrate on saving human lives.</p>\n<p>\\\n<strong>The Challenges of Annotating Autonomous Vehicles</strong></p>\n<p>Now that we know what the annotation involves for AVs, let's also cover the obstacles or challenges involved in it.</p>\n<p>\\</p>\n<ol>\n<li><p><strong>Cost or Quality?</strong></p>\n<p>Most annotation providers have high annotation rates. They are quality driven, since they work with advanced annotation tools for LiDAR or 3D imagery that are expensive to obtain. In addition, for AVs, the workload of annotation expands, as they send immense data streams, i.e., petabytes yearly. There should be a balance between cost and quality depending on the AI project's needs because the annotator's skills come at a cost, and smaller businesses suffer significant expenses when it is done in-house.</p>\n<p>\\</p></li>\n<li><p><strong>Ethical Concerns</strong></p>\n<p>To build models accurately, businesses require data from real-world environments, which often involves privacy issues. In addition, the videos and images from training datasets also risk exposure of residences, properties and people’s identities, which they may not be comfortable sharing. This leads to moral dilemmas that can adversely affect the deployment of a model.</p>\n<p>\\</p></li>\n<li><p><strong>Scalability Issues</strong></p>\n<p>A big challenge to AV technology is how to scale the annotation process without compromising quality. AV companies ensure that their deep learning models are sufficiently trained, by implementing both automatic annotation techniques and human monitoring from level 2/partial automation to level 5/full automation in autonomous vehicle systems.</p>\n<p>\\</p></li>\n<li><p><strong>Ambiguities in Annotation</strong></p>\n<p>If the training data is subject to multiple interpretations it is referred to as annotation ambiguities. i.e., for an action, how should an AI model react to a biker with a raised hand?! Or how does the model react to a shadow on a road that resembles something else, like a pothole? Such scenes need image annotations from an eye or the perspective of a human being to become meaningful; millions of data labelers carry out nuanced analyses and supervise AI projects for consistent training data for models.</p></li>\n</ol>\n<p>\\\n<strong>Perspectives on Innovation from the Tech Community</strong></p>\n<p>\\\nWhen we talk about the tech community, we are referring to people working in the AI field, enthusiasts, and techies such as developers, engineers, data scientists, and entrepreneurs. To build successful driverless systems, they focus on productively managing metadata required in model training, including <a href=\"https://becominghuman.ai/lidar-annotation-boosting-ais-perception-capabilities-bf74f1537ac7\">LiDAR</a>, cameras, and radar. Their proficiency is already informing AVs on how to recognize diverse objects on-road and off-road in order to achieve unparalleled precision, perception, prediction, control, and intelligence.</p>\n<p>\\\nWith the objective of achieving fully autonomous vehicles, AI engineers are working toward the safety and ethics of accident algorithms for self-driving cars as they understand the immense effort required to train these AI systems. Their effort goes into solving critical <a href=\"https://link.springer.com/article/10.1007/s10677-016-9745-2\">issues</a> of driverless cars, including moral and legal accountability, basic decision-making in the face of uncertainty and risk, and how self-driving cars should be trained to handle mishaps.</p>\n<h3 id=\"personaltakeontheannotationprocess\">Personal Take on the Annotation Process</h3>\n<p>Working closely with annotation teams has made me realize that the annotation process involves closing the divide between unstructured data and the client’s needs for training AI/ML models.</p>\n<p>\\\nTake, for example, early-stage autopilot systems like emergency braking and adaptive cruise are required for building fully autonomous vehicle systems. These autopilot systems use reinforcement learning to refine driving policies so that the model can improve over time. There is a synergy of human feedback via the <a href=\"https://hackernoon.com/rlhf-the-key-to-building-safe-ai-models-across-industries\">RLHF</a> fed into machine learning algorithms for decision-making.</p>\n<h3 id=\"lessonsfrommyexperience\">Lessons from My Experience</h3>\n<p>In order to produce valuable training data for AI projects, annotators, data scientists, and project managers must work closely together, adding meaningful experiences and analysis.</p>\n<p>\\\nIt’s desirable to focus on common scenarios during the annotation process, but edge cases often determine whether an AI model succeeds or fails in real-world applications. Addressing these scenarios early on would save companies time and resources down the road.</p>\n<p>\\\nAs the demand for labeled data increases, scalable, efficient solutions are becoming relevant. From segmentation to bounding boxes, each labeled and tagged object enhances system reaction. Tools that bring together automation and human ability are the way of the future for this AI innovation.</p>\n<p>\\\nStaying updated on the newest annotation tools, technologies but also prioritizing on ethical, legal, and community aspects is essential for everybody and everyone engaged in this niche.</p>\n<p>\\\n<strong>In a nutshell</strong></p>\n<p>With the rise of precision data annotation services, businesses can focus on training sophisticated ML model innovation for super precise sensing and perception for autonomous vehicles. Autonomous vehicle annotation is a cumbersome process that requires more than a technical process. There is a need to align human judgment and machine intelligence to make navigation decisions in self-driving cars with confidence.</p>\n<p>\\\nThe sixth sense that self-driving cars have is no more than meticulously categorized data. That is what the autonomous vehicle annotation accomplishes, i.e., giving sensor data new life and enabling autonomous cars, or AVs, to negotiate the challenges of the road efficiently.</p>\n<p>\\\nI believe there’s ample possibility for growth, partnership, and technological advancement and we can bring the dream of fully guided autonomous vehicles closer to reality by addressing the challenges head-on. This may be a long journey, but with precise annotation steering the way, the destination is well within reach.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Startups Begin Geoengineering the Sea","url":"https://spectrum.ieee.org/ocean-carbon-removal","date":1735225203,"author":"Emily Waltz","unread":true,"desc":"","content":"<p>These companies are trying to make the oceans a better carbon sink</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4MjcxMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4ODU5NzEzMX0.CNnLVw9aKAkD-FClxWi6UyAmrKIPYjSx0uS7LTxLyLs/image.jpg?width=600","enclosureMime":""},{"title":"Easily Find Top-Selling Products on Etsy With This Research Tool","url":"https://hackernoon.com/easily-find-top-selling-products-on-etsy-with-this-research-tool?source=rss","date":1735223947,"author":"MarGrowth","unread":true,"desc":"","content":"<p>Etsyshop is a comprehensive tool aimed at transforming your Etsy business. It provides a suite of powerful features designed to empower sellers by offering deep insights into market trends, <strong><a href=\"https://app.etsyshop.ai/product-lists\">product research</a></strong>, and keyword analysis. Whether you’re a beginner or a seasoned Etsy seller, Etsyshop offers tools that simplify finding bestseller products and optimizing your shop listings for better visibility.</p>\n<p>\\\nWith <strong><a href=\"https://www.etsyshop.ai/\">Etsyshop</a></strong>, you can discover the most popular products on Etsy through a user-friendly platform that combines product and market research capabilities. This tool stands out by enabling users to quickly analyze top-selling stores and trending products, ensuring that you have the information needed to launch and sustain a successful Etsy store.</p>\n<p>\\\nThe platform also features <strong><a href=\"https://www.etsyshop.ai/blog\">blog</a></strong> resources filled with valuable resources and tips. These resources help you stay updated on the latest Etsy trends and strategies to enhance your selling potential.</p>\n<p>\\\n\\\nIn addition to these features, Etsyshop offers an advanced SEO <strong><a href=\"https://app.etsyshop.ai/keyword-tool\">keyword tool</a></strong>. This tool helps you find keywords with low competition, giving your products an edge in search rankings. A successful Etsy store often depends on being found, and with Etsyshop, you have the keys to better accessibility and visibility.</p>\n<p>\\\nBy integrating AI technology, Etsyshop not only reveals bestseller items but also helps in understanding how these products achieve their success. It’s a must-have for anyone serious about improving their Etsy business practices and maximizing sales potential.</p>\n<p>\\\nWhether you’re using Etsyshop for product research or market analysis, the intuitive interface and robust data analytics make it an essential tool. The platform supports both experienced sellers and those new to Etsy, providing guidance at every step from product discovery to sales optimization.</p>\n<h3 id=\"productresearch\">Product Research</h3>\n<p>Etsyshop provides a powerful product research feature that allows you to uncover bestselling and trending products with ease. Whether you're new to Etsy or an experienced seller, understanding market trends is crucial. This tool offers insights into which items are capturing buyers' interest and helps predict future trends based on data like sales, reviews, and favorites.</p>\n<p>\\</p>\n<ul>\n<li>Identify real bestseller products to enhance your listings.</li>\n<li>Discover Etsy's pick products using data-driven insights.</li>\n<li>Predict growth trends effectively with detailed analysis.</li>\n</ul>\n<p>\\\nWith these insightful features, you can make informed decisions, optimize your product listings, and ultimately increase your sales. Get ahead in the competitive Etsy marketplace by utilizing advanced tools that provide accurate data and analytics for profitable selling.</p>\n<p>\\\nExplore the benefits of advanced product research by starting your free trial today. No credit card required! Simply visit the Etsyshop platform and take the first step towards elevating your Etsy business.</p>\n<h3 id=\"marketinsights\">Market Insights</h3>\n<p>In the vast world of Etsy, understanding the market trends is essential for success. The ability to analyze successful Etsy shops provides valuable insights into what's hot and what's not. By using tools like Etsyshop, you can find <strong><a href=\"https://app.etsyshop.ai/top-seller\">top stores</a></strong> and unlock the secrets behind thriving stores and discover which products are currently booming.</p>\n<p>\\\nEtsyshop's Market Research tool offers a comprehensive look at market opportunities. By examining the sales growth of successful <strong><a href=\"https://www.etsyshop.ai/etsy-shop\">Etsy shops</a></strong> over time, you can identify which trends to follow and which niches may be profitable. The tool quickly highlights the top Etsy sellers and their most popular products. This is powerful knowledge for anyone looking to enhance their Etsy business strategies.</p>\n<p>\\\nWith Etsy Store Library, finding well-performing stores becomes simple. You can assess their sales data to get a clear picture of their success over various periods. This functionality helps you to target potential market gaps or reinforce your existing strategies with proven tactics from the best in the business.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/7C36Q1jJovYYFtkOQIJt7uGMptn2-2024-12-26T14:39:06.013Z-c1ay1fuj12lwh1hg4j58nvks\" alt=\"\" /></p>\n<p>\\\nThe platform's keyword finder tool is especially invaluable, offering sellers a competitive edge by helping them discover under-the-radar keywords that can drive traffic to their stores. Couple that with their market research capabilities, and sellers have a robust toolkit to elevate their efforts.</p>\n<p>\\\nWith a community of over 13,000 Etsy and ecommerce sellers, Etsyshop has grown into a trusted ally for anyone serious about scaling their online ventures.</p>\n<p>\\</p>\n<hr />\n<p>:::info\n<strong><em>This story was distributed by Margrowth under HackerNoon’s Brand As An Author Program. Learn more about the program here: <a href=\"https://business.hackernoon.com/brand-as-author?ref=hackernoon.com\">https://business.hackernoon.com/brand-as-author</a></em></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Powerful Web Tool Takes Out the Guess Work in TikTok & Facebook Ad Intelligence","url":"https://hackernoon.com/powerful-web-tool-takes-out-the-guess-work-in-tiktok-and-facebook-ad-intelligence?source=rss","date":1735223706,"author":"MarGrowth","unread":true,"desc":"","content":"<p>If you're navigating the world of digital advertising, finding a tool that simplifies and enhances your ad campaigns can feel like a golden opportunity. Pipiads offers powerful solutions with its comprehensive advertising library, providing insights that can transform how you approach TikTok and Facebook ads.</p>\n<h3 id=\"whatispipiads\">What is Pipiads?</h3>\n<p><strong><a href=\"https://www.pipiads.com/\">Pipiads</a></strong> is an all-in-one ad spy and library tool that provides access to a wealth of advertising data from platforms like TikTok and Facebook. Whether you're a seasoned marketer or just starting, this tool equips you with the insights needed to spot winning products and optimize your ad strategies.</p>\n<p>\\\nWith a focus on Discovering Winning Ads and understanding competitor analytics, Pipiads simplifies the process of finding valuable marketing intelligence. Explore trending products and successful ad creatives without any hassle.</p>\n<p>\\\nBy using Pipiads, not only can you view the latest <strong><a href=\"https://www.pipiads.com/ad-library\">ads library</a></strong>, but you also get data-backed insights to improve your campaigns. Diving into the ad performance analysis becomes less daunting when equipped with the right tools. With Pipiads’s <strong><a href=\"https://www.pipiads.com/tiktok-creative-center\">TikTok creative center</a></strong>, you also can find top ad creatives and trending engagement insights to optimize your TikTok campaigns.</p>\n<p>\\\nExcited to take your ad campaigns to the next level? Start leveraging Pipiads and comment below on how it has transformed your advertising strategies!</p>\n<p><img src=\"https://cdn.hackernoon.com/images/7C36Q1jJovYYFtkOQIJt7uGMptn2-2024-12-26T14:35:05.206Z-b47uf0vrwp2cxkeye9c052r9\" alt=\"\" /></p>\n<h2 id=\"featuresandfunctions\">Features and Functions</h2>\n<h3 id=\"adlibraryfortiktok\">Ad Library for TikTok</h3>\n<p>Exploring the <strong><a href=\"https://www.pipiads.com/tiktok-ads-library\">TikTok Ad Library</a></strong> opens up a wealth of opportunities for advertisers. It offers a platform to view over 50 million TikTok ads, making it the largest collection of its kind. With this tool, advertisers can discover winning ad strategies and trending products. It allows users to analyze trends within the TikTok platform, providing a competitive edge in crafting appealing ad campaigns.</p>\n<h3 id=\"adlibraryforfacebook\">Ad Library for Facebook</h3>\n<p>The <strong><a href=\"https://www.pipiads.com/facebook-ads-library\">Facebook Ad Library</a></strong> is newly launched but is already packed with valuable features. Advertisers can access real Facebook ads, including detailed metrics like likes, ad durations, and more. This tool helps uncover the best-performing products through various formats such as images, videos, and carousel ads. It provides insights into what makes these ads successful, enabling businesses to adopt similar strategies.</p>\n<p>\\\nBoth TikTok and Facebook offer unique advertising opportunities. Utilizing the full potential of these ad libraries can significantly enhance a business’s advertising strategies, ensuring they stay ahead of the competition. Start exploring these powerful tools to find the best ad examples and optimize your ad campaigns.</p>\n<h3 id=\"competitiveanalysistools\">Competitive Analysis Tools</h3>\n<p>To stay ahead in the competitive market, it's crucial to analyze your competitors. Pipiads offers tools that let you peek into competitors' ad strategies and product choices. With data-driven insights, you can adjust your ad campaigns and product offerings to gain an edge. Explore the <strong><a href=\"https://www.pipiads.com/product-search\">Product Search</a></strong> Tool to understand the market trends and competitor tactics.</p>\n<ul>\n<li>Access to over 50 million ads</li>\n<li>Detailed competitor insights</li>\n<li>Tool for trending product discovery</li>\n</ul>\n<p>\\\nIn conclusion, utilizing advanced product discovery and competitive analysis tools like those provided by Pipiads can transform your business strategy. These features not only help in finding winning products but also in aligning your brand with successful market trends.</p>\n<p>\\\nIn the ever-evolving world of digital advertising, keeping pace with the latest trends and tools is crucial. Pipiads stands out as a comprehensive solution for those engaged in TikTok and Facebook advertising. It offers vast resources to help discover successful ads and winning products, making it easier for advertisers to stay ahead of the competition.</p>\n<p>\\</p>\n<hr />\n<p>:::info\n<strong><em>This story was distributed by Margrowth under HackerNoon’s Brand As An Author Program. Learn more about the program here: <a href=\"https://business.hackernoon.com/brand-as-author?ref=hackernoon.com\">https://business.hackernoon.com/brand-as-author</a></em></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New Tool Can Help You Discover The Best AI Websites On the Planet","url":"https://hackernoon.com/new-tool-can-help-you-discover-the-best-ai-websites-on-the-planet?source=rss","date":1735223415,"author":"MarGrowth","unread":true,"desc":"","content":"<p>Toolify is your go-to directory for discovering the best AI tools across a wide range of categories. Whether you're looking for productivity apps, creative AI solutions, or anything in between, <strong><a href=\"https://www.toolify.ai/\">Toolify</a></strong> has it all. With a comprehensive AI tools list that's updated daily, you'll always find something new and useful. Dive into a world of innovation and enhance your digital toolkit with Toolify's expertly curated selection.</p>\n<p>\\\nThe platform categorizes tools based on their features and usability, allowing users to find exactly what they need quickly.</p>\n<p>\\\nFrom enhancing productivity with AI-powered task managers to exploring creative design tools, Toolify offers something for everyone. Whether you are a developer, marketer, or educator, the diverse categories ensure you find the right tools to meet your specific needs.</p>\n<p>\\\nExplore more categories and tools by visiting the AI Tools Directory.</p>\n<h2 id=\"keyfeaturesoftoolify\"><strong>Key Features of Toolify</strong></h2>\n<p>Toolify stands out as a top destination for discovering <strong><a href=\"https://www.toolify.ai/most-used\">most-used AI tools</a></strong> and resources. With its continuous updates and user-centric approach, it caters to both tech enthusiasts and professionals seeking the latest advancements in artificial intelligence.</p>\n<h3 id=\"dailyupdatesandnewadditions\"><strong>Daily Updates and New Additions</strong></h3>\n<p>Every day, Toolify enriches its platform with <strong><a href=\"https://www.toolify.ai/new\">new AI tools</a></strong> and innovations. This commitment to daily updates ensures users have access to the most current technologies, empowering them to stay ahead in an ever-evolving digital landscape.</p>\n<h3 id=\"extensivecategoriesforeasyaccess\">Extensive Categories for Easy Access</h3>\n<p>Navigating through Toolify is seamless, thanks to its extensive range of categories. From AI chatbots to data analytics tools, each category is meticulously organized to help users find the tools they need with ease and efficiency. We also have rankings for various AI tools, such as <strong><a href=\"https://www.toolify.ai/Best-AI-Tools-Category\">Top AI by Categories</a></strong>, Regions, Sources, Revenue, and more, to help you discover the best tools tailored to your needs and goals.</p>\n<p>\\\nExplore the wide range of categories offered by Toolify to find tools tailored to your specific needs.</p>\n<h3 id=\"userfriendlyinterface\">User-Friendly Interface</h3>\n<p>Toolify's interface is designed for simplicity and ease of use. Its intuitive layout allows users to explore and discover AI tools without any hassle, ensuring a smooth and enjoyable experience.</p>\n<p>\\\nDiscover new tools quickly by visiting the new additions section.</p>\n<h2 id=\"targetaudienceforaitools\">Target Audience for AI Tools</h2>\n<p>AI tools are not just for tech enthusiasts or IT professionals. They cater to a wide range of users, each with unique needs and goals. Whether you're a student, a marketing professional, or a small business owner, AI tools can significantly enhance your daily tasks. Let's explore who can benefit the most from these tools.</p>\n<p>\\</p>\n<ul>\n<li>Students: AI education assistants can help with homework and provide personalized learning experiences. Learn more on the AI Education Assistant page.</li>\n<li>Professionals: AI voice assistants streamline workflow by setting reminders and performing tasks quickly. Check out offerings on our AI Voice Assistants page.</li>\n<li>E-commerce: Boost product appeal with AI product description generators that create engaging content. Discover more on our AI Product Description Generator page.</li>\n</ul>\n<p>\\\nThese tools are designed to make life easier and productivity higher. They break down complex tasks into manageable actions, allowing more time for creativity and strategic thinking.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/7C36Q1jJovYYFtkOQIJt7uGMptn2-2024-12-26T14:30:14.084Z-y7zarymttuo3fsw2nbklzbmr\" alt=\"\" /></p>\n<p>\\\nIf you're curious about how AI can enhance your work or studies, exploring these tools is a great place to start. Embrace the future of technology, where AI does the heavy lifting, and you're free to focus on what truly matters.</p>\n<p>\\\nWhether you're a developer, researcher, or just curious about AI, Toolify offers insights and tools that cater to all levels of expertise. With up-to-date information and a wide range of applications, Toolify is your go-to for advancing in AI technology.</p>\n<hr />\n<p>:::info\n<strong><em>This story was distributed by Margrowth under HackerNoon’s Brand As An Author Program. Learn more about the program here: <a href=\"https://business.hackernoon.com/brand-as-author?ref=hackernoon.com\">https://business.hackernoon.com/brand-as-author</a></em></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Save & Download Ads From Any Platform Using This Chrome Extension","url":"https://hackernoon.com/save-and-download-ads-from-any-platform-using-this-chrome-extension?source=rss","date":1735223188,"author":"MarGrowth","unread":true,"desc":"","content":"<p>Imagine being able to save all the creative ads you come across on platforms like Facebook, TikTok, YouTube, and Instagram in just one click. With the <strong><a href=\"https://www.adslibrary.ai/\">AdsLibrary</a></strong> Chrome Extension, this is now a reality. This tool is perfect for marketers, advertisers, and anyone interested in keeping a record of creative ads they find intriguing. Now, you can easily manage and sort out ads without the hassle of multiple screenshots or notes.</p>\n<p>\\\nThis&nbsp; <strong><a href=\"https://www.adslibrary.ai/chrome-extension\">AdsLibrary Chrome Extension</a></strong> provides an effective way to create your own ad library. You can showcase your favorite ad finds with your team or clients, making it an invaluable tool for brainstorming sessions and marketing strategy planning.</p>\n<p>\\\nThe AdsLibrary is not just about saving ads; it enables you to download them as well. Whether it’s videos or photos, ad media or data, downloading is as simple as clicking a button. This feature is incredibly beneficial for creative strategists who need access to high-quality ad content quickly and efficiently.</p>\n<p>\\\nOver 3,000+ brands and agencies trust AdsLibrary for their ad saving needs. The tool allows users to save ads from multiple platforms, organize them, and share them with others effortlessly. It’s no wonder that professionals from various industries are leveraging this extension to enhance their advertising efforts.</p>\n<h2 id=\"keyfeaturesoftheadslibraryextension\"><strong>Key Features of the AdsLibrary Extension</strong></h2>\n<p><img src=\"https://cdn.hackernoon.com/images/7C36Q1jJovYYFtkOQIJt7uGMptn2-2024-12-26T14:26:26.830Z-hiio7xetgkx47cz2tb6g4vv2\" alt=\"\" /></p>\n<p>\\\nThe Discovery feature of AdsLibrary is exceptional. It provides access to a huge community <strong><a href=\"https://www.adslibrary.ai/library\">ad library</a></strong>, exposing users to over 600,000 high-quality ads from more than 80,000 brands. This is an invaluable resource for anyone seeking inspiration or wanting to analyze current ad trends.Sharing ads with your team or clients couldn't be easier. You can share individual ads or entire groups, allowing you to express your thoughts and collaborate effectively.</p>\n<p>\\\nIt's a great way to ensure everyone is on the same page regarding ad strategies.</p>\n<ul>\n<li>Save and download ads from multiple platforms</li>\n<li>Organize ads into folders and groups</li>\n<li>Access a vast library of ads from 80k+ brands</li>\n<li>Share ads effortlessly with team and clients</li>\n</ul>\n<p>\\\nWith AdsLibrary's powerful tools such as <strong><a href=\"https://www.adslibrary.ai/video-fb-downloader\">Facebook Video Downloader</a></strong> and <strong><a href=\"https://www.adslibrary.ai/video-ytb-downloader\">Youtube Video Downloader</a></strong>, saving and managing ads has never been easier. Make sure to try it today and unlock a new level of creativity in your advertising campaigns.</p>\n<p>\\\nReady to enhance your ad save experience? Download the AdsLibrary Chrome Extension and start your free trial now. It's the best tool for managing and discovering ads efficiently.</p>\n<h2 id=\"advantagesanddisadvantagesofusingadslibrary\">Advantages and Disadvantages of Using AdsLibrary</h2>\n<p>Exploring the world of online advertising can be overwhelming, but using a tool like AdsLibrary is a game-changer for marketers. It offers numerous benefits for ad management and creativity. However, it's important to weigh these against potential drawbacks.</p>\n<p>\\</p>\n<ul>\n<li>Ease of Use: AdsLibrary provides a user-friendly interface, making it simple to save and manage ads across multiple platforms.</li>\n<li>Access to Data: With AdsLibrary, users can quickly access a wide array of ads, which can fuel inspiration and strategy development.</li>\n<li>Collaboration: Share your saved ads with your team or clients effortlessly to encourage collaborative efforts.</li>\n</ul>\n<p>\\\nDespite these advantages, AdsLibrary is not without its limitations. Let’s consider some potential downsides.</p>\n<ul>\n<li>Cost: While AdsLibrary offers a trial, gaining full access to its features may require a subscription, which might not fit every budget.</li>\n<li>Learning Curve: Although designed to be straightforward, users unaccustomed to digital tools might need some time to fully leverage all its capabilities.</li>\n<li>Platform Limitations: As a third-party tool, any changes in platform policies by Facebook, TikTok, or others could impact AdsLibrary’s effectiveness.</li>\n</ul>\n<p>\\\nUltimately, AdsLibrary stands as a valuable ally for those seeking to streamline and enhance their ad management processes. Weighing both the pros and cons will help you determine if it's the right tool for your advertising needs.</p>\n<p>\\</p>\n<hr />\n<p>:::info\n<strong><em>This story was distributed by Margrowth under HackerNoon’s Brand As An Author Program. Learn more about the program here: <a href=\"https://business.hackernoon.com/brand-as-author?ref=hackernoon.com\">https://business.hackernoon.com/brand-as-author</a></em></strong></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft Is Forcing Its AI Assistant on People - And Making Them Pay","url":"https://slashdot.org/story/24/12/26/140236/microsoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735221660,"author":"msmash","unread":true,"desc":"","content":"Microsoft has integrated its AI assistant Copilot into Microsoft 365 subscriptions in Australia and Southeast Asia, simultaneously raising prices for all users. The move forces customers to pay for AI features regardless of interest, prompting complaints about intrusive pop-ups and price hikes, WSJ reports. From the report: Some users said on social media that Copilot pop-ups reminded them of Clippy, Microsoft's widely derided Office helper from the late 1990s, that would frequently offer unsolicited help. \n\n[...] The change demonstrates the lengths to which Microsoft is going to try to profit from its huge investments in AI. Copilot, which is built with technology from OpenAI, is a key part of Chief Executive Satya Nadella's plan to keep expanding Microsoft's software business for consumer and corporate customers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Is+Forcing+Its+AI+Assistant+on+People+-+And+Making+Them+Pay%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F140236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F26%2F140236%2Fmicrosoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/26/140236/microsoft-is-forcing-its-ai-assistant-on-people---and-making-them-pay?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561719&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"These were the badly handled data breaches of 2024","url":"https://techcrunch.com/2024/12/26/badly-handled-data-breaches-2024/","date":1735221638,"author":"Zack Whittaker, Carly Page","unread":true,"desc":"","content":"<p>Blaming victims, months of silence, and suing security researchers all featured in cybersecurity in 2024.</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ex-CEO Says Bitcoin Mining Could Have Been a Revenue Boom for the Pacific Island","url":"https://hackernoon.com/ex-ceo-says-bitcoin-mining-could-have-been-a-revenue-boom-for-the-pacific-island?source=rss","date":1735221612,"author":"Edwin Liava'a","unread":true,"desc":"","content":"<p>As I reflect back on my tenure as CEO of Tonga Cable Ltd from 2018 to 2020, I'm reminded of Robert Frost's famous poem about two diverging roads in a yellow wood. We faced such a moment of choice, though at the time, I don't think anyone but me fully grasped its significance.</p>\n<p>\\\nIt began with disappointment. We had invested considerably in establishing data center operations and cloud services – a logical step for a company operating the nation's submarine cable infrastructure. The initiative showed immense promise, but fate had other plans. Following concerns raised by one of our shareholders because they offering the same service as a retailer of internet capacity, we had to cease these operations, leaving us with valuable infrastructure and a pressing need to re-imagine its utility.</p>\n<p>\\\nIn moments of challenge, innovation often flourishes. As I surveyed our assets – three cable landing stations humming 24/7 with reliable power infrastructure, standby generators standing ready, and most tantalizingly, our position on the internet's backbone with vast under-utilized capacity – an idea began to crystallize. What if we could turn these resources toward Bitcoin mining?</p>\n<p>\\\nThe synchronicity was perfect. We had everything a mining operation could dream of: reliable power, multiple secure locations with built-in cooling systems, direct access to high-speed internet connectivity, and a team with the technical expertise to maintain it all. It seemed like destiny had handed us all the pieces of a puzzle that could transform not just our company, but potentially our entire nation's economic future.</p>\n<p>\\\nThe numbers danced in my head. In 2018, Bitcoin traded between $3,200 and $17,000. Even with a modest setup of 100 ASIC miners, we could have been mining approximately 43.8 BTC annually. At the time, this would have translated to roughly $273,790 in annual revenue after accounting for electricity costs and pool fees. Today, as we approach 2025 with Bitcoin exceeding $96,916.31, that same mining output would generate significantly more revenue, but the exact figure depends on various factors including electricity costs and changes in network difficulty. And that's with a conservative setup – we had the capacity for much more.</p>\n<p>\\\nI often think about El Salvador and Bhutan, nations that took bold steps into the cryptocurrency frontier. Tonga, with our strategic location in the Pacific and robust infrastructure, could have blazed a similar trail. We could have been the beacon of blockchain innovation in the Pacific, attracting technological investment and expertise to our shores. Our small island nation could have positioned itself at the forefront of the digital asset revolution.</p>\n<p>\\\nBut reality has its own gravity. I knew then that submitting such a proposal to our Board of Directors would be like suggesting we build a runway for flying saucers. The conservative nature of our governance, combined with the volatile reputation of cryptocurrency mining, made it a non-starter. Sometimes, being too early is indistinguishable from being wrong.</p>\n<p>\\\nYet, as I watch Bitcoin's meteoric rise and the growing mainstream acceptance of cryptocurrency, I can't help but wonder about that road not taken. The infrastructure we had – our power systems, our cooling capabilities, our internet connectivity – they were like a key in search of its lock. We had the potential to be pioneers, to write a different economic story for Tonga.</p>\n<p>\\\nThese reflections aren't about regret – they're about recognizing that innovation often appears first as an impossible dream. As leaders, we sometimes glimpse opportunities that exist in the overlap between present capabilities and future possibilities. The fact that these opportunities don't always materialize doesn't make them any less real or significant.</p>\n<p>\\\nToday, as I watch nations and major corporations embrace the very ideas that once seemed too radical for our board room, I'm reminded that timing is everything in leadership and innovation. The seeds we plant don't always grow in our season. But perhaps sharing this story might inspire others to look at their existing resources with fresh eyes, to see the extraordinary potential hiding within the ordinary.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Top 8 Computing Stories of 2024","url":"https://spectrum.ieee.org/top-computing-stories-2024","date":1735221602,"author":"Dina Genkina","unread":true,"desc":"","content":"<p>AI coding, software bloat, the open-source crisis—and a science fiction original story</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4NDQwNS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc1ODYzOTc4NH0.T_T4zyB2uWZsCcO0QDJc-B3JP9K62Z1Bz2ZWufCnG8A/image.jpg?width=600","enclosureMime":""},{"title":"Intel Linux Performance Optimizations & Intel's Other Open-Source Wins From 2024","url":"https://www.phoronix.com/news/Intel-Linux-Open-Source-2024","date":1735221300,"author":"Michael Larabel","unread":true,"desc":"","content":"In addition to the exciting hardware launches this year particularly around Xeon 6 Granite Rapids, Lunar Lake processors, and the new low-cost Battlemage graphics cards, what remains particularly exciting and consistent are all of Intel's great investments around open-source and Linux. Over 2024 there were many exciting performance optimizations, new Linux kernel features, GCC and LLVM/Clang compiler toolchain improvements, and countless other enhancements made throughout the open-source ecosystem by Intel engineers...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"James Bond Battles a New Foe: Amazon","url":"https://entertainment.slashdot.org/story/24/12/26/0922211/james-bond-battles-a-new-foe-amazon?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735218060,"author":"msmash","unread":true,"desc":"","content":"An anonymous reader writes: James Bond has dodged more than 4,000 bullets. He has jumped from an airplane, skied off a cliff and escaped castration by laser beam. \n\nNow, 007 is in a new kind of peril. Nearly three years after Amazon acquired the right to release Bond movies through its $6.5 billion purchase of the Metro-Goldwyn-Mayer Studio, the relationship between the family that oversees the franchise and the ecommerce giant has all but collapsed, WSJ reports.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=James+Bond+Battles+a+New+Foe%3A+Amazon%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F26%2F0922211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F26%2F0922211%2Fjames-bond-battles-a-new-foe-amazon%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/26/0922211/james-bond-battles-a-new-foe-amazon?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561565&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"2024: The year AI drove everyone crazy","url":"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/","date":1735214425,"author":"Benj Edwards","unread":true,"desc":"","content":"\n              <p>It's been a wild year in tech thanks to the intersection between humans and artificial intelligence. 2024 brought a parade of AI oddities, mishaps, and wacky moments that inspired odd behavior from both machines and man. From AI-generated rat genitals to search engines telling people to eat rocks, this year proved that AI has been having a weird impact on the world.</p>\n<p>Why the weirdness? If we had to guess, it may be due to the novelty of it all. Generative AI and applications built upon <a href=\"https://arstechnica.com/ai/2024/11/chatgpts-success-could-have-come-sooner-says-former-google-ai-researcher/\">Transformer-based</a> AI models are still so new that people are throwing everything at the wall to see what sticks. People have been struggling to grasp both the implications and potential applications of the new technology. Riding along with the hype, different types of AI that may end up being ill-advised, such as automated military targeting systems, have also been introduced.</p>\n<p>It's worth mentioning that aside from crazy news, we saw fewer weird AI advances in 2024 as well. For example, Claude 3.5 Sonnet <a href=\"https://arstechnica.com/information-technology/2024/06/anthropics-latest-best-ai-model-is-twice-as-fast-and-still-terrible-at-dad-jokes/\">launched in June</a> held off the competition as a top model for most of the year, while <a href=\"https://arstechnica.com/information-technology/2024/09/openais-new-reasoning-ai-models-are-here-o1-preview-and-o1-mini/\">OpenAI's o1</a> used runtime compute to expand GPT-4o's capabilities with simulated reasoning. <a href=\"https://arstechnica.com/ai/2024/09/talking-to-chatgpt-for-the-first-time-is-a-surreal-experience/\">Advanced Voice Mode</a> and <a href=\"https://arstechnica.com/ai/2024/09/fake-ai-podcasters-are-reviewing-my-book-and-its-freaking-me-out/\">NotebookLM</a> also emerged as novel applications of AI tech, and the year saw the rise of more capable <a href=\"https://arstechnica.com/information-technology/2024/04/new-ai-music-generator-udio-synthesizes-realistic-music-on-demand/\">music synthesis models</a> and also better <a href=\"https://arstechnica.com/ai/2024/10/is-china-pulling-ahead-in-ai-video-synthesis-we-put-minimax-to-the-test/\">AI video generators</a>, including several from China.</p><p><a href=\"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/ai/2024/12/2024-the-year-ai-drove-everyone-crazy/#comments\">Comments</a></p>\n\n            ","flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2024/12/addled_by_AI_header-1152x648.jpg","enclosureMime":""},{"title":"Crypto Bull Run Attracts New Developers in 2024, Report From Electric Capital Finds","url":"https://hackernoon.com/crypto-bull-run-attracts-new-developers-in-2024-report-from-electric-capital-finds?source=rss","date":1735214414,"author":"Daniel McGlynn","unread":true,"desc":"","content":"<p>Developer activity is one of the most fundamental metrics for evaluating the future of blockchain or digital asset projects. More developer activity means more potential for growth, more access points, and more apps and services.</p>\n<p>\\\nSlowing or dwindling developer interest might indicate that a project is losing steam or that adoption is waning.</p>\n<p>\\\nInterestingly, as valuable a metric as developer activity is, it is also the most under-reported, and it needs more visibility compared to other kinds of digital asset data.</p>\n<p>\\\nOne of the main reasons is that financial metrics, like <a href=\"https://www.danielmcglynn.com/what-is-market-cap-in-crypto/\">market cap</a> or <a href=\"https://www.danielmcglynn.com/total-value-locked/\">TVL</a>, are usually the brightest lights in the room when looking at onchain activity or growth. In many cases, financial metrics are valuable and popular because they are easy to understand and obtain.</p>\n<p>\\\nThe issue is that financial metrics can also be fuzzy or easy to game or manipulate. Countless examples of inflated token prices or other economic data don't match reality or utility.</p>\n<p>\\\nDeveloper metrics might be less glamorous than rocketing prices. However, understanding which chains developers are working on is a good way for market watchers to know where things are headed.</p>\n<p>\\\nThat's why the annual Developer Report from Electric Capital is so valuable.</p>\n<p>\\\nThe report aggregates data from across the onchain space and worldwide and combines it to help give market moves and narrative trends more context.</p>\n<p>\\\nTo see how this year's trends and analysis compare to last year's report, check out this post: <a href=\"https://www.danielmcglynn.com/electric-capital-developer-report-2023/\">Unpacking the Electric Capital Developer Report 2023</a></p>\n<h2 id=\"seveninsightsfromthe2024developerreport\">Seven insights from the 2024 Developer Report</h2>\n<p>Before diving into the takeaways from this year's report, it's important to note that the data that makes the basis for the report was collected based on code commits made in GitHub, a popular code repository for open-source projects.</p>\n<p>\\\nIn other words, this report's existence is a great example of why building with transparent systems is such an important component of <a href=\"https://www.danielmcglynn.com/what-is-open-money/\">Open Money</a>.</p>\n<p>\\\nWith that out of the way, here are the trends:</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:10.547Z-ssjux28k91a7sznn1o76weoj\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=developers-grew-39-per-year-annualized-since-2015&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\n<strong>Crypto developer activity continues to grow</strong></p>\n<p>\\\nCrypto bull markets attract a new crop of developers. And while there is always a dropoff in developer activity during bear market cycles, the number of experienced developers (with 2+ years of experience) continues to grow.</p>\n<p>\\\nThe number of experienced developers grew by 27% in 2024. This growth matters because 70% of code commits come from this group of more experienced developers.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:10.598Z-xutuqgiech2kve52n5h0fd04\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=crypto-developers-are-now-distributed-across-the-world&ref=danielmcglynn.com\">SOURCE</a></p>\n<p><strong>Developer activity is becoming more distributed around the world</strong></p>\n<p>\\\nNorth America and Europe are losing developers. Now, 1 in 3 developers live in Asia.</p>\n<p>\\\nIndia is the source of the most new developers, pulling past the United States in 2023.</p>\n<p>\\\nAfrica and South America are also gaining developers, with Africa outpacing South America for the past few years.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:10.600Z-alu10kcyrvw09in9r6d3zlqg\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=base-polygon-polkadot-and-near-are-the-3-ecosystem-in-different-countries&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\n<strong>Developer activity: Ethereum and Solana are the two most popular developer platforms -- Bitcoin developers working on scaling</strong></p>\n<p>\\\nWhat's interesting about this data is that while Ethereum continues to be the most popular platform for established developers, Solana is more popular for new developers.</p>\n<p>\\\nIt's also interesting that it's not clear platform-wise what comes after second place for developer activity. Base, Polygon, Polkadot, and ICP are all in contention for the third-most-popular chain.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:10.601Z-pmtth8amqqwz4eenplq5fpoy\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=top-10-fastest-growing-ecosystems-in-2024&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\nBlockchain developers are increasingly working on more than one chain, with 1 in 3 working on more than one chain.</p>\n<p>\\\nOverall, the level of Bitcoin developer activity has remained consistent with last year in terms of volume. What's noteworthy is that 42% of Bitcoin developers are working on scaling solutions.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:11.072Z-hem9fz2sncyp32pt43m099et\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=across-all-chains-with-major-nft-activity-deployments-more-than-tripled-from-38k-to-130k-per-month&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\n<strong>Onchain activity: Minting NFTs</strong></p>\n<p>\\\nAre NFTs back? In 2024, the number of wallets with minting activity hit 67 million, with the most minting activity on Solana, Polygon, and Base.</p>\n<p>\\\nMinting transactions grew from 153 million in 2023 to 568 million in 2024.</p>\n<p>\\\nWhile market watchers tie previous spikes in NFT activities to digital art and collectibles, the 2024 non-fungible token mint rally was more distributed among NFT use cases and included DeFi utilities, rewards programs, identity applications, and gaming.</p>\n<p>\\\nFebruary saw the most significant spike in minting-related activities.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:11.060Z-tjirw9mn3h5tlzfp51g3yw4c\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=we-can-categorize-all-defi-projects-by-type&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\n<strong>DeFi</strong></p>\n<p>\\\nInnovations continue to hit the DeFi market, with Ethereum still the clear winner for onchain DeFi providers. For more context, Ethereum DeFi is seven times larger than the next biggest chain, Solana.</p>\n<p>\\\nMarket charts reflected EigenLayer's continued growth. Restaking is now the largest sector within DeFi, accounting for $30.6B TVL, representing 1,818.47% year-to-date growth.</p>\n<p>\\\nSolana is a leader in the decentralized exchange (DEX) use case. In 2024, 81% of all onchain DEX volume happened on Solana.</p>\n<p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:11.058Z-wodbo6cldlfnczoo7irbeg1i\" alt=\"\" /></p>\n<p><a href=\"https://www.developerreport.com/developer-report?s=196b-in-stablecoins-are-in-circulation-an-all-time-high&ref=danielmcglynn.com\">SOURCE</a></p>\n<p>\\\n<strong>Stablecoins</strong></p>\n<p>\\\nA big trend for 2024 was the rise in the use and utility of <a href=\"https://www.danielmcglynn.com/stablecoins-as-shelter/\">stablecoins as a valuable digital asse</a>t.</p>\n<p>\\\nStablecoins broke all kinds of records in 2024. There are now $196 billion in stablecoins in circulation, and $81 billion in stablecoin volume is transacted every day.</p>\n<p>\\\nEthereum is still the dominant stablecoin platform, with 59% of all stablecoin transactions happening within the Ethereum ecosystem.</p>\n<p>\\\nA trend within the larger stablecoin adoption story is using stablecoins to back <a href=\"https://www.danielmcglynn.com/real-world-assets-rwa-crypto/\">real-world assets</a>, such as US Treasuries, which do not account for $90 billion on stablecoins.</p>\n<h2 id=\"whatdoesdeveloperactivitysayaboutwhattoexpectin2025\">What does developer activity say about what to expect in 2025?</h2>\n<p>One of the most striking aspects of the 2024 Developer Report was how the major developer trends seemed to be in sync with the major narrative trends of the year.</p>\n<p>\\\nFor example:</p>\n<ul>\n<li>The surging popularity of stablecoins</li>\n<li>The adoption of Base as an easy-to-use platform for builders. (<a href=\"https://www.danielmcglynn.com/base-database/\">Here's a database of Base projects</a>).</li>\n<li>Solana is a growing platform for NFT projects and a popular <a href=\"https://www.danielmcglynn.com/memecoins-are-having-a-moment/\">memecoin</a> launcher.</li>\n</ul>\n<p>\\\nOverall, developer activity is growing at a steady pace (despite regular market fluctuations). The continual distribution of developer talent around the world is another example.</p>\n<p>\\\nHere's where you can find the complete report:</p>\n<p><a href=\"https://www.developerreport.com/developer-report\">Developer Report</a></p>\n<p><img src=\"https://cdn.hackernoon.com/images/xP5lHtN0vMf7waCL6tGSabhVnru2-2024-12-26T12:00:11.008Z-d56qqhdkkis018us0bsoqgfw\" alt=\"\" /></p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AMD Ryzen PCs May See More Power Savings Out-Of-The-Box With Linux 6.14","url":"https://www.phoronix.com/news/AMD-P-State-Ryzen-Linux-6.14","date":1735214100,"author":"Michael Larabel","unread":true,"desc":"","content":"AMD Ryzen systems with the upcoming Linux 6.14 kernel may see increased power savings out-of-the-box due to an AMD P-State driver change queued up as part of the new power management code for this next version of the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Reiser5 Would Be Turning Five Years Old But Remains Dead","url":"https://www.phoronix.com/news/Reiser5-Five-Years-Old","date":1735213651,"author":"Michael Larabel","unread":true,"desc":"","content":"It was on New Year's Eve 2019 that Edward Shishkin announced the Reiser5 file-system as an evolution of the out-of-tree Reiser4 file-system code. While next week would mark five years of Reiser5, the Reiser4/Reiser5 file-system still appears effectively dead and hasn't been touched in quite a while...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Pre-Content fanotify / fanotify Hierarchical Storage Management Expected For Linux 6.14","url":"https://www.phoronix.com/news/Linux-6.14-precontent-fanotify","date":1735212167,"author":"Michael Larabel","unread":true,"desc":"","content":"Queued up by way of linux-fs.git's \"for_next\" Git branch is the fanotify HSM (Hierarchical Storage Management) implementation via the pre-content fanotify patch series...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Flying Was Already the Worst. Then America Stopped Using Headphones.","url":"https://tech.slashdot.org/story/24/12/26/0912215/flying-was-already-the-worst-then-america-stopped-using-headphones?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735210920,"author":"msmash","unread":true,"desc":"","content":"Airports are facing a growing nuisance as travelers increasingly watch videos and take calls on speakerphone without headphones, creating tension among passengers at gates and lounges. \n\nFlight attendants at American Airlines, Alaska Air, and Delta have begun addressing the issue through announcements and website notices, though enforcement remains challenging, WSJ reports. Passengers report confrontations rarely end well, with offenders often dismissive or hostile when asked to use headphones. The story adds: The headphones-optional attitude isn't limited to air travel. Podcasts and sports games blare in open-plan offices. You can catch snippets of conversations on the sidewalk, some phones held aloft for video calls. Transit authorities in big cities have struggled to get passengers to keep their music to themselves on subways and commuter trains. \n\nWitnesses say offenders span the generational and socioeconomic spectrum, from grandparents on speakerphone to toddlers on iPads and from first class to coach. \n\nAir travel already overloads the senses with a cacophony of boarding announcements, beeping vehicles and crying babies. U.S. airlines generally don't allow voice and video calls in the air. But by takeoff, the damage has been done.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Flying+Was+Already+the+Worst.+Then+America+Stopped+Using+Headphones.%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F0912215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F26%2F0912215%2Fflying-was-already-the-worst-then-america-stopped-using-headphones%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/26/0912215/flying-was-already-the-worst-then-america-stopped-using-headphones?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561557&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The #AI-chatbot Writing Contest by Coze & HackerNoon: Results Announcement 🎉","url":"https://hackernoon.com/the-ai-chatbot-writing-contest-by-coze-and-hackernoon-results-announcement?source=rss","date":1735210816,"author":"HackerNoon Writing Contests Announcements","unread":true,"desc":"","content":"<p>\\\n<strong>Hey Hackers!</strong></p>\n<p>\\\nWe’re excited to announce the finalists and winners of the <strong>#ai-chatbot Writing Contest</strong>, brought to you by <strong>Coze</strong> and <strong>HackerNoon</strong>!</p>\n<p>\\\nThe contest began on August 6, 2024, and since then, over <strong>60 <a href=\"https://hackernoon.com/tagged/ai-chatbot?ref=hackernoon.com\">#ai-chatbot</a></strong> stories have been published, amassing <strong>90,000</strong> pageviews and totaling <strong>60+ hours of reading time</strong>. For the contest, we asked AI enthusiasts, developers, and writers to discuss AI Chatbot development and explore Coze's all-in-one AI-agent building platform for a chance to win from over $7,000 in prizes—$6,500 in cash and $500+ in Coze software usage tokens.</p>\n<p>\\\nFollowing a 2-week extension the #ai-chatbot writing contest officially closed on November 21, 2024. Entries submitted before the deadline were reviewed by HackerNoon’s editors and narrowed down to 25 finalists eligible for the prizes below. </p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/null-hj134zp.png\" alt=\"\" /></p>\n<hr />\n<p>:::tip\n<strong><em>New to HackerNoon writing contests?</em></strong></p>\n<p><em>Find out about active contests, participation guidelines, and more at&nbsp;<strong><strong><a href=\"https://www.contests.hackernoon.com/?ref=hackernoon.com\">contests.hackernoon.com</a></strong></strong></em></p>\n<p>:::</p>\n<hr />\n<p>Let’s meet our finalists! </p>\n<h2 id=\"aichatbotwritingcontestfinalists\">#ai-chatbot Writing Contest: Finalists</h2>\n<ol>\n<li><p><a href=\"https://hackernoon.com/pawsitive-results-how-to-build-the-ultimate-puppy-trainer-ai-chatbot-with-coze\">Pawsitive Results: How to Build the Ultimate Puppy Trainer AI-chatbot With Coze</a> by <a href=\"https://hackernoon.com/u/marcushaldd\">Daria Leonova</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/crypto-investment-assistant-how-i-built-a-chatbot-that-simplifies-portfolio-management-with-coze\">Crypto Investment Assistant: How I Built a Chatbot That Simplifies Portfolio Management With Coze</a> by <a href=\"https://hackernoon.com/u/emmanuelaj\">Emmanuel Ajala</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/jobquest-assistant-how-i-built-a-smart-companion-for-stress-free-job-hunting-with-coze\">JobQuest Assistant: How I Built a Smart Companion for Stress-Free Job Hunting With Coze</a> by <a href=\"https://hackernoon.com/u/emmanuelaj\">Emmanuel Ajala</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/a-public-procurement-research-chatbot-using-coze\">A Public Procurement Research Chatbot Using Coze</a> by <a href=\"https://hackernoon.com/u/kickboxerj\">Kickboxer J</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-build-a-recipe-generator-ai-chatbot-with-coze\">How to Build a Recipe Generator AI Chatbot With Coze</a> by <a href=\"https://hackernoon.com/u/bennykillua\">killua</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-create-plugins-from-scratch-in-coze-coingecko\">How to Create Plugins From Scratch in Coze: CoinGecko</a> by <a href=\"https://hackernoon.com/u/bennykillua\">killua</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-build-a-product-identifier-ai-chatbot\">How to Build a Product Identifier AI Chatbot</a> by <a href=\"https://hackernoon.com/u/subutai\">Edidiong</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/top-content-bot-the-road-to-content-creation-made-easier\">Struggling with Content Creation? I Built an AI Chatbot to Help You</a> by <a href=\"https://hackernoon.com/u/bettyogodson\">bettyogodson</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/mindcally-your-personal-accountability-partner-ai-chatbot\">MindCally - Your Personal Accountability Partner</a> by <a href=\"https://hackernoon.com/u/niftyzio\">Sara Niftyz.io</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-i-built-the-nigerian-news-reporter-to-deliver-real-time-verified-news-in-local-languages\">How I Built the Nigerian News Reporter to Deliver Real-Time, Verified News in Local Languages</a> by <a href=\"https://hackernoon.com/u/ileolami\">Ileolami</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-i-built-technical-writer-an-ai-chatbot-for-an-open-source-project-using-coze\">How I Built Technical Writer: An AI Chatbot For an Open Source Project using Coze</a> by <a href=\"https://hackernoon.com/u/ileolami\">Ileolami</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-i-built-a-chatbot-for-studying-foreign-languages-using-coze\">How I Built a Chatbot for Studying Foreign Languages Using Coze</a> by <a href=\"https://hackernoon.com/u/kevinstubbs\">Kevin Stubbs</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/design-and-deploy-ai-chatbot-using-coze-how-to-build-a-gpt4-workflowchatbot-for-free\">Design and Deploy AI Chatbot Using Coze: How to Build a GPT4 Workflow/Chatbot for Free</a> by Diamond.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-use-coze-shortcuts-for-creating-buttons-and-telegram-commands\">How to Use Coze Shortcuts for Creating Buttons and Telegram Commands</a> by <a href=\"https://hackernoon.com/u/ileolami\">Ileolami</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/why-2024-is-the-year-you-should-finally-build-your-own-chatbot\">Why 2024 Is the Year You Should Finally Build Your Own Chatbot</a> by <a href=\"https://hackernoon.com/u/Eirene!Matt._a5gu0pj\">Eirene</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/coze-a-love-story\">Coze: A Love Story</a> by @<a href=\"https://hackernoon.com/u/fibonacci\">fibonacci</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-configureintegrate-a-chatbot-ai-in-chat-translator-built-with-coze-into-telegram-chat\">How to Configure/Integrate a Chatbot AI In-chat Translator (Built With Coze) Into Telegram Chat</a> by <a href=\"https://hackernoon.com/u/diamondolmd\">Diamond</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-add-an-ai-chatbot-to-your-documentation-site-using-coze\">How to Add an AI Chatbot to Your Documentation Site Using Coze</a> by <a href=\"https://hackernoon.com/u/ileolami\">Ileolami</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/say-goodbye-to-ai-hallucinations-a-simple-method-to-improving-the-accuracy-of-your-rag-system\">Say Goodbye to AI Hallucinations: A Simple Method to Improving the Accuracy of Your RAG System</a> by <a href=\"https://hackernoon.com/u/jim60105\">Jim</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/comprehensive-tutorial-on-building-a-rag-application-using-langchain\">Comprehensive Tutorial on Building a RAG Application Using LangChain</a> by <a href=\"https://hackernoon.com/u/bexgboost\">Bex</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-turn-your-openapi-specification-into-an-ai-chatbot-with-rag\">How to Turn Your OpenAPI Specification Into an AI Chatbot With RAG</a> by <a href=\"https://hackernoon.com/u/dm1tryg\">Dmitrii Galkin</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/building-a-local-ai-chatbot-with-langchain4j-and-ollama\">Building a Local AI Chatbot with LangChain4J and Ollama</a> by <a href=\"https://hackernoon.com/u/nfrankel\">Nicolas Fränkel</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/building-a-somewhat-intelligent-agent\">Building a (somewhat) Intelligent Agen</a>t by <a href=\"https://hackernoon.com/u/aka\">Akalanka Weerasooriya</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/how-to-create-a-multi-agent-system-using-crew-ai\">How to Create a Multi-Agent System Using Crew AI</a> by <a href=\"https://hackernoon.com/u/aiforbreakfast\">Dmitry Bobolev</a>.</p>\n<p>\\</p></li>\n<li><p><a href=\"https://hackernoon.com/gemini-gems-customize-ai-chatbots-from-gemini\">Gemini Gems: Customize AI&nbsp;Chatbots from Gemini</a> by <a href=\"https://hackernoon.com/u/proflead\">Vladislav Guzey</a>.</p></li>\n</ol>\n<hr />\n<blockquote>\n  <p>These stories share different perspectives to AI chatbot development—from reating powerful Coze AI chatbots to building smarter search tools, image generators, and productivity-boosting assistants. <em>Be sure to check them out and follow these exceptional HackerNoon contributors.</em></p>\n</blockquote>\n<hr />\n<p>:::info\n<strong>After collating votes from our editorial team and the contest’s sponsor, we're thrilled to announce the winners of the #ai-chatbot writing contest!</strong></p>\n<p>:::</p>\n<h2 id=\"aichatbotwritingcontestwinners\">#ai-chatbot Writing Contest Winners</h2>\n<h3 id=\"bestcozeusecaseappstory\">Best Coze Use-Case/ App Story</h3>\n<p><a href=\"https://hackernoon.com/how-i-built-a-chatbot-for-studying-foreign-languages-using-coze?embedable=true\">https://hackernoon.com/how-i-built-a-chatbot-for-studying-foreign-languages-using-coze?embedable=true</a></p>\n<p>\\</p>\n<blockquote>\n  <p>“It was easier to build than I expected. So much so that I’ll start from square one, and in this same article cover creating the bot, publishing it, integrating it into a Nextjs/React site, and even discussing some high-level thoughts on running this in a production startup!”</p>\n</blockquote>\n<p>\\</p>\n<p>:::info\n<strong>Congratulations to the big winner, <a href=\"https://hackernoon.com/u/kevinstubbs\">Kevin Stubbs</a>! You have won $3000, 10M Coze Tokens, and 1 Month of Coze Premium Plus membership!</strong></p>\n<p>:::</p>\n<hr />\n<h3 id=\"top2cozeexperiencestories\">Top 2 Coze Experience Stories</h3>\n<p><a href=\"https://hackernoon.com/coze-a-love-story?embedable=true\">https://hackernoon.com/coze-a-love-story?embedable=true</a></p>\n<p>\\</p>\n<blockquote>\n  <p>“Whether it's for personal projects or more complex, professional applications, Coze continues to be the backbone of my bot-building adventures. Here's to the next evolution, whatever that may bring!”</p>\n</blockquote>\n<p><a href=\"https://hackernoon.com/say-goodbye-to-ai-hallucinations-a-simple-method-to-improving-the-accuracy-of-your-rag-system?embedable=true\">https://hackernoon.com/say-goodbye-to-ai-hallucinations-a-simple-method-to-improving-the-accuracy-of-your-rag-system?embedable=true</a></p>\n<p>\\</p>\n<blockquote>\n  <p>“One major advantage of the Coze platform is its unique pricing model. In addition to the traditional token-based billing model,&nbsp;Coze also adopts a message-based pricing method.&nbsp;This means that&nbsp;<strong>the cost of each message exchange between the user and the assistant is fixed and will not increase due to the use of more tokens on LLM.”</strong></p>\n</blockquote>\n<p>\\</p>\n<p>:::info\n<strong>Big congrats to <a href=\"https://hackernoon.com/u/fibonacci\">@fibonacci</a> and <a href=\"https://hackernoon.com/u/jim60105\">@jim60105</a>!! You both have won $1000, 5M Coze Tokens, and 1 Month of Coze Premium!</strong></p>\n<p>:::</p>\n<hr />\n<h3 id=\"top2aichatbotstories\">Top 2 AI Chatbot Stories</h3>\n<p><a href=\"https://hackernoon.com/how-to-turn-your-openapi-specification-into-an-ai-chatbot-with-rag?embedable=true\">https://hackernoon.com/how-to-turn-your-openapi-specification-into-an-ai-chatbot-with-rag?embedable=true</a></p>\n<p>\\</p>\n<blockquote>\n  <p>“The integration of LLM with vector search opens new possibilities for automating documentation, which is especially beneficial for startups and teams with limited resources.”</p>\n</blockquote>\n<p><a href=\"https://hackernoon.com/building-a-somewhat-intelligent-agent?embedable=true\">https://hackernoon.com/building-a-somewhat-intelligent-agent?embedable=true</a></p>\n<p>\\</p>\n<p>:::info\n<strong>Congratulations <a href=\"https://hackernoon.com/u/dm1tryg\">Dmitrii Galkin</a> and <a href=\"https://hackernoon.com/u/aka\">Akalanka Weerasooriya</a>!! Each of you will receive $500, 5M Coze Token, and 1 Month Coze Premium!</strong></p>\n<p>:::</p>\n<hr />\n<h3 id=\"bestnocodestory\">Best NoCode Story</h3>\n<p><a href=\"https://hackernoon.com/pawsitive-results-how-to-build-the-ultimate-puppy-trainer-ai-chatbot-with-coze?embedable=true\">https://hackernoon.com/pawsitive-results-how-to-build-the-ultimate-puppy-trainer-ai-chatbot-with-coze?embedable=true</a></p>\n<p>\\</p>\n<blockquote>\n  <p>“As for Coze,&nbsp;I can definitely recommend it. As I said initially, the platform is super easy to use. I can’t imagine that building even your first bot can be so effortlessly and fun. I’d also highlight the flexibility provided by different modes and various plugins. You literally can make a bot for anything.”</p>\n</blockquote>\n<p>\\</p>\n<p>:::info\n<strong>Congratulations <a href=\"https://hackernoon.com/u/marcushaldd\">Daria Leonova</a>!! You have won $500, 5M Coze Tokens, and 1 Month Coze Premium!</strong></p>\n<p>:::</p>\n<hr />\n<h2 id=\"top5cozepowerwritersrewards\"><strong>Top 5 Coze Power Writers’ Rewards</strong></h2>\n<p><a href=\"https://hackernoon.com/crypto-investment-assistant-how-i-built-a-chatbot-that-simplifies-portfolio-management-with-coze?embedable=true\">https://hackernoon.com/crypto-investment-assistant-how-i-built-a-chatbot-that-simplifies-portfolio-management-with-coze?embedable=true</a></p>\n<p><a href=\"https://hackernoon.com/a-public-procurement-research-chatbot-using-coze?embedable=true\">https://hackernoon.com/a-public-procurement-research-chatbot-using-coze?embedable=true</a></p>\n<p><a href=\"https://hackernoon.com/how-to-build-a-recipe-generator-ai-chatbot-with-coze?embedable=true\">https://hackernoon.com/how-to-build-a-recipe-generator-ai-chatbot-with-coze?embedable=true</a></p>\n<p><a href=\"https://hackernoon.com/how-i-built-the-nigerian-news-reporter-to-deliver-real-time-verified-news-in-local-languages?embedable=true\">https://hackernoon.com/how-i-built-the-nigerian-news-reporter-to-deliver-real-time-verified-news-in-local-languages?embedable=true</a></p>\n<p><a href=\"https://hackernoon.com/how-to-configureintegrate-a-chatbot-ai-in-chat-translator-built-with-coze-into-telegram-chat?embedable=true\">https://hackernoon.com/how-to-configureintegrate-a-chatbot-ai-in-chat-translator-built-with-coze-into-telegram-chat?embedable=true</a></p>\n<p>\\</p>\n<p>:::info\n<strong>Congratulations to <a href=\"https://hackernoon.com/u/emmanuelaj\">Emmanuel Ajala</a>, <a href=\"https://hackernoon.com/u/kickboxerj\">Kickboxer J</a>, <a href=\"https://hackernoon.com/u/bennykillua\">killua</a>, <a href=\"https://hackernoon.com/u/ileolami\">Ileolami</a>, and <a href=\"https://hackernoon.com/u/diamondolmd\">Diamond</a>!! You all have won 1 Month of Coze Premium!</strong></p>\n<p>:::</p>\n<hr />\n<p><strong>A big congratulations to all the winners of this contest! Our team truly enjoyed reading your stories. Best of luck to all the finalists in future contests, and thank you for your dedication and hard work—it really showed!</strong></p>\n<p>\\</p>\n<h2 id=\"howtoclaimyourhackernoonwritingcontestprize\">How to Claim Your HackerNoon Writing Contest Prize</h2>\n<ul>\n<li>Contact&nbsp;<strong>yes-reply@hackernoon.com</strong>&nbsp;and&nbsp;<strong>sidra@hackernoon.com</strong>&nbsp;from the email address linked to your winning HackerNoon account.</li>\n<li>We will validate your claim and share a form requesting your details for reward distribution.</li>\n<li>You’ll receive your winnings in 2-4 weeks after completing the form.</li>\n</ul>\n<hr />\n<p>:::warning\n<strong>Note: You must contact us within 60 days of the winners’ announcement to claim your reward.</strong></p>\n<p>:::</p>\n<hr />\n<h3 id=\"readytobeahackernooncontestwinner\"><strong>Ready to be a HackerNoon Contest Winner?</strong></h3>\n<p>:::tip\nWe’ve got plenty of contests waiting for you!</p>\n<p>Head over to&nbsp;<strong><a href=\"https://contests.hackernoon.com/?ref=hackernoon.com\">contests.hackernoon.com</a></strong>&nbsp;to see what's up for grabs and maybe snag a spot on our next winners' list!</p>\n<p>:::</p>\n<p>Good luck! </p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Hash-Based Integrity Checking Proposed For Linux To Help With Reproducible Builds","url":"https://www.phoronix.com/news/Hash-Based-Integrity-Linux-RB","date":1735210815,"author":"Michael Larabel","unread":true,"desc":"","content":"An interesting request for comments (RFC) patch series was posted on Christmas for introducing hash-based integrity checking to help with the reproducible builds initiative around the Linux kernel...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bald Eagle Officially Declared US National Bird After 250 Years","url":"https://news.slashdot.org/story/24/12/26/0854206/bald-eagle-officially-declared-us-national-bird-after-250-years?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735203660,"author":"msmash","unread":true,"desc":"","content":"The bald eagle is now officially the national bird of the US, after President Joe Biden signed a law on Christmas Eve bestowing the honour upon the white-headed and yellow-beaked bird of prey. BBC News: The bird has been a national emblem in the US for years, appearing on the Great Seal of the US -- used on US documents -- since 1782. But it had not been officially designated to be the national bird until Congress passed the bill last week, sending it to Biden's desk to be signed. \n\n\"For nearly 250 years, we called the bald eagle the national bird when it wasn't,\" said Jack Davis, co-chair of the National Bird Initiative for the National Eagle Center, in a statement. \"But now the title is official, and no bird is more deserving.\" Not everyone has always agreed about the national status of the bald eagle. Founding Father Benjamin Franklin objected to the creature being chosen to represent the country, calling it a \"bird of bad moral character.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bald+Eagle+Officially+Declared+US+National+Bird+After+250+Years%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0854206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0854206%2Fbald-eagle-officially-declared-us-national-bird-after-250-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/0854206/bald-eagle-officially-declared-us-national-bird-after-250-years?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561553&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"This Holiday Season, HackerNoon is at Your Service 🎁 🫡","url":"https://hackernoon.com/this-holiday-season-hackernoon-is-at-your-service?source=rss","date":1735203058,"author":"Hack Marketing with HackerNoon for Businesses","unread":true,"desc":"","content":"<p>\\\nIt's that time of year when you want to sit back and relax with family and friends. We are here to make your content marketing and distribution experience super seamless, so you do not need to spend hours creating new content and finding ways to distribute it. </p>\n<p>\\\nRepurpose, republish, and&nbsp;<strong><a href=\"https://hackernoon.com/reach-more-readers-boost-your-story-on-hackernoon\">redistribute your existing content</a></strong>&nbsp;with HackerNoon! \\n  \\n This festive season, we bring you&nbsp;<strong><a href=\"https://app.hackernoon.com/services\">HackerNoon Services</a></strong>&nbsp;- your one-stop shop to navigate and explore all the ways to boost your brand growth in one place with brand-new offerings and massive discounts.</p>\n<p>\\\nYou can now self-check nearly any brand offering on HackerNoon. Whether it be our good old&nbsp;<strong><a href=\"https://hackernoon.com/p/services/about/business-blogging\">Business Blogging offerings</a></strong>&nbsp;or fresh features like&nbsp;<strong><a href=\"https://hackernoon.com/p/services/story-translations\">Story Translations</a></strong>&nbsp;and&nbsp;<strong><a href=\"https://hackernoon.com/p/services/story-boost\">Story Boosts</a></strong>&nbsp;- find the right fit to distribute or redistribute your content on HackerNoon.&nbsp;WITHOUT. ANY. NEED. TO. SPEAK. TO. A. HUMAN. \\n </p>\n<p>:::tip\nP.S. If you need to speak to a human to learn more about these services, feel free to&nbsp;<strong><a href=\"https://calendly.com/hackernoon\">book a meeting</a></strong></p>\n<p>:::</p>\n<p>\\</p>\n<h2 id=\"featuredservice1hackernoonnewsletterdiscountoffer\">Featured Service #1: HackerNoon Newsletter Discount Offer</h2>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/hQ098u52DzPm2Y4UITQcQXtLRAk2-v713051.jpeg\" alt=\"\" /></p>\n<p>\\\nFor those looking for lead generation - a few&nbsp;<strong><a href=\"https://hackernoon.com/p/services/hackernoon-newsletter\">newsletter slots are still up for grabs at a&nbsp;50% discount</a></strong>! \\n  \\n HackerNoon is home to a diverse community of technology enthusiasts, entrepreneurs, industry professionals, and forward-thinking businesses who contribute to a 100k+ strong repository of niche insights. \\n  \\n Every week, hundreds of stories are published, and our dedicated editors curate a daily selection of 5 top stories. Delivered at noon, this service is free, convenient, and offers immense value to anyone interested in technology. \\n  \\n This is the reason it is the most-beloved newsletter for tech enthusiasts. \\n  \\n Here are the quick stats: \\n </p>\n<ul>\n<li><p>Subscribers: 400,000+ 📈</p></li>\n<li><p>Audience: 80%+ reside in the US 🌎</p></li>\n<li><p>Open Rate: 10-15% 🔥</p></li>\n<li><p>Clicks on Daily AD Units: 500+ 💰</p></li>\n<li><p>Sample here 📥</p></li>\n</ul>\n<p>\\</p>\n<p>:::tip\n<a href=\"https://hackernoon.com/p/services/hackernoon-newsletter\">Buy 1 day of Newsletter Ads for $499!</a></p>\n<p>:::</p>\n<h2 id=\"featuredservice2hackernoonstoryboost\">Featured Service #2: HackerNoon Story Boost</h2>\n<p>As the name suggests,&nbsp;<strong><a href=\"https://hackernoon.com/p/services/story-boost?ref=hackernoon.com\">Story Boost</a></strong>&nbsp;is a feature designed to amplify your content by showcasing it on: \\n  \\n The HackerNoon Homepage:&nbsp;Position your story as valuable and noteworthy while boosting your reputation as a thought leader. \\n The HackerNoon Newsletter:&nbsp;Gain exposure to an engaged audience of 400,000+ tech and business enthusiasts. \\n  \\n At the unbeatable&nbsp;<strong><a href=\"https://hackernoon.com/p/services/story-boost\">introductory price of $159.99</a></strong>, you can now redistribute your past content on HackerNoon's prime placements.</p>\n<p>\\\n <img src=\"https://cdn.hackernoon.com/images/hQ098u52DzPm2Y4UITQcQXtLRAk2-d223074.jpeg\" alt=\"\" /></p>\n<p>:::tip\n<a href=\"https://hackernoon.com/p/services/story-boost\">Boost Your Story @ $159.99 NOW!</a></p>\n<p>:::</p>\n<p>\\</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Japan Airlines Hit By Cyberattack, Delaying Flights During Year-End Holiday Season","url":"https://it.slashdot.org/story/24/12/26/0544247/japan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735198200,"author":"msmash","unread":true,"desc":"","content":"Japan Airlines said it was hit by a cyberattack Thursday, causing delays to more than 20 domestic flights but the carrier said there was no impact on flight safety. From a report: JAL said the problem started Thursday morning when the company's network connecting internal and external systems began malfunctioning. The airline said the cyberattack had delayed 24 domestic flights for more than 30 minutes, and the impact could expand later in the day.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Japan+Airlines+Hit+By+Cyberattack%2C+Delaying+Flights+During+Year-End+Holiday+Season%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F0544247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F26%2F0544247%2Fjapan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/26/0544247/japan-airlines-hit-by-cyberattack-delaying-flights-during-year-end-holiday-season?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561483&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"PharmEasy investor cuts value of its stake drastically, implying new valuation of $456M","url":"https://techcrunch.com/2024/12/25/pharmeasy-valued-at-456-million-vs-peak-5-6-billion-investor-data-shows/","date":1735195760,"author":"Manish Singh","unread":true,"desc":"","content":"<p>Indian online pharmacy PharmEasy is now being valued at about $456 million after its investor Janus Henderson said in a filing that it valued its stake of 12.9 million shares in the startup at $766,043. The asset manager&#8217;s Global Research Fund had originally spent $9.4 million to acquire these shares. This valuation is 92% less [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bluesky is testing a trending topics feature","url":"https://techcrunch.com/2024/12/25/bluesky-starts-testing-a-trending-topics-feature/","date":1735194119,"author":"Ivan Mehta","unread":true,"desc":"","content":"<p>Social network Bluesky said on Christmas that it is testing a trending topics view. The trending topics are visible both on the desktop and mobile apps of the social network for users across the world. On the desktop, you can see trending topics on the right sidebar, and on the mobile app, you can tap [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Germany Joins EU's 'Ultra-Low' Fertility Club","url":"https://news.slashdot.org/story/24/12/26/0333203/germany-joins-eus-ultra-low-fertility-club?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735189200,"author":"msmash","unread":true,"desc":"","content":"Three more EU member states -- including the most populous, Germany -- have joined the list of countries with \"ultra-low\" fertility rates [non-paywalled source], highlighting the extent of the region's demographic challenges. Financial Times: Official statistics show Germany's birth rate fell to 1.35 children per woman in 2023, below the UN's \"ultra-low\" threshold of 1.4 -- characterising a scenario where falling birth rates become tough to reverse. \n\nEstonia and Austria also passed under the 1.4 threshold, joining the nine EU countries -- including Spain, Greece and Italy -- that in 2022 had fertility rates below 1.4 children per woman. The fall in birth rates partially reflects the \"postponement of parenthood until the 30s,\" which involves a \"higher likelihood that you will not have as many children as you would like because of the biological clock,\" said Willem Adema, senior economist at the OECD.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Germany+Joins+EU's+'Ultra-Low'+Fertility+Club%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0333203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F26%2F0333203%2Fgermany-joins-eus-ultra-low-fertility-club%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/26/0333203/germany-joins-eus-ultra-low-fertility-club?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561425&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Apple Explains Why It Doesn't Plan To Build a Search Engine","url":"https://apple.slashdot.org/story/24/12/26/0255257/apple-explains-why-it-doesnt-plan-to-build-a-search-engine?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735181760,"author":"msmash","unread":true,"desc":"","content":"Apple has no plans to develop its own search engine despite potential restrictions on its lucrative revenue-sharing deal with Google, citing billions in required investment and rapidly evolving AI technology as key deterrents, according to a court filing [PDF]. \n\nIn a declaration filed with the U.S. District Court in Washington, Apple Senior Vice President Eddy Cue said creating a search engine would require diverting significant capital and employees, while recent AI developments make such an investment \"economically risky.\" \n\nApple received approximately $20 billion from Google in 2022 under a deal that makes Google the default search engine on Safari browsers. This arrangement is now under scrutiny in the U.S. government's antitrust case against Google. \n\nCue said Apple lacks the specialized professionals and infrastructure needed for search advertising, which would be essential for a viable search engine. While Apple operates niche advertising like the App Store, search advertising is \"outside of Apple's core expertise,\" he said. Building a search advertising business would also need to be balanced against Apple's privacy commitments, according to his declaration.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Explains+Why+It+Doesn't+Plan+To+Build+a+Search+Engine%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F26%2F0255257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F26%2F0255257%2Fapple-explains-why-it-doesnt-plan-to-build-a-search-engine%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/12/26/0255257/apple-explains-why-it-doesnt-plan-to-build-a-search-engine?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561403&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Russia Bans Crypto Mining in Multiple Regions, Citing Energy Concerns","url":"https://hardware.slashdot.org/story/24/12/25/2232247/russia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735173000,"author":"msmash","unread":true,"desc":"","content":"The Russian government has banned crypto mining in ten regions for a period of six years, according to reporting by the state-owned news agency Tass. Engadget adds: Russia has cited the industry's high power consumption rates as the primary reason behind the ban. Crypto is particularly power-hungry, as mining operations already account for nearly 2.5 percent of US energy use. \n\nThis ban takes effect on January 1 and lasts until March 15, 2031. The country's Council of Ministers has also stated that additional bans may be required in other regions during periods of peak energy demand. It could also go the other way. The ban could be temporarily lifted or altered in certain regions if a government commission examines changes in energy demand and deems it necessary.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russia+Bans+Crypto+Mining+in+Multiple+Regions%2C+Citing+Energy+Concerns%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F25%2F2232247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F25%2F2232247%2Frussia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/24/12/25/2232247/russia-bans-crypto-mining-in-multiple-regions-citing-energy-concerns?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561267&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Porch Pirates Are Now Raising the Price You Pay at Checkout","url":"https://slashdot.org/story/24/12/25/2222227/porch-pirates-are-now-raising-the-price-you-pay-at-checkout?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735167660,"author":"msmash","unread":true,"desc":"","content":"Lost deliveries, shipping delays and theft on the front porch have become such growing problems that companies are making consumers pay for package protection. From a report: Tens of thousands of online retailers now offer the service for a few dollars per order. The fees go to young companies -- Route and Corso, to name two -- that promise to make customers whole without charging the merchant if a delivery doesn't arrive. Consumers are finding that retailers either ask them to pay for package protection or draw a harder line when it comes to replacing a missing item. Some retailers are making the fees mandatory, spreading the burden of package theft among all customers. \n\nTo know whether you are paying the fee, review your order before you press purchase. Sometimes it is named after the company offering protection, and sometimes it is called shipping insurance or package protection. Skincare brand Topicals began using Corso two years ago after seeing 30% of its packages were regularly marked delivered but not received, according to customer insights manager Deja Jefferson. By requiring protection, which Topicals discloses on its shipping page, the company doesn't have to worry about convincing customers to opt in. \"We actually don't get any complaints on it whatsoever,\" she said. Further reading: Porch Pirates Steal So Many Packages That Now You Can Get Insurance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Porch+Pirates+Are+Now+Raising+the+Price+You+Pay+at+Checkout%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F25%2F2222227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F25%2F2222227%2Fporch-pirates-are-now-raising-the-price-you-pay-at-checkout%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/12/25/2222227/porch-pirates-are-now-raising-the-price-you-pay-at-checkout?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561257&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft Edge Takes a Victory Lap With Some High-Looking Usage Stats For 2024","url":"https://it.slashdot.org/story/24/12/25/224231/microsoft-edge-takes-a-victory-lap-with-some-high-looking-usage-stats-for-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735164300,"author":"msmash","unread":true,"desc":"","content":"An anonymous reader shares a report: Microsoft has published a year in review for its Edge browser and talked up AI-powered chats while lightly skipping over the software's stagnating market share. The company had some big numbers to share. There had been over 10 billion AI-powered chats with Copilot from inside the Edge browser window (although it did not disclose how many chats were customers asking how to install Chrome). Some 38 trillion characters had been auto-translated. Seven trillion megabytes of PC memory had been saved through the use of sleeping tabs. \n\nHowever, are those numbers actually as big as they seem? What Microsoft did not say is how little Edge has moved the needle on market share in 2024. Strangely, the company did not share raw usage information. Yet, a look at Statcounter's figures for browser desktop market share showed Edge with 11.9 percent of the market in December 2023 and reaching 12.87 percent by November 2024 -- an increase of less than 1 percent. The market leader, Google's Chrome browser, went from 65.23 percent to 66.33 percent in the same period. That's only slightly more than 1 percent, but it still maintains its dominance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Edge+Takes+a+Victory+Lap+With+Some+High-Looking+Usage+Stats+For+2024%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F25%2F224231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F25%2F224231%2Fmicrosoft-edge-takes-a-victory-lap-with-some-high-looking-usage-stats-for-2024%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/12/25/224231/microsoft-edge-takes-a-victory-lap-with-some-high-looking-usage-stats-for-2024?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561247&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Elon Musk’s xAI lands $6B in new cash to fuel AI ambitions","url":"https://techcrunch.com/2024/12/25/elon-musks-xai-lands-billions-in-new-cash-to-fuel-ai-ambitions/","date":1735157820,"author":"Kyle Wiggers","unread":true,"desc":"","content":"<p>Updated December 25, 12:21 p.m. Pacific: Added details of xAI&#8217;s valuation and Kingdom Holdings&#8217; contribution. xAI, Elon Musk&#8217;s AI company, has raised $6 billion in a Series C financing round. The company announced this week that Andreessen Horowitz , Blackrock, Fidelity, Lightspeed, MGX, Morgan Stanley, OIA, QIA, Sequoia Capital, Valor Equity Partners, Vy Capital, Nvidia, [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Apple Is Not Losing Google's Billions Without a Fight","url":"https://apple.slashdot.org/story/24/12/25/1911259/apple-is-not-losing-googles-billions-without-a-fight?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735153860,"author":"msmash","unread":true,"desc":"","content":"Apple may be worth one and a half Googles now, but the world's most valuable company needs its relationship with the world's largest search engine to keep clicking. From a report: Such was evident Monday when Apple filed papers seeking to participate in the penalty phase of the Justice Department's antitrust case against Google. The search giant lost that case in August and is now battling the government over what remedies are appropriate. The DOJ has a long wish list that includes breaking the company up, forcing Google to make key search and user data available to potential rivals, and stopping the payments Google makes to partners such as Apple. \n\nThe payments to Apple alone now reportedly equate to about $20 billion annually, and make Google the default search engine on devices like the iPhone. Apple didn't confirm any specific amounts in its filing, but did say the company feels compelled to \"protect its commercial interests.\" Analysts widely estimate that the payments from Google are nearly pure profit for Apple, given relatively little incremental cost to generate that revenue. For Apple, $20 billion is about 16% of the operating income reported for the company's fiscal year that ended in September.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Is+Not+Losing+Google's+Billions+Without+a+Fight%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F25%2F1911259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F12%2F25%2F1911259%2Fapple-is-not-losing-googles-billions-without-a-fight%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/12/25/1911259/apple-is-not-losing-googles-billions-without-a-fight?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=23561151&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Linux RNDIS Removal Branch Updated For Disabling Microsoft RNDIS Protocol Drivers","url":"https://www.phoronix.com/news/Linux-RNDIS-Removal-EOY2024","date":1735147999,"author":"Michael Larabel","unread":true,"desc":"","content":"There's activity again around potentially disabling and then ultimately removing the RNDIS Linux kernel code for those drivers complying with the Microsoft Remote Network Driver Interface Specification (RNDIS) protocol specification. RNDIS was used atop USB for virtual Ethernet but has proven insecure and problematic...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"$132K – $149K, here’s what seed-stage founders pay early employees, based on data","url":"https://techcrunch.com/2024/12/25/132k-149k-heres-what-seed-stage-founders-pay-early-employees-based-on-data/","date":1735147659,"author":"Julie Bort","unread":true,"desc":"","content":"<p>Once a startup has raised its seed round, the perennial question becomes how much should the founders pay themselves and their first few employees? Kruze Consulting, a CPA firm that specializes in venture-backed startups, recently analyzed average salary ranges for over 450 seed-stage startups and shared that data with TechCrunch. The following averages are based [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"GV, the VC team backed by Google, has a broad remit, but it can’t do one thing","url":"https://techcrunch.com/2024/12/25/gv-the-vc-team-backed-by-google-has-a-broad-remit-but-it-cant-do-one-thing/","date":1735147347,"author":"Connie Loizos","unread":true,"desc":"","content":"<p>David Krane is in an enviable position. As the CEO of GV, the venture firm that is funded entirely by Google to the tune of $1 billion a year, his team of roughly 100 gets to make a lot of bets — with just a couple of notable restrictions. During a TechCrunch StrictlyVC event in [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"AMD’s CES 2025 press conference: How to watch","url":"https://techcrunch.com/2024/12/25/amds-ces-2025-press-conference-how-to-watch/","date":1735142400,"author":"Brian Heater","unread":true,"desc":"","content":"<p>AMD has its work cut out for it at CES 2025. Competitor Nvidia has been sucking the oxygen out of every room it graces, as the chipmaker remains at the forefront of the AI boom. So, how will AMD compete with Nvidia’s reported RTX 5000 announcement? The company should show off its own next-gen GPU. [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Coming to Theaters: An AI-Generated Bollywood Movie","url":"https://spectrum.ieee.org/ai-movie","date":1735138802,"author":"Edd Gent","unread":true,"desc":"","content":"<p>Makers of the first AI feature film confront the tech's continuity problems </p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM4NzA3OC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTczOTI1NDUzM30.oEbWKHcVDoAf8I3nOLlO-wddngh7Y8StCUTeeIJi14U/image.png?width=600","enclosureMime":""},{"title":"systemd Highlights For 2024 From Run0 To Varlink To Advancing systemd-homed","url":"https://www.phoronix.com/news/systemd-2024-highlights","date":1735138002,"author":"Michael Larabel","unread":true,"desc":"","content":"Systemd had another busy year working on many new features from run0 as a sudo alternative to making systemd-homed more robust, increasing Varlink use, systemd-boot continuing to gain more traction, and more...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Top 8 Consumer Electronics Stories of 2024","url":"https://spectrum.ieee.org/top-consumer-electronics-2024","date":1735135202,"author":"Matthew S. Smith","unread":true,"desc":"","content":"<p>\"Re-buttonization,\" Meta's pricey AR glasses, and the story of the first Fitbit</p>","flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NTM1MjIyMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTczOTQ5Mzc0NX0.GAnviXGsiVcrMq0QYSMfiHbsdEzZvgGZWliepv4qNdA/image.jpg?width=600","enclosureMime":""},{"title":"Home for the holidays? Share this top cybersecurity advice with friends and family","url":"https://techcrunch.com/2024/12/25/home-for-the-holidays-share-this-top-cybersecurity-advice-with-friends-and-family/","date":1735131630,"author":"Zack Whittaker","unread":true,"desc":"","content":"<p>Sharing security advice can go a long way in protecting your loved ones from the most common and damaging online threats. </p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Intel Mesa Code Lands Big Patch Series For Treating Convergent Values As SIMD8","url":"https://www.phoronix.com/news/Intel-Mesa-Conv-SIMD8","date":1735127166,"author":"Michael Larabel","unread":true,"desc":"","content":"A patch series six months in the making and consisting of 24 patches by longtime Intel Linux graphics engineer Ian Romanick was merged on Christmas Eve for Mesa 25.0...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Ruby 3.4 Programming Language Brings \"it\", Better Performance For YJIT","url":"https://www.phoronix.com/news/Ruby-3.4-Released","date":1735124990,"author":"Michael Larabel","unread":true,"desc":"","content":"Ruby 3.4 is out today as yet another annual major feature release for this programming language known for its major updates on Christmas Day...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"New Intel Mesa Driver Patches Implement AV1 Decode For Vulkan Video","url":"https://www.phoronix.com/news/Intel-ANV-Vulkan-Video-AV1-Dec","date":1735120800,"author":"Michael Larabel","unread":true,"desc":"","content":"While there has been Vulkan Video support within Intel's open-source \"ANV\" driver since early 2023 and extended over time to handle H.265/HEVC decode, H.264 and H.265 encode, and more, the AV1 decode support has lagged behind until now...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"CachyOS Had A Really Great Year Advancing This Performance-Optimized Arch Linux Platform","url":"https://www.phoronix.com/news/CachyOS-2024-Highlights","date":1735113600,"author":"Michael Larabel","unread":true,"desc":"","content":"The CachyOS Linux distribution has really been on fire this year delivering impressive new features and performance optimizations for this Arch Linux derived OS...","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Rust Drama, Russian Kernel Maintainers & Other Top Linux Kernel Happenings Of 2024","url":"https://www.phoronix.com/news/Top-Linux-Kernel-News-2024","date":1735074724,"author":"Michael Larabel","unread":true,"desc":"","content":"With 2024 drawing quickly toward a close, here is a look back at the most popular Linux kernel news of the year ranging from exciting performance optimizations and new features such as QR code error messages over to kernel drama around Russian kernel developers, Bcachefs disturbances, and the contentious growing Rust programming language use within the kernel...","flags":null,"enclosureUrl":"","enclosureMime":""}]}