{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Australia considering joining 'coalition of the willing' for Ukraine amid talks with Starmer","url":"https://kyivindependent.com/australia-considering-joining-coalition-of-the-willing-for-ukraine-following-talks-with-starmer/","date":1741504617,"author":"/u/eaglemaxie","guid":660,"unread":true,"content":"<p>Australia is considering joining the European-led coalition of the willing to support a lasting ceasefire in Ukraine, a statement issued by U.K. Prime Minister Keir Stamer's office read on March 8.</p><p>Starmer <a href=\"https://kyivindependent.com/europe-developing-coalition-of-the-willing-to-back-ceasefire-in-ukraine-starmer-says/\"></a> on March 2 that a number of European nations, including the U.K. and France, are developing a 'coalition of the willing' that will include \"planes in the air and boots on the ground\" in an effort to secure a successful ceasefire in Ukraine.</p><p>Following a phone call with Australian Prime Minister Anthony Albanese, Starmer's office <a href=\"https://www.gov.uk/government/news/pm-call-with-prime-minister-albanese-of-australia-8-march-2025\"></a> that the U.K. prime minister \"welcomed Prime Minister Albanese’s commitment to consider contributing to a coalition of the willing for Ukraine.\"</p><p>Responding to reporters questions on March 3, Albanese said Australia was \"ready to assist\" with \"proposals going forward\" on Ukraine, hinting that his government would be open to contributing to a joint force.</p><p>The U.K. and France have spearheaded the idea of deploying <a href=\"https://kyivindependent.com/tag/peacekeepers/\"></a> in Ukraine to monitor a potential ceasefire. Despite the progress on talks, Starmer warned that for any coalition to succeed, Europe must \"have strong U.S. backing.\"</p><p>Starmer did not specify which other countries would participate in the coalition, but added that \"a number of countries have indicated they want to be part of the plan we're developing.\"</p><p>A U.K. official confirmed on March 6 that talks were being held with about 20 countries consisting of \"largely European and Commonwealth partners\" — without specifying the participants. </p><p>Thus far, a number of countries have expressed openness to joining the coalition, including <a href=\"https://kyivindependent.com/canada-voices-willingness-to-partake-in-ukraine-peacekeeping-mission/\"></a>, Ireland, and <a href=\"https://kyivindependent.com/turkey-considers-sending-troops-to-ukraine-as-part-of-peacekeeping-force-bloomberg-reports/\"></a>among others.</p>","contentLength":1611,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j729sc/australia_considering_joining_coalition_of_the/"},{"title":"Poland's PM on latest Russian strikes on Ukraine: This is what happens when someone appeases barbarians","url":"https://www.pravda.com.ua/eng/news/2025/03/8/7501905/","date":1741481709,"author":"/u/Silly-avocatoe","guid":667,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6vs9i/polands_pm_on_latest_russian_strikes_on_ukraine/"},{"title":"Canada to name a new leader while dealing with Trump trade war","url":"https://abcnews.go.com/Business/wireStory/canada-new-leader-dealing-trump-trade-war-119566966","date":1741472343,"author":"/u/kpo987","guid":665,"unread":true,"content":"<p>TORONTO (AP) — <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/hub/canada\">Canada</a> looks set to pick a measured former central banker to deal with the threats <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/hub/donald-trump\">President Donald Trump's</a> tariffs pose against a pillar of Western free trade.</p><p><a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/mark-carney-canada-prime-minister-liberal-party-11301d6a66f5b5d859bc883437cc8b9f\">Mark Carney</a>, 59, could become the next prime minister when the governing Liberal Party of Canada announces a replacement for <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/hub/justin-trudeau\">Justin Trudeau</a> in a leadership vote Sunday.</p><p>The opposition Conservatives hoped to make the election about Trudeau, whose popularity declined as food and housing prices rose and immigration surged. Trudeau announced his resignation in January but remains prime minister until a successor is chosen. Election laws mandate a vote before October but one is expected sooner. </p><p>Trump’s <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/tariffs-trump-economy-mexico-canada-bfed103a11a2a71d8353350f94c78814\">trade war</a> and his <a data-testid=\"prism-linkbase\" href=\"https://apnews.com/article/canada-trump-tariffs-trudeau-trade-opposition-border-5d3dbbb4a701bb1676ee588bfbf2396a\">talk of making Canada the 51st state</a> have infuriated Canadians, who are booing the American anthem at NHL and NBA games. Some are cancelling trips south and many are avoiding buying American goods when they can.</p><p>The surge in Canadian nationalism has bolstered the Liberal Party’s chances in Parliamentary elections that are expected within days or weeks, and Liberal showings have been improving steadily in opinion polls.</p><p>After decades of bilateral stability, the vote on Canada’s next leader now is expected to focus on who is best equipped to deal with the United States. </p><p>Carney navigated crises when he was the head of Canada’s central bank and when he became the first non-citizen to run the Bank of England since it was founded in 1694. </p><p>His appointment won bipartisan praise in Britain after Canada recovered from the 2008 financial crisis faster than many other countries.</p><p>Carney is credited with keeping money flowing through the Canadian economy by acting quickly in cutting interest rates to their lowest level ever of 1%, working with bankers to sustain lending through the crisis and, critically, letting the public know rates would remain low so they would keep borrowing.</p><p>And it wasn’t just that he had good policies — he sold them to the public in a way everyone could understand. He was the first central banker to commit to keep them at a historic low for a definite time, a step the U.S. Federal Reserve would follow.</p><p>Carney has picked up one endorsement after another from Cabinet ministers and members of Parliament since declaring his candidacy in January.</p><p>The other top Liberal leadership candidate is former Deputy Prime Minister Chrystia Freeland. Trudeau told Freeland in December he no longer wanted her as finance minister, but that she could remain deputy prime minister and the point person for U.S.-Canada relations. Freeland resigned shortly after, releasing a scathing letter about the government that proved to be the last straw for Trudeau.</p><p>Three points turned the leadership race into a runaway for Carney. Freeland had a long association with the unpopular Trudeau. Carney worked hard to gather support from Liberal members of Parliament members. And Trump’s tariff fixation was also pivotal, said Nelson Wiseman, professor emeritus at the University of Toronto. </p><p>“Liberal backbenchers feared losing their seats and knew that Carney was more electable as their leader than Freeland,” Wiseman said. </p><p>The Liberal Party members will pick a new leader in a secret vote by about 140,000 members that will be announced on Sunday. The new leader is expected to trigger an election shortly afterward. Either the new Liberal party leader will call one, or the opposition parties in Parliament could force one with a no-confidence vote this month. </p><p>Daniel Béland, a political science professor at McGill University in Montreal, said Carney’s calm demeanor and outstanding resume make him a reassuring figure to many Canadians at a time when Trump is going after their country’s economy and sovereignty.</p><p>Béland said that style and profile stands in strong contrast to the Conservative Party's Pierre Poilievre, whom he called a true career politician who has embraced a populist rhetoric not unlike Trump's. </p><p>Poilievre, 45, for years the party’s go-to attack dog, is a firebrand populist who says he will to put “Canada first.” He attacks the mainstream media and vows to defund Canada’s public broadcaster and cut taxes. </p><p>“That works with his base but that is not welcomed by other Canadians, especially considering what the U.S. president is now saying about, and doing to, their country,” Béland said. </p><p>Poilievre urged Trump on Friday stop the attacks on Canada and “the monthly melodrama that is hurting our economies on both side of the border.\"</p>","contentLength":4497,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6skkc/canada_to_name_a_new_leader_while_dealing_with/"},{"title":"US shares intelligence with Ukraine for defense, not for attacks on Russian troops, CNN reports","url":"https://kyivindependent.com/us-continuing-to-share-some-intelligence-with-ukraine-solely-for-defense-purposes-cnn-reports/","date":1741464445,"author":"/u/eaglemaxie","guid":659,"unread":true,"content":"<p>The U.S. continues to share some intelligence with Ukraine to assist with defense operations, but not for attacks on Russian troops, CNN reported on March 7, citing two anonymous defense officials.</p><p>According to the <a href=\"https://kyivindependent.com/us-continuing-to-share-some-intelligence-with-ukraine-solely-for-defense-purposes-cnn-reports/sources\">sources</a>, Washington aims to avoid being seen as directly supporting strikes on Russia. However, the U.S. is not withholding information that could enhance Ukraine's defensive capabilities.</p><p>The significant cutting back on U.S. intelligence sharing to Ukraine is part of the Trump administration’s position to pressure Kyiv into quick negotiations with Russia.</p><p>The sources also confirmed that <a href=\"https://kyivindependent.com/tag/starlink/\">Starlink</a>, which the Ukrainian military relies on, is still operating in Ukraine as before.</p><p>Starlink is owned by SpaceX, a company belonging to billionaire <a href=\"https://kyivindependent.com/tag/elon-musk/\">Elon Musk</a>.</p><p>Musk, a key ally of U.S. President Donald Trump, has drawn scrutiny at home and abroad over his repeated inflammatory comments regarding Ukraine.</p>","contentLength":914,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6ppeb/us_shares_intelligence_with_ukraine_for_defense/"},{"title":"Russia launches devastating attack on Ukraine after Trump’s defence of Putin","url":"https://www.theguardian.com/world/2025/mar/08/russian-attacks-on-ukraine-intensify","date":1741454194,"author":"/u/_God0fWar_","guid":661,"unread":true,"content":"<p>Russia launched a devastating attack on Ukraine on Saturday, killing at least 14 people and injuring dozens more, hours after Donald Trump defended <a href=\"https://www.theguardian.com/world/vladimir-putin\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Vladimir Putin</a> and said the Kremlin leader was “doing what anybody would do”.</p><p>Two ballistic missiles hit the centre of Dobropillia in the eastern Donetsk region. Fire engulfed a five-storey apartment building. As emergency services arrived, <a href=\"https://www.theguardian.com/world/russia\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Russia</a> launched another strike on the same area. Eleven civilians were killed, with five children among the 30 injured.</p><p>Writing on social media, <a href=\"https://www.theguardian.com/world/volodymyr-zelenskiy\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Volodymyr Zelenskyy</a> condemned the “vile and inhuman intimidation tactic often used by the Russians”. Three people also died and seven injured in a drone attack in the city of Bohodukhiv, in the Kharkiv region.</p><p>Russia’s relentless bombardment of Ukrainian cities has intensified after a torrid week in which Trump has pulled the plug on intelligence sharing with <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a> and halted the supply of US weapons.</p><p>These hostile moves mean the alarm system that warns Ukrainian civilians of incoming enemy missiles is less effective. Asked if Putin was taking advantage of US aid pauses, Trump on Friday acknowledged Ukraine was experiencing a “tremendous pounding”.</p><p>He suggested, however, that “anyone in Putin’s position” would do the same. Before a meeting on Tuesday between US and Ukrainian representatives in Saudi Arabia, Trump said he was “finding it easier” to deal with Moscow than with Kyiv.</p><p>European leaders suggested the US president was complicit in the latest devastation.</p><p>The Polish prime minister, Donald Tusk, said there had been “another tragic night in Ukraine”, with “more bombs, more aggression and more victims”. Without mentioning Trump directly, he said: “This is what happens when someone appeases barbarians.”</p><p>The EU’s foreign policy chief, Kaja Kallas, said the “relentless” Russian missiles demonstrated that Putin had no interest in peace. “We must step up our military support. Otherwise, even more Ukrainian civilians will pay the highest price,” she said.</p><p>Zelenskyy has been seeking to repair relations with Trump after their acrimonious White House meeting last month. Ukraine’s president has sketched out a peace plan – beginning with a truce on land and sea – and said he is ready to sign a favourable minerals deal with the US.</p><p>So far, however, Trump has piled pressure on Ukraine while making no demands of Russia. Zelenskyy said Saturday’s strike showed Moscow’s objectives had not changed. He called for an increase in sanctions against Russia to “collapse” its war economy.</p><p>Russia’s latest strike transformed the centre of Dobropillia into a sprawling ruin. The apartment block was a gutted mess. There were burnt-out cars and vans and smouldering debris. Rescuers swept up glass and twisted pieces of metal. Video from the strike showed a terrifying explosion.</p><p>Irina Kostenko, 59, spent the night cowering in her hallway with her husband. When she left the apartment building on Saturday, she saw a neighbour “lying dead on the ground, covered with a blanket”. “It was shocking, I don’t have the words to describe it,” she told the AFP news agency.</p><p>Meanwhile, Russia has exploited the US intelligence and weapons freeze to launch a series of bold attacks. North Korean and Russian troops have broken through Ukraine’s defences in Russia’s Kursk region, where Ukrainian units have for seven months occupied a parcel of territory.</p><p>There were unconfirmed reports on Saturday that Ukrainian forces had managed to stabilise the situation and avoid encirclement, at least for now. A hundred Russian soldiers crept through a gas pipeline in a raid on the Kyiv-held Russian town of Sudzha, <a href=\"https://www.pravda.com.ua/news/2025/03/8/7501875/\" data-link-name=\"in body link\">Ukrainskaya Pravda newspaper reported</a>.</p><p>Ukraine’s hold on territory in Kursk is increasingly precarious. Soldiers told the Observer two supply roads with the Ukrainian city of Sumy were open, but came under constant attack from Russian drones and artillery.</p><p>Serhiy Sternenko, a prominent Ukrainian activist, described the logistics situation there as “rapidly deteriorating and already critical”. “Logistics routes to Sudzha are under full enemy fire control,” he posted on X.</p><p>According to Kremlin bloggers, Russian combat groups advanced several kilometres across the border into Ukraine’s Sumy region. Russia also said it had retaken three villages in neighbouring Kharkiv oblast.</p>","contentLength":4402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6lv1b/russia_launches_devastating_attack_on_ukraine/"},{"title":"the United States to stop participating in future military exercises in Europe, Swedish media reports","url":"https://kyivindependent.com/u-s-to-stop-participating-in-future-military-exercises-in-europe-swedish-media-reports/","date":1741451447,"author":"/u/-Whats-Up-Sugar-Tits","guid":664,"unread":true,"content":"<p>The United States has notified its allies that it does not plan to participate in military exercises held in Europe beyond those already scheduled in 2025, Swedish media outlet Expressen reported on March 7. </p><p>Sources <a href=\"https://www.expressen.se/nyheter/varlden/usa-lamnar-planeringen-av-nya-militarovningar-i-europa-/\">told Expressen</a> that this will affect several exercises currently in the \"drawing board\" phase that will be held in Sweden. &nbsp;</p><p>Since his inauguration in January, U.S. President Donald Trump has signaled that he wants to pivot American security priorities away from Europe and focus on China and the Indo-Pacific Region. </p><p>He shocked allies with recent moves including ending <a href=\"https://kyivindependent.com/im-full-of-anger-ukraine-awakes-to-a-nightmare-as-us-freezes-military-aid/\">military aid</a> and <a href=\"https://kyivindependent.com/we-will-adapt-ukraines-soldiers-say-after-us-intel-cut/\">intelligence sharing</a> with Ukraine, excluding European allies from peace talks held with Russia in Saudia Arabia, and has repeatedly pressuring NATO allies to increase their defense spending. </p><p>In response, a rattled Europe has begun <a href=\"https://kyivindependent.com/how-europe-is-gearing-up-for-a-new-world-order/\">preparing itself</a> for a world order in which the United States cannot be relied on. EU member states agreed to free up what could amount to an<a href=\"https://kyivindependent.com/eu-pledges-continued-support-for-ukraine-despite-hungarys-opposition/\"><strong> unprecedented 800 billion euros</strong></a> ($867 billion) for defense spending. </p>","contentLength":1046,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6kuir/the_united_states_to_stop_participating_in_future/"},{"title":"Activists vandalize Trump golf resort over his comments on emptying out Gaza","url":"https://apnews.com/article/trump-scotland-golf-resort-turnberry-vandalized-bc3225c404a1afc326f78f3544cd5281","date":1741450051,"author":"/u/wonderingsocrates","guid":666,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6kbwe/activists_vandalize_trump_golf_resort_over_his/"},{"title":"Britain blocks launch of Elon Musk’s self-driving Tesla","url":"https://www.yahoo.com/news/britain-blocks-launch-elon-musk-140000186.html","date":1741445634,"author":"/u/Snowfish52","guid":668,"unread":true,"content":"<p>Britain has thwarted the launch of Tesla’s self-driving car software, limiting key features and further risking the ire of Elon Musk.</p><p>Department for Transport (DfT) officials have frustrated plans to legalise advanced driver assistance systems across Europe, according to documents seen by The Telegraph. Tesla’s full self-driving (FSD) software is leading the car industry’s push to automation.</p><p>Mr Musk is banking on autonomous driving being the next source of growth as Tesla’s sales decline amid a <a href=\"https://www.telegraph.co.uk/business/2025/02/05/tesla-chinese-electric-car-rival-byd-britain-musk/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:political backlash over his support for Donald Trump;elm:context_link;itc:0;sec:content-canvas\">political backlash over his support for Donald Trump</a>.</p><p>The Tesla chief, who has frequently clashed with Sir Keir Starmer in recent months, has said that autonomy will be the “main driver” of value. Tesla shares have fallen by almost a third this year as it faces sales declines in many of its key markets.</p><p>Tesla’s top lobbyist in Europe left the company in October, <a href=\"https://www.telegraph.co.uk/business/2024/10/19/tesla-executive-attacks-europe-over-delays-to-self-driving/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:hitting out at the slow process;elm:context_link;itc:0;sec:content-canvas\">hitting out at the slow process</a> that means the technology – introduced in the US in 2020 – may not make it to Europe until 2028.</p><p>Minutes from the United Nations Economic Commission for Europe (UNECE) – the body that decides new safety rules for vehicles – show that DfT officials raised concerns about plans to approve wide-ranging driver assistance systems.</p><p>As originally drafted, the plans would have allowed vehicles to make manoeuvres such as lane changes, junction turns and stopping and starting at traffic lights while motorists had their hands off the wheel.</p><p>However, the changes have now been watered down to restrict the systems to “highway” moves such as lane switching and to require drivers to keep their hands on the wheel.</p><p>In September, UK officials proposed the restrictions, saying: “Introducing system-initiated manoeuvres is a significant step which entails a degree of unknown.</p><p>“Whilst [a driver assistance system] may help in reducing collisions, it may also introduce new safety risks.”</p><p>They said the technology should instead be introduced “in phases”.</p><p>In January, officials in the UK, Norway, Sweden and the Netherlands put out a request for further evidence on the safety of driver assistance systems, saying: “The technological advancements in these systems are promising, but there remain concerns about their impact on driver behaviour, situational awareness and overall safety.”</p><p>The changes mean that only a basic version of systems such as Tesla’s FSD are likely to be deployed in the UK and Europe over the next year.</p><p>Marc Van Impe, Tesla’s former head of safety policy, who had overseen discussions on the changes, left the company for Mr Musk’s SpaceX in October, saying that the slow process “impacts Europe’s competitiveness”.</p><p><a href=\"https://www.telegraph.co.uk/business/2024/10/18/tesla-self-driving-cars-investigated-unsafe-fog-sunlight/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Tesla has sold “full self-driving capability”;elm:context_link;itc:0;sec:content-canvas\">Tesla has sold “full self-driving capability”</a> as a paid-for upgrade since 2016, and currently charges £6,800 for the feature in Britain, although it has no practical use.</p><p>The company said last year it hoped to introduce full self-driving features in Europe during the first quarter of 2025, although Mr Musk recently conceded that was unlikely.</p><p>“Europe is a layer cake of regulations of bureaucracy, which really needs to be addressed,” he told investors in January, saying he was unsure whether Tesla would be able to release the system this year.</p><p>The company could seek an exemption to the regulations. Drivers of Ford’s Mustang Mach-E are able to take their hands off the wheel on motorways in the UK after the <a href=\"https://www.telegraph.co.uk/business/2023/04/13/ford-mustang-mach-e-hands-free-self-driving-car-british-fir/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:company secured an exemption in 2023;elm:context_link;itc:0;sec:content-canvas\">company secured an exemption in 2023</a>.</p><p>Thousands of drivers in the US are using the FSD system and Mr Musk has said he hopes the cars will be able to drive “unsupervised” this year, a step to launching a robotaxi business.</p><p>Last year,<a href=\"https://www.telegraph.co.uk/us/news/2024/10/11/elon-musk-unveils-new-tesla-robotaxi-cybercab/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:he unveiled a “cybercab”;elm:context_link;itc:0;sec:content-canvas\"> he unveiled a “cybercab”</a> with no pedals, steering wheel or mirrors which Tesla hopes to start making in 2027.</p><p>Despite Tesla branding the system as “full self-driving”, driver assistance technologies such as FSD are legally different from self-driving systems, where the liability would fall on the company behind the system, rather than the driver.</p><p>A DfT spokesman said: “The UK has some of the safest roads in the world. With 88pc of all recorded road accidents currently involving human error, advanced driver assistant technology could play a crucial role in reducing accidents and saving lives.</p><p>“Road safety is our absolute priority, and that’s why we’re working closely with other countries to ensure these new technologies are safe, while harnessing the potential of autonomous vehicle technology to create jobs, power growth and help us deliver our Plan for Change.”</p><p><a href=\"https://www.telegraph.co.uk/customer/subscribe/01doysa/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.;elm:context_link;itc:0;sec:content-canvas\"><b>Broaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.</b></a></p>","contentLength":4703,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6isqx/britain_blocks_launch_of_elon_musks_selfdriving/"},{"title":"Trump suspending US intelligence sharing is ‘suffocating’ Ukraine’s hope, says Ben Wallace","url":"https://www.theguardian.com/world/2025/mar/08/trump-suspending-us-intelligence-sharing-is-suffocating-ukraine-hope-says-ben-wallace","date":1741436398,"author":"/u/_God0fWar_","guid":663,"unread":true,"content":"<p>Ben Wallace, the former UK defence secretary, has said Donald Trump’s decision to suspend US intelligence sharing with Kyiv is “suffocating” Ukrainian hope of holding out against Russian aggression.</p><p>Last Friday, the US president, along with the vice-president, <a href=\"https://www.theguardian.com/us-news/2025/feb/28/jd-vance-volodymyr-zelenskyy\" data-link-name=\"in body link\">JD Vance</a>, berated Volodymyr Zelenskyy in the Oval Office in full view of the media, <a href=\"https://www.theguardian.com/us-news/2025/feb/28/trump-zelenskyy-meeting-transcript\" data-link-name=\"in body link\">telling the Ukrainian president</a> that he was “gambling with world war three” and to come back to the White House “when he is ready for peace”.</p><p>In the week since, the US stopped sharing intelligence with Kyiv that had previously given advance warnings of attacks and Brussels agreed to a <a href=\"https://www.theguardian.com/world/2025/mar/06/watershed-moment-eu-leaders-close-to-agreeing-800bn-defence-plan-ukraine\" data-link-name=\"in body link\">huge increase</a> in defence spending.</p><p>On Friday, the day after intelligence sharing ceased, Russia carried out massive ballistic missile and drone strikes across Ukraine. Soon after the aerial attacks, <a href=\"https://www.theguardian.com/us-news/2025/mar/07/trump-says-it-is-easier-to-deal-with-russia-and-putin-wants-to-end-the-war\" data-link-name=\"in body link\">Trump said</a> Vladimir Putin was “doing what anybody would do”.</p><p>Overnight strikes in eastern <a href=\"https://www.theguardian.com/world/ukraine\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Ukraine</a> on Saturday killed at least 14 people and wounded dozen more, including five children.</p><p>Wallace, who was the defence secretary when Putin launched his full-scale invasion of Ukraine in 2022, said on Saturday that Trump was diminishing the hope of Ukraine with his actions.</p><p>Speaking on BBC Radio 4’s Today programme, he said: “Hope is the most important thing in this type of conflict and, at the moment, Donald Trump is suffocating the hope that Putin can be either fought to a standstill or indeed brought to the table.”</p><p>He added: “Hope is always the key for both morale and a military campaign. When this started three years ago, I remember gathering the military officials in my then department, and saying on day one, we have to give the Ukrainians hope.</p><p>“If a Russian truck has a puncture, we need to let people know. If the Russians have a small defeat, we need to let the Ukrainian people know.”</p><p>Wallace suggested that Ukraine could still win the war if it continued holding off Russian forces. He said: “If Ukraine continues to resist for 18 months, the Russian economy will collapse. Its inflation rate’s at 23%, it’s spending 40% of its money [on defence], it’s finding it incredibly hard to replace its equipment. It can use North Koreans like cannon fodder, but fundamentally, it is not in a good place.</p><figure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"><a data-ignore=\"global-link-styling\" href=\"https://www.theguardian.com/world/2025/mar/08/trump-suspending-us-intelligence-sharing-is-suffocating-ukraine-hope-says-ben-wallace#EmailSignup-skip-link-12\">skip past newsletter promotion</a><p tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\">after newsletter promotion</p></figure><p>“Ukraine is not trying to invade Russia and go all the way to Moscow. Ukraine is trying to defend its sovereignty and its land and there is hope for them. If we were to all step up, either substitute what the Americans have taken away, or indeed show proper European resolve, and in that I include the United Kingdom, that we ain’t going anywhere.”</p><p>Leaders in Europe have convened in the past week in response to Washington’s change in stance on the war. <a href=\"https://www.theguardian.com/politics/keir-starmer\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Keir Starmer</a> said Europe is “at a crossroads in history” and confirmed that the UK and France would lead a “coalition of the willing” to help end the fighting.</p><p>On Thursday, the French president, <a href=\"https://www.theguardian.com/world/emmanuel-macron\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Emmanuel Macron</a>, warned that “the only imperial power that I see today in Europe is Russia” and called Vladimir Putin “an imperialist who seeks to rewrite history” after the Russian president appeared to compare him to Napoleon Bonaparte.</p><p>Wallace said: “I’ve seen good leadership from both Keir Starmer and President Macron on this and they should both be congratulated.</p><p>“What I’m hoping they’re all doing right now behind the scenes is working out what the Americans have switched off, and finding European sources, or even further afield, to replace it.”</p>","contentLength":3565,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6g02u/trump_suspending_us_intelligence_sharing_is/"},{"title":"Muslim nations reject Trump’s call to empty the Gaza Strip of its Palestinian population","url":"https://apnews.com/article/israel-palestinians-hamas-war-news-ramadan-ceasefire-03-08-2025-6643d25f110053852a9dd16eb15a8e2e","date":1741435980,"author":"/u/Sanlear","guid":662,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1j6fw0h/muslim_nations_reject_trumps_call_to_empty_the/"}],"tags":["news"]}