{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUPnWnrm9hxPwn4pNBYDQ4Rwt6vAY63o5DXPfNK4mPyDMgtYMsetQUGdrah","title":"top scoring links : ObsidianMD","displayTitle":"Reddit - Obsidian","url":"https://www.reddit.com/r/ObsidianMD/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/ObsidianMD/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Those who use Obsidian to keep your head on straight at work, what do you do and how do you use it?","url":"https://www.reddit.com/r/ObsidianMD/comments/1jh0j1h/those_who_use_obsidian_to_keep_your_head_on/","date":1742617873,"author":"/u/ucrbuffalo","guid":700,"unread":true,"content":"<p>I produce corporate videos for a mid-size company. This year I’ve been getting pulled into a lot more meetings than ever and having less of a shield from my boss on that. I started using Obsidian to help me keep track of what meetings I’ve been to and what we talked about in them. It’s a really basic idea that I’m sure everyone here started doing on their first week, too. Most of my other items I need to track happen online so I haven’t made the switch to note taking for everything yet, but I’m sure once I get faster and more comfortable with it, I will. </p>","contentLength":573,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Callouts","url":"https://www.reddit.com/r/ObsidianMD/comments/1jgwkh7/callouts/","date":1742605048,"author":"/u/DeveloperOfCodeLLC","guid":701,"unread":true,"content":"<p>I am currently using the Obsidianite theme and I love it. One thing I want to adjust is the callouts. I would to have my callouts setup like the ones you see in the picture attached. What I am referring to is the Callouts looking like a tab with the dashed line below it and the other words still having the black background. Does anyone know how I can achieve this?</p>","contentLength":366,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Organized Chaos: My All-In-One Obsidian Vault!","url":"https://www.reddit.com/r/ObsidianMD/comments/1jgrsym/organized_chaos_my_allinone_obsidian_vault/","date":1742591792,"author":"/u/Electrical_Candle_84","guid":704,"unread":true,"content":"<p>I've received plenty of feedback suggesting that my vault is overly complex or even chaotic. While I appreciate the input, my approach reflects my personal needs and working style. Here’s what my vault represents for me:</p><ul><li><ul><li>My brain is naturally forgetful, so I rely on an external system to capture everything from work ideas to leisure notes.</li><li>Research in cognitive load theory shows that offloading information can enhance productivity and reduce mental strain.</li></ul></li><li><ul><li>Instead of compartmentalizing by strict minimalism, I’ve created one unified space that covers: <ol><li> A dedicated area for professional projects and ongoing learning.</li><li> Sections for brainstorming, drafting, and refining ideas for articles and videos.</li><li><strong>Leisure and Entertainment:</strong> A playful corner for personal interests and inspiration.</li><li><strong>Relationships and Business Management:</strong> Tools to keep track of networking, collaborations, and day-to-day administrative tasks.</li></ol></li></ul></li><li><ul><li>While minimalist systems work for some, I’ve found that a more comprehensive and interlinked structure suits my thought process best.</li><li>This vault isn’t just a note-taking system—it’s a dynamic, all-in-one tool curated to fit my unique workflow.</li></ul></li></ul><p>I’m excited to share some screenshots of my vault. I hope you find inspiration in the way I’ve embraced what others might call “organized chaos.” </p>","contentLength":1318,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Finally customised and sorted to my liking","url":"https://www.reddit.com/r/ObsidianMD/comments/1jgks9o/finally_customised_and_sorted_to_my_liking/","date":1742574161,"author":"/u/Apprehensive-Poet511","guid":703,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stop wasting time putting silly numbers at the beginning of your folders to sort them - manual order them with simple drag and drop instead. Works on phone as well. (\"Manual Sorting\" plugin)","url":"https://www.reddit.com/r/ObsidianMD/comments/1jggtkj/stop_wasting_time_putting_silly_numbers_at_the/","date":1742563716,"author":"/u/Content_Trouble_","guid":702,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Useful Dataview: notes without outbound or inbound links. AKA orphans","url":"https://www.reddit.com/r/ObsidianMD/comments/1jgfja7/useful_dataview_notes_without_outbound_or_inbound/","date":1742559748,"author":"/u/philoserf","guid":699,"unread":true,"content":"<pre><code>TABLE WHERE length(file.outlinks) &lt; 1 AND length(file.inlinks) &lt; 1 SORT length(file.outlinks) DESC, length(file.inlinks) DESC </code></pre><p>We have other ways to find them but this works for me. I used to have a higer target thus the . Also my targets for inbound and outbound were different. Over time, I came to only seek true orphans.</p>","contentLength":323,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}