{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Prime Minister Carney promises free trade between provinces and territories by Canada Day","url":"https://www.cbc.ca/news/politics/carney-premiers-meeting-1.7489368","date":1742601772,"author":"/u/BonkMcSlapchop","guid":671,"unread":true,"content":"<ul><li><em><strong>Canada to develop&nbsp;national trade strategy, PM says.</strong></em></li><li><em><strong>Carney says he'll keep carbon emissions cap.</strong></em></li><li><em><strong>Ottawa to set up 'one project, one review'&nbsp;system to speed approval of major projects.</strong></em></li><li><em><strong>Government will temporarily remove one-week waiting period for employment insurance.</strong></em></li></ul><p>Prime Minister Mark Carney says he and Canada's premiers have agreed to develop a national trade strategy and promised a&nbsp;slew of support for workers and businesses.</p><p>\"We intend from a federal level to have free trade by Canada Day,\" he said, noting that the plan would be directed at easing&nbsp;transportation, energy, critical minerals&nbsp;and digital connectivity restrictions across&nbsp;the country.&nbsp;&nbsp;</p><p>The announcement comes after his meeting&nbsp;with&nbsp;premiers at the Canadian War Museum in Ottawa on Friday, with some&nbsp;calling for trade barriers within the country to be swiftly removed in order to&nbsp;make Canada's economy more resilient.</p><p>\"The agreement is to turn what has been a concept into a reality that will&nbsp;diversify and strengthen our economy… We are committing to removing all federal exemptions under the Canada free-trade agreement,\" Carney said.&nbsp;</p><p>The gathering between Carney and the provincial and territorial leaders&nbsp;ran about 40 minutes longer than expected — and comes two days before a federal election <a href=\"https://www.cbc.ca/news/politics/carney-to-call-election-this-sunday-1.7488444\">is likely to be called.</a></p><div><em><strong>WATCH | PM addresses possibility&nbsp;of election interference</strong></em>:</div><p>U.S. President Donald Trump's trade war escalated last week as the country imposed 25 per cent tariffs on all steel and aluminum imports entering the country, prompting Canada to effectively double its retaliatory tariffs on U.S. goods.</p><p>Trump has also repeatedly suggested that Canada should become the 51st state.</p><p>\"We have to do things that we hadn't imagined possible before at a speed that we haven't moved before,\" Carney said in his remarks before the meeting. \"One aspect of that is we need builders and it's part of the reason why earlier today we've brought back the level of the capital gains so that those who take those risks get the rewards.\"</p><ul dir=\"ltr\"><li>Temporarily waving the one-week employment insurance waiting period.</li><li>Temporarily allowing businesses to defer corporate income-tax payments and GST and HST remittances.</li><li>Deploying a new financing facility (the Large Enterprise Economic and National Security Facility).</li><li>Implementing a&nbsp;\"one window\" approval process to speed up major projects.&nbsp;</li><li>Doubling the Indigenous Loan Guarantee to $10 billion, unlocking access to capital for First Nations, Inuit and Métis.</li><li>Providing more funding for regional development agencies.</li><li>Removing any mobility restrictions for federally regulated professions.&nbsp;</li></ul><p dir=\"ltr\">Carney said removing barriers to the free movement of workers, goods and services would increase the size of Canada's economy by $250 billion — equivalent to more than $6,000 for every Canadian.</p><p dir=\"ltr\">He said he&nbsp;is proud&nbsp;the&nbsp;federal government moved on a number of projects today, such as the&nbsp;Cedar LNG and LNG Canada in B.C. and&nbsp;Port of Churchill in northern Manitoba.&nbsp;</p><p dir=\"ltr\">\"It's high time to build,\" Carney said.&nbsp;</p><p dir=\"ltr\">Carney told reporters he would maintain a carbon emissions cap,&nbsp;but that legislation isn't enough to reduce emissions, which is why, he said, he is \"focused on action.\"&nbsp;<p> \"One of the projects, I firmly believe this, of national significance is major investments in carbon capture and storage,\" he said.&nbsp;</p></p><p dir=\"ltr\">\"We have the opportunity not just to get emissions down but very importantly to create an entirely new industry that will serve Canadians well but will create exports and jobs and opportunities for many decades.\"</p><p dir=\"ltr\">The Conservative Party later alleged Carney was lying about his support of Canada's oil and gas industry.</p><p dir=\"ltr\">\"If Carney was sincere, he would immediately commit to the full repeal of the Liberals' C-69, the 'No More Pipelines' Act, C-48, the West Coast Tanker Ban, and the production cap,\" the party said in a statement. \"Instead he doubled down on capping Canadian energy production.\"</p><p dir=\"ltr\">Carney's announcement about a national development strategy is also reminiscent of Conservative campaign promises.</p><p dir=\"ltr\">Just yesterday, Conservative Leader Pierre Poilievre <a href=\"http://www.cbc.ca/news/politics/poilievre-campaign-plane-bus-1.7488694\">said in Jonquière, Que.</a>, that he plans to create \"shovel-ready zones\" with pre-approved construction permits for major resource or energy projects if elected.</p><p dir=\"ltr\">In 2019,&nbsp;Conservative&nbsp;Andrew Scheer, leader of the Official Opposition at the time, pledged that if elected, his government would&nbsp;build a <a href=\"https://www.cbc.ca/news/politics/scheer-national-energy-corridor-announcement-1.5301488\">single coast-to-coast energy corridor</a> to transport natural resources.</p><h2>Most premiers in agreement: Ford</h2><p>In a scrum with reporters following the meeting, Ontario Premier Doug Ford said most premiers agreed&nbsp;about eliminating trade barriers, with he and the federal government intending to clear&nbsp;all exemptions.</p><p>\"Nova Scotia is clearing all exemptions. As we move across the country, eventually everyone is going to hop on,\" he said. \"They'll have no choice but to hop on board. Not forced, but there will be so much pressure within their territory or their province.\"</p><p>Ford repeated that all options remain on the table, including potentially increasing an energy tax on the U.S. despite Alberta Premier Danielle Smith's&nbsp;opposition to that approach.&nbsp;</p><div><em><strong>WATCH | Carney presents national strategy</strong></em>:</div><p>\"Ontario will decide that. No other jurisdiction,\" he said. \"I don't worry about her oil and she doesn't have to worry about my energy.\"</p><p>Smith and Saskatchewan's Scott Moe and&nbsp;B.C.'s David Eby attended&nbsp;virtually, as did&nbsp;Newfoundland and Labrador Premier Andrew Furey who is&nbsp;in Japan for&nbsp;a trade mission.</p><p>Ford reiterated that he would work with anyone as long as it's in Ontario's best interest.&nbsp;</p><p>New Brunswick Premier Susan Holt voiced&nbsp;support for Carney, saying in French that she is \"very happy\" to have him as prime minister while Canada is under tariff threats.&nbsp;</p><p>\"From what I've seen of Mr. Carney and the conversations we have had, his passion for Canada shines through, his intelligence shines through,\" she said.&nbsp;</p><p>She said she has yet to meet with Poilievre and doesn't have a comparison point.&nbsp;</p><h2>Legault&nbsp;wants 'global negotiation'&nbsp;&nbsp;</h2><p>Shortly after arriving for the meeting, Quebec Premier François Legault&nbsp;told reporters that&nbsp;he wants the next prime minister to ask Trump for a \"global\" negotiation of a&nbsp;trade agreement rather than one that is piecemeal.</p><p>\"Right now, Mr. Trump doesn't respect the agreement between Canada, the U.S.&nbsp;and Mexico, especially&nbsp;on steel and aluminum. So it's important we renegotiate all the agreement,\" he said.</p><p>He said premiers and the prime minister need to be careful about counter-tariffs and \"eventual\" counter-tariffs&nbsp;to&nbsp;maximize the negative impact on U.S. businesses but minimize the impact on Canadian ones.&nbsp;</p><p>The Quebec premier said his&nbsp;province would be \"open\" to pipeline projects, due to Trump's threats, but there needs to be social acceptability.</p><p>Yukon Premier Ranj Pillai&nbsp;acknowledged that, with increased focus on&nbsp;the North and the Arctic,&nbsp;it's important to hear the plans of&nbsp;all political parties for the region, especially in light of the rhetoric south of the border.</p><p>Pillai said he wants to&nbsp;make sure the prime minister is aware that it is a \"special moment in time for us\" and that&nbsp;his visit to Iqaluit, the first domestic trip of his leadership of&nbsp;Canada, was \"important and set a tone.\"</p><p>\"Other people are focusing on the North and we sure need to do the same,\" Pillai said. \"In the first week, personally, I'm very impressed with what I've seen.\"</p><p>Nunavut Premier P.J. Akeeagok&nbsp;agreed, saying it was great to see Carney underline \"how important the North is and how much incredible of an&nbsp;opportunity we have to provide the country with an opportunity to&nbsp;diversify.\"</p><p dir=\"ltr\">Manitoba Premier Wab Kinew emphasized the need for a \"solid plan for Canada's economy\" because the country is \"fighting a trade war on two fronts.\"</p><p dir=\"ltr\">\"Trump tariffs certainly attract so much attention, but in Manitoba and in Western Canada, the tariffs from the People's Republic of China on canola and pork are having a major impact already,\" Kinew&nbsp;said.</p><p><em>With files from CBC's Olivia Stefanovich, Lisa Mayor, Meagan Fitzpatrick, Kate McKenna, Raffy Boudjikanian</em></p>","contentLength":8071,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgvgn0/prime_minister_carney_promises_free_trade_between/"},{"title":"Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US","url":"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254","date":1742592424,"author":"/u/ComplexWrangler1346","guid":673,"unread":true,"content":"<p>Donald Trump has said Russia is only fearful of NATO with the US as a member.&nbsp;</p><p>In a news conference on Friday, the US president claimed: \"<a href=\"https://news.sky.com/topic/nato-5921/1\" target=\"_blank\"></a>was gone until I came along\".</p><p>\"President Putin will tell you that without the United States, he wouldn't be worried, but he is worried when the United States is involved,\" he said.</p><p> also alleged the previous and current NATO secretary generals said: \"If it wasn't for Trump, you wouldn't even have NATO because we were paying the costs of almost all of the countries.\"</p><p>Mr Trump made the comments as he announced in the White House that Boeing has won a contract to develop the US Air Force's most sophisticated fighter jet yet.</p><p>The new sixth-generation jet would be named F-47, Mr Trump said.</p><p>\"Nothing in the world comes close to it... it's something the likes of which nobody has seen before,\" he added.</p><p>\"(The F-47) will be the most lethal aircraft ever built.\"</p><p>On defence, Mr Trump said the US is also \"well-equipped\" to fight any potential war with China.</p><p>\"We don't want to have a potential war with China. But I can tell you if we did, we're very well-equipped to handle it,\" he said.</p><p>He also rejected reports that his adviser Elon Musk would be briefed on how the United States would fight a hypothetical war with China - a rare suggestion that his far-reaching role in the administration will face limits.</p><p>\"Elon has businesses in China,\" he said. \"And he would be susceptible, perhaps, to that.\"</p><p>The president confirmed he would be speaking to China's president Xi Jinping about tariffs. Mr Trump also said there was flexibility on his controversial economic measure.</p><p>It comes as Mr Trump expressed enthusiasm for possibly becoming a member of the Commonwealth.</p><p>Sharing an article on his Truth Social network about plans to allegedly make the USA the next associate member, the President wrote: \"I Love King Charles. Sounds good to me!\"</p><p><strong>'Our allies are calling constantly'</strong></p><p>The plane's design remains a closely-held secret, but would likely include stealth, advanced sensors, and cutting-edge engines.</p><p>The initial contract to proceed with production on the jets is worth an estimated $20bn (£15.5bn).</p><div data-component-name=\"sdc-article-custom-markup\" data-consent=\"pending\" data-vendor-name=\"spreaker\"><section aria-label=\"Consent required\" data-component-name=\"ui-consent-roadblock\" data-aspect-ratio=\"16/9\"><div><div><a href=\"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254#\" data-single-click-vendor-name=\"spreaker\" data-show-on-fallback=\"false\">Enable Cookies</a><a href=\"https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254#\" data-single-click-vendor-name=\"spreaker\">Allow Cookies Once</a></div></div></section></div><p>Mr Trump said the jets will be built over several years and \"it's something nobody has ever seen before\".</p><p>\"Our allies are calling constantly,\" Trump said, adding foreign sales could be an option. \"They want to buy them also.\"</p><p>After saying the US would \"tone down\" the new jets by 10% for any sales to allies, Trump said: \"[It] probably makes sense, because someday, maybe they're not our allies.\"</p><p>Critics have questioned the cost and the necessity of the programme as the Pentagon is still struggling to fully produce its current most advanced jet, the F-35, which is expected to cost taxpayers more than $1.7tr (£1.01tr) over its lifespan.</p><a href=\"https://news.sky.com/download-app\" target=\"blank\" data-tracking-label=\"ui-app-promo-download-link\" data-type=\"\" data-component-name=\"ui-app-promo\"></a><p><strong>'I'll pay out of my own pocket'</strong></p><p>Meanwhile, Mr Trump said he will pay NASA astronauts  overtime pay after their trip to the International Space Station lasted nine months longer than planned.</p><p>A reporter at the news conference said the pair are not entitled to overtime pay, prompting Mr Trump to say: \"If I have to, I'll pay it out of my own pocket.\"</p>","contentLength":3145,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgs1h6/trump_announces_most_lethal_aircraft_ever_built/"},{"title":"Donald Trump suggests US could join British Commonwealth","url":"https://www.newsweek.com/donald-trump-suggests-us-could-join-british-commonwealth-2048679","date":1742575243,"author":"/u/APrimitiveMartian","guid":679,"unread":true,"content":"<p>President <a href=\"https://www.newsweek.com/topic/donald-trump\" data-sys=\"1\">Donald Trump</a> suggested that the United States could join the British Commonwealth on Friday in a post to Truth Social, his social media platform.</p><p>The president shared an article from British tabloid  reporting that <a href=\"https://www.newsweek.com/topic/king-charles-iii\" data-sys=\"1\">King Charles III</a> was making a \"secret offer\" to the White House, and that plans are in process for the U.S. to become an associate member of the international organization.</p><p>\"I Love King Charles. Sounds good to me!\" Trump wrote in response to the report.</p><p> has reached out to the Commonwealth for comment via email Friday afternoon.</p><p>The Commonwealth is primarily comprised of former British colonies or dependencies, born out of the breakup of the British Empire in the mid-20th century. Joining such a group could be seen as a different tact to Trump's other messages on groups such as the North Atlantic Treaty Organization (<a href=\"https://www.newsweek.com/topic/nato\" data-sys=\"1\">NATO</a>) and the <a href=\"https://www.newsweek.com/topic/united-nations\" data-sys=\"1\">United Nations</a> (U.N.), which he has been skeptical of.</p><p>According to the king is expected to make the offer to make the U.S. the 57th member of the Commonwealth at a time when America's relationship with the <a href=\"https://www.newsweek.com/topic/european-union\" data-sys=\"1\">European Union</a> (<a href=\"https://www.newsweek.com/topic/eu\" data-sys=\"1\">EU</a>) has been strained over Ukraine in its ongoing war with Russia.</p><p>The offer is being seen as a way to bolster the U.S. and United Kingdom's so-called \"special relationship\", despite America having famously split from British rule in the 1700s. The two countries have frequently worked together on foreign policy in the 20th and 21st centuries.</p><p>While joining the Commonwealth would largely be symbolic, as the group does not affect governance of its member nations, the move could be used to help avoid the heightened tariffs on steel and aluminum Trump has promised, according to .</p><p>Trump has shown his support for the British royal family for many years and visited Buckingham Palace as part of a state visit during his first term in the White House. The idea to join the Commonwealth was first floated during that 2017-2021 term.</p><p>The king invited Trump back to the U.K. for another visit in a letter hand-delivered by British Prime Minister <a href=\"https://www.newsweek.com/topic/sir-keir-starmer\" data-sys=\"1\">Sir Keir Starmer</a> on <a href=\"https://www.newsweek.com/trump-accepts-king-charles-unprecedented-invitation-state-visit-2037347\" target=\"_blank\" title=\"Trump Accepts King Charles' 'Unprecedented' Invitation for State Visit\" rel=\"noopener\">his trip to the White House</a>. At the meeting, Trump described King Charles III as \"a beautiful man.\"</p><p><strong>King Charles III in a statement on Commonwealth Day on March 10: </strong>\"In these uncertain times, where it is all too easy to believe that our differences are problems instead of a source of strength and an opportunity for learning, the Commonwealth's remarkable collection of nations and peoples come together in the spirit of support and, crucially, friendship...The Commonwealth's ability to bring together people from all over the world has stood the test of time and remains as ever-important today.\"</p><figure data-gtm-category=\"Related In-Text A\" data-gtm-action=\"Click\"></figure><p>While it's not clear if the U.S. would definitely join the Commonwealth, neighbors Canada are part of the group of nations, and at a time of heightened cross-border tensions, being part of the same collective could help ease matters.</p><p><em>Update 3/21/25, 12:56 p.m. ET: This article has been updated with additional information.</em></p>","contentLength":2961,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgl7zu/donald_trump_suggests_us_could_join_british/"},{"title":"Russia used risqué pics to blackmail teen girl into terror act","url":"https://tvpworld.com/85735175/russian-agents-used-risqu-pics-to-blackmail-a-ukrainian-schoolgirl-into-terror-act","date":1742574278,"author":"/u/KrzyHooy","guid":677,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgktwj/russia_used_risqu%C3%A9_pics_to_blackmail_teen_girl/"},{"title":"US rejects Mexico’s request for water as Trump opens new battle front","url":"https://www.theguardian.com/us-news/2025/mar/20/tijuana-mexico-water-trump","date":1742571585,"author":"/u/sweatycat","guid":674,"unread":true,"content":"<p>The United States has refused a request by <a href=\"https://www.theguardian.com/world/mexico\" data-link-name=\"in body link\">Mexico</a> for water, alleging shortfalls in sharing by its southern neighbor, as Donald Trump ramps up a battle on another front.</p><p>The state department said on Thursday it was the first time that the United States had rejected a request by <a href=\"https://www.theguardian.com/world/mexico\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Mexico</a> for special delivery of water, which would have gone to the border city of Tijuana.</p><p>“Mexico’s continued shortfalls in its water deliveries under the 1944 water-sharing treaty are decimating American agriculture – particularly farmers in the Rio Grande valley,” the state department’s bureau handling Latin America said in a post on X.</p><p>The 1944 treaty, which governs water allocation from the Rio Grande and Colorado River, has come under growing strain in recent years due to the pressures of the climate crisis and the burgeoning populations and agriculture in parched areas.</p><p>The treaty sets five-year cycles for water deliveries, with the latest set to end in October 2025.</p><p>Under the treaty, Mexico sends water from rivers in the Rio Grande basin to the US, which in turn sends Mexico water from <a href=\"https://www.theguardian.com/environment/2019/oct/21/the-lost-river-mexicans-fight-for-mighty-waterway-taken-by-the-us\" data-link-name=\"in body link\">the Colorado River</a>, further to the west. But Mexico has fallen behind in its water payments due to drought conditions in the arid north of the country.</p><p>US farmers and lawmakers complain that the neighboring country has waited until the end of each cycle in the past and has come up short in the latest period.</p><p>A year ago the last sugar mill in southern Texas shut down, blaming a lack of water deliveries from Mexico.</p><p>After 18 months of negotiations, the United States and Mexico reached an agreement in November, days after Trump’s election, to improve deliveries.</p><p>Hailed then by the Biden administration, the understanding calls for Mexico to work with the United States to deliver water in a more timely way, including earlier in each five-year cycle.</p><p>Mexico’s president, Claudia Sheinbaum, said on Thursday before the state department announcement that the water issue was “being dealt with” through the two countries’ boundary and water commission.</p><p>“There’s been less water. That’s part of the problem,” she told reporters.</p><p>Tijuana, a sprawling city on the border with the US state of California that has become a hub for manufacturing, depends on the Colorado River for about 90% of its water and has suffered waste from creaky infrastructure.</p><p>The Colorado River, also a major water source for Los Angeles and Las Vegas, has seen its <a href=\"https://www.theguardian.com/us-news/2023/jul/27/colorado-river-water-lost-climate-crisis\" data-link-name=\"in body link\">water levels shrink</a> due to <a href=\"https://www.theguardian.com/environment/2024/apr/16/arizona-colorado-river-water-rights-drought\" data-link-name=\"in body link\">drought</a> and heavy agricultural consumption in the south-western United States, with around half of its water going to raise beef and dairy cattle.</p><p>In southern Texas, farmers have voiced fear for the future of cotton, citrus and other farming products without more regular water deliveries from across the border in Mexico.</p><p>Brooke Rollins, the US agriculture secretary, on Wednesday announced $280m in relief funds for Rio Grande valley farmers.</p><p>“Texas farmers are in crisis because of Mexico’s noncompliance,” Senator Ted Cruz of Texas wrote on X, praising the state department’s water decision.</p><p>“I will work with the Trump administration to pressure Mexico into complying and to get water to Texas farmers.”</p><p>The water dispute comes as Trump takes a tough approach to Latin American countries, especially on migration.</p><p>Trump on returning to office has vowed to end arrivals of undocumented migrants, who largely come from Central America and Venezuela but transit through Mexico.</p><p>Trump deployed troops to the border and announced painful tariffs on Mexico, although he has since put them on hold until 2 April.</p>","contentLength":3581,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgjr62/us_rejects_mexicos_request_for_water_as_trump/"},{"title":"U.K. Authorities Probing Possible Putin ‘Sabotage’ After Heathrow Airport Fire","url":"https://www.thedailybeast.com/british-authorities-probing-possible-putin-sabotage-after-heathrow-airport-fire/","date":1742565427,"author":"/u/thedailybeast","guid":678,"unread":true,"content":"<a href=\"https://www.thedailybeast.com/category/world/\"></a><a href=\"https://www.thedailybeast.com/category/world/\"></a><h2>London’s police force said there was “currently no indication of foul play” but officers were keeping an “open mind at this time.” </h2>","contentLength":141,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jghexn/uk_authorities_probing_possible_putin_sabotage/"},{"title":"Macron: Russia has once again demonstrated it doesn’t actually share desire for peace","url":"https://en.interfax.com.ua/news/general/1057656-amp.html","date":1742563781,"author":"/u/sweatycat","guid":676,"unread":true,"content":"<a href=\"https://en.interfax.com.ua/news/general.html\">\n        Facts\n    </a><p><time datetime=\"21.03.2025\">\n          14:50, 21.03.2025\n        </time></p><p>French President Emmanuel Macron responded to the Russian army's overnight shelling of Ukraine by noting that Russia \"has once again shown that it does not truly share the desire for peace\" and expressed \"full support\" for the Ukrainian people.</p><p>\"Last night, Russia demonstrated once again that it does not truly share the desire for peace. Full support for the Ukrainian people,\" Macron added on social media X.</p><p>French President Emmanuel Macron has reportedly stressed the importance of a \"measurable and fully respected ceasefire\" in Ukraine.</p>","contentLength":597,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jggud1/macron_russia_has_once_again_demonstrated_it/"},{"title":"Prince William sends strong message from tank near Russian border","url":"https://www.bbc.co.uk/news/articles/c70eyg099j5o","date":1742562701,"author":"/u/notwritingasusual","guid":675,"unread":true,"content":"<p>The war in Ukraine has shown how fast the technology of combat is changing and on Thursday the prince saw a hydrogen-powered drone, on a visit to designers in Estonia's capital Tallinn.</p><p>At the Tapa army base he asked soldiers about the new \"drone threat\" facing modern armies and \"the change of tactics\" that would require.</p><p>Around the base there were warning signs saying: \"Report drone sightings.\"</p><p>The visit also focused on the wellbeing of service men and women who are posted here. Prince William asked whether there was still a stigma when it comes to talking about mental health problems in the armed forces. \"It's going in the right direction,\" welfare officer Amy-Jane Hale replied.</p><p>While touring the facilities, the prince managed to try his hand at pool and table football. That quickly became a game between his team Aston Villa and a supporter of their rivals Birmingham City.</p><p>On Thursday, hundreds of local Estonians waited in the cold to meet the prince in Tallinn, lining the railings to shake his hand or to take a selfie. He was warmly welcomed to this small, tech-savvy country, which increasingly relies upon its allies.</p><p><a href=\"https://www.bbc.co.uk/news/articles/c722zxj0kyro\">Estonia has been a strong supporter of Ukraine</a>, sharing a border with Russia and having been under Soviet rule in the past. All around the capital there are Ukrainian flags flying alongside the Estonian blue, black and white tricolour.</p><p>Many Ukrainian families have taken refuge in Estonia. During a visit to a school in Tallinn for Ukrainian child refugees, Prince William praised Ukraine's strength. </p><p>\"The Ukrainian resilience is everywhere,\" Prince William told the students. \"You have a very good spirit, very good souls, it's very important.\"</p>","contentLength":1677,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jggh83/prince_william_sends_strong_message_from_tank/"},{"title":"Denmark Issues Travel Warning For US","url":"https://www.newsweek.com/denmark-issues-travel-warning-us-2048508","date":1742560420,"author":"/u/sweatycat","guid":680,"unread":true,"content":"<p>Denmark and Finland have revised their travel guidance for transgender individuals planning to visit the United States.</p><p> has contacted the ministry for comment via email.</p><p>The move follows similar guidance updates by other European nations, including <a href=\"https://www.newsweek.com/britain-issues-travel-warning-us-deportations-2047878\" target=\"_blank\" rel=\"noopener\">Britain</a> and <a href=\"https://www.newsweek.com/germany-issues-travel-warning-us-2047773\" target=\"_blank\" rel=\"noopener\">Germany</a>, in apparent response to President <a href=\"https://www.newsweek.com/topic/donald-trump\" target=\"_blank\" rel=\"noopener\">Donald Trump</a>'s large-scale crackdown on illegal immigration and trans rights.</p><p><a href=\"https://www.newsweek.com/topic/donald-trump\" target=\"_blank\" rel=\"noopener\">Trump</a> has rolled back rights for transgender and nonbinary people with a flurry of executive orders since he returned to the White House. On his first day back in office, Trump issued an order stating that the government would recognize only two sexes: male and female.</p><p>A new section has been added under Denmark's visa rules for entry into the United States. It states that when applying for a U.S. visa, there are only two gender options available, male or female.</p><p>If your passport has the gender designation X, or if you have changed your gender, the Ministry of Foreign Affairs advises contacting the American embassy before traveling for guidance on how to proceed.</p><p>The change was made after LGBT+ Denmark contacted the Ministry of Foreign Affairs, requesting an update to the travel advice, per <a rel=\"noopener nofollow\" href=\"https://radio4.dk/nyheder/udenrigsministeriet-opdaterer-rejsevejledning-til-usa-for-transkoennede-NAbAOgeDZt6Zmq3Dd8mE\" target=\"_blank\">RadioIIII</a>.</p><p>Meanwhile in Finland, the advisory notes that if the gender on an applicant's passport differs from the gender confirmed at birth, U.S. authorities may deny entry. It's recommended to check the entry requirements with U.S. authorities in advance.</p><p>Additionally, Finnish passports do not include an \"X\" gender marker. If a dual citizen holds a passport with an \"X\" marker, it's advisable to verify entry conditions with U.S. authorities beforehand, according to the new guidance.</p><p>It comes after Trump also signed an executive order outlining steps to ban transgender individuals from serving in the military, a policy currently facing legal challenges. A <a href=\"https://www.newsweek.com/topic/pentagon\" data-sys=\"1\">Pentagon</a> memo issued in late February directs military branches to identify and discharge transgender service members within 30 days.</p><p>Secretary of Defense <a href=\"https://www.newsweek.com/topic/pete-hegseth\" data-sys=\"1\">Pete Hegseth</a> later issued a memo stating that transgender individuals would no longer be allowed to enlist in the military while emphasizing that service members with gender dysphoria who are already serving would be \"treated with dignity and respect.\"</p><p>Federal Judge Ana Reyes blocked Trump's executive order prohibiting transgender individuals from serving in the military.</p><p>Meanwhile, the United Kingdom has updated its travel guidance for British citizens planning to visit the country, warning of potential arrest or detention if travelers fail to comply with entry requirements.</p><figure data-gtm-category=\"Related In-Text A\" data-gtm-action=\"Click\"></figure><p>Head of secretariat <a rel=\"noopener nofollow\" href=\"https://da.wikipedia.org/wiki/LGBT%2B_Danmark\" target=\"_blank\">LGBT+ Denmark</a> Susanne Branner Jespersen told RADIO IIII: \"We are worried that people will be stopped at the airport and denied entry, or that they will be exposed to something that is transgressive and unpleasant at the airport, says Susanne Branner Jespersen.</p><p>\"At LGBT+ Denmark, however, they want a very clear answer to what to expect if you as a transgender person want to apply for entry to the United States. Therefore, they will contact the American embassy directly.\"</p><p>It is expected that more European nations will update travel guidance as President Trump reshapes America's domestic and foreign policy.</p>","contentLength":3202,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgfqr6/denmark_issues_travel_warning_for_us/"},{"title":"European military powers work on 5-to-10-year plan to replace US in NATO, FT reports","url":"https://www.reuters.com/world/european-military-powers-work-5-to-10-year-plan-replace-us-nato-ft-reports-2025-03-20/","date":1742547339,"author":"/u/Yveliad","guid":672,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jgcev0/european_military_powers_work_on_5to10year_plan/"}],"tags":["news"]}