{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUzeL5ivJoY5WSx4w5moASQett8YcdzHs9m4PQRA8RiKa3KJRqE5PpmVYkV","title":"top scoring links : selfhosted","displayTitle":"Reddit - Self Hosted","url":"https://www.reddit.com/r/selfhosted/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/selfhosted/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"WARNING: If you have ddclient configured to use dynamicdns.park-your-domain.com, it will change your Dynamic DNS IP to a server in China (1.0.1.1)","url":"https://www.reddit.com/r/selfhosted/comments/1jgst3w/warning_if_you_have_ddclient_configured_to_use/","date":1742594477,"author":"/u/yuuuuuuuut","guid":688,"unread":true,"content":"<p>TLDR: If you are using  for dynamic DNS and you have it configured to use <code>dynamicdns.park-your-domain.com</code> for fetching your IP address, it will incorrectly set the IP address for your configured domains to .  says this server is owned by China Telecom.</p><p>Just ran into a very strange bug. All my web services were unreachable. I checked my DNS records and found they had all been changed to . After some digging, it turns out that requests to <code>dynamicdns.park-your-domain.com</code> are now returning a header with  in it.</p><p>For whatever reason,  parses the entire response (not just the body) and takes the first thing that looks like an IP address and uses that when it updates your DNS records. park-your-domain.com is now returning a  header with  in it and  is interpreting this as your IP address.</p><p>There is a github issue tracking this:</p><p>And it appears this functionality has been patched in the latest version of  but it is not available on my distro's repos yet.</p><p>My solution is to use a different service for fetching my IP address and I have this in my :</p><p><code> usev4=webv4, webv4=https://api.ipify.org </code></p><p>I'm not sure how many requests were made from my devices to the wrong IP address but it's definitely possible that this could be a method of hijacking session tokens. I'm rotating all my passwords and expiring active sessions for all my services.</p>","contentLength":1333,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Plex to Jellyfin migration going good so far","url":"https://www.reddit.com/r/selfhosted/comments/1jgssoe/plex_to_jellyfin_migration_going_good_so_far/","date":1742594450,"author":"/u/LitCast","guid":691,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Any reason to buy a domain if you don't make anything published externally?","url":"https://www.reddit.com/r/selfhosted/comments/1jgp6ek/any_reason_to_buy_a_domain_if_you_dont_make/","date":1742585112,"author":"/u/SnooDoughnuts9361","guid":689,"unread":true,"content":"<p>Only reason I can think of is having a proper CA signing my certs so I don't need to add my cert to all my clients. But am I missing anything?</p>","contentLength":142,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How much trust do you put into the containers you run?","url":"https://www.reddit.com/r/selfhosted/comments/1jgl3zo/how_much_trust_do_you_put_into_the_containers_you/","date":1742574968,"author":"/u/SnooDoughnuts9361","guid":687,"unread":true,"content":"<p>I am considering deploying a stack and uploading my personal data to it, but it has me thinking on the security part of it. I plan to restrict the Docker node to LAN only via Firewall rules, but what's stopping a malicious container update sending personal data to a central server, or \"phoning home\"? Using this for bank and credit card statements for Firefly, photos to immich, and receipts and legal documents to paperless I might need to rethink. Is that not safe?</p>","contentLength":468,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What app you can't live without that no one is talking about?","url":"https://www.reddit.com/r/selfhosted/comments/1jgfu5n/what_app_you_cant_live_without_that_no_one_is/","date":1742560724,"author":"/u/SillyLilBear","guid":692,"unread":true,"content":"<p>I'm always looking for ideas for self hosting services. What's one that you don't see people talking about but you can't live without? We see a million posts asking what is your favorite.</p><p>For me, it's self hosting Healthchecks.io. I love this service, and I use it for work and home extensively, especially to keep track of my backups, monthly backup verification, and monthly pruning of backups. I use the public healthchecks.io to do a sanity check on my instance to assure it is running as well as IP checks on the server that runs it. If my backup fails for whatever reason, I know about it immediately.</p>","contentLength":606,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"This Week in Self-Hosted (21 March 2025)","url":"https://www.reddit.com/r/selfhosted/comments/1jgf2bv/this_week_in_selfhosted_21_march_2025/","date":1742558126,"author":"/u/shol-ly","guid":690,"unread":true,"content":"<p>Happy Friday, <a href=\"https://www.reddit.com/r/selfhosted\">r/selfhosted</a>! Linked below is the latest edition of , a weekly newsletter recap of the latest activity in self-hosted software and content.</p><p>This week's features include:</p><ul><li>Plex Pass subscription updates</li><li>Cloudflare's annual security week</li><li>Software updates and launches</li><li>A spotlight on <a href=\"https://github.com/damian-krychowski/plikshare?ref=selfh.st\">PlikShare</a> -- a file uploading and sharing platform</li><li>A ton of great guides and content from the community</li></ul><p>Thanks, and as usual, feel free to reach out with feedback!</p>","contentLength":450,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}