{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUzeL5ivJoY5WSx4w5moASQett8YcdzHs9m4PQRA8RiKa3KJRqE5PpmVYkV","title":"top scoring links : selfhosted","displayTitle":"Reddit - Self Hosted","url":"https://www.reddit.com/r/selfhosted/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/selfhosted/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Portainer free upgrade to business edition","url":"https://www.reddit.com/r/selfhosted/comments/1j6w9mn/portainer_free_upgrade_to_business_edition/","date":1741483214,"author":"/u/vinesh178","guid":678,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/vinesh178\"> /u/vinesh178 </a>","contentLength":32,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reporting undisclosed tracking script in docker image","url":"https://www.reddit.com/r/selfhosted/comments/1j6su1d/reporting_undisclosed_tracking_script_in_docker/","date":1741473086,"author":"/u/DensePineapple","guid":676,"unread":true,"content":"<p>I was testing out a new service I found on github and discovered the image was trying to connect to an external site. Not the usual telemetry suspects but a small bash script collecting somewhat benign system info and posting to a suspicious url not mentioned in the repo at all. I contacted the author who claims its just gathering usage statistics for dev purposes and dismissed the issue saying I can just turn it off. Am I wrong to report the repo / image? Not mentioning it, deliberately misrepresenting the purpose in comments, and making it opt out all point to malicious intent. Also it must be against something like GDPR, right?</p>","contentLength":638,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"“Why do you have a dashboard?”","url":"https://www.reddit.com/r/selfhosted/comments/1j6sqvo/why_do_you_have_a_dashboard/","date":1741472840,"author":"/u/-ManWhat","guid":679,"unread":true,"content":"<p>Posting this because I saw the question asked in this sub a few days ago. In short, Home Assistant makes a fantastic dashboard and with some time, patience, and creativity, the sky is the limit. I’m more than willing to help out with configs and YAML :)</p>","contentLength":255,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"WALL OF SHAME - \"Why does this Proxmox node keep hanging on boot?!?\"","url":"https://www.reddit.com/r/selfhosted/comments/1j6pt3x/wall_of_shame_why_does_this_proxmox_node_keep/","date":1741464741,"author":"/u/iansaul","guid":675,"unread":true,"content":"<p>This SilverStone RM43-320-RS sounds like it's trying to take off when all three of the 120MM fans are plugged into the back of the disk controller for power. You'd think there was a mini-tornado in my office, and you can hear it all the way across the house.</p><p>I figured NO PROBLEM, nothing a little lm-sensors and fancontrol can't fix. After running into issues with this particular MOBO, I went in a totally different direction.</p><p>Why not use BIOS fan curves on the MSI MPG Z590 GAMING PLUS, to avoid worrying about any OS or docker based solutions. That appeared to work like a charm... in BIOS... with an HDMI monitor plugged in.</p><p>But on reboot.... system shows hung....</p><p>Must be the lm-sensors.... GRUB e - bypass loading components... no luck. GRUB e - emergency...... finally back in... Ok... well... lucky me I did a ZFS snapshot RIGHT before starting any of these shenanigans. Rollback the snapshot....</p><p>At this point, I'm thinking... \"Ok... this system booted up FINE before... this is either due to BIOS control of the PWM fans.... or this MONITOR is hanging the boot.... which makes ZERO SENSE.\"</p><p>On a whim, I checked if I could SSH... lo and behold:</p><p><code>root@*********'s password:</code></p><p>Blimey. She's not hung at all, never has been. I have the GPU in passthrough so that we can Sunshine to the LR TV.</p><p>I didn't need that hour of my life anyways.</p><p>Hope it brings a chuckle to others, like it did me.</p>","contentLength":1382,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A definitive list of open source","url":"https://www.reddit.com/r/selfhosted/comments/1j6kz8p/a_definitive_list_of_open_source/","date":1741451813,"author":"/u/ConsistentCan4633","guid":680,"unread":true,"content":"<p>Hey everyone! I've been building this list of definitive opensource software and I'm super proud of it so far - it serves as a single centralized location for the best of opensource, a lot of which are self hosted.</p><p>Why I made it: Over the last couple months I've had this sudden obsession with replacing everything proprietary with opensource. After hundreds of hours over months of searching I finally settled on around 80 opensource apps. What I realized though was that almost all the apps I went with were found through Reddit posts, google searches, or just random sources across the web.</p><p>All the GitHub Awesome Lists I went through didn't even include a lot of the \"best\" and most popular OSS projects out there and were instead filled with smaller projects - a lot of which were abandoned. </p><p>I have yet to find any resource that serves as a centralized location for the best of opensource - and that's what this list aims to be. </p>","contentLength":932,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Innovation comes from necessity! Automate Liked Songs downloads from Spotify!","url":"https://github.com/riAs-g/Spot-Down","date":1741447691,"author":"/u/SIRAJ_114","guid":677,"unread":true,"content":"<p>Hello everyone, with the increasing monopoly of the Big Tech on our lives and attention I believe it is time to make use of the old ways. I have created a python script to automate song downloads from spotify Liked playlist. It will take some time depending on the number of songs you have in your Liked playlist.</p><p>I was fed up of ads, so I just had to figure something out myself. I am sure all the devs will have no problem running this script and also modifying it to their liking but I have tried my best to write a good Readme for all the common folks. Please make sure to read the entire Readme before running the script.</p><p>Also, if you are going to use this script in any way shape or form, please consier starring it on Github and if you don't have a github account please upvote my comment in the comment section, so that I can get a number on how many people are using it.</p>","contentLength":877,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/selfhosted/comments/1j6ji16/innovation_comes_from_necessity_automate_liked/"}],"tags":["dev"]}