{"id":"6gUbcJtcgqw1wQBapm8qwcP58MMnPvoDmUVDva7XtKUuLQTDpuyDxDo1yehnZDohDQ6a5p","title":"Slashdot: Developers","displayTitle":"Dev - Slashdot - Dev","url":"http://rss.slashdot.org/Slashdot/slashdotDevelopers","feedLink":"https://developers.slashdot.org/","is_query":false,"items":[{"title":"'International Obfuscated C Code Contest' Will Relaunch, Celebrating 40th Anniversary","url":"https://developers.slashdot.org/story/24/12/29/1730224/international-obfuscated-c-code-contest-will-relaunch-celebrating-40th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735493640,"author":"EditorDavid","unread":true,"desc":"","content":"After a four-year hiatus, 2025 will see the return of the International Obfuscated C Code Contest. Started in 1984 (and inspired partly by a bug in the classic Bourne shell), it's \"the Internet's oldest contest,\" acording to their official social media account on Mastodon. \n\nThe contest enters its \"pending\" state today at 2024-12-29 23:58 UTC &mdash; meaning an opening date for submissions has been officially scheduled (for January 31st) as well as a closing date roughly eight weeks later on April 1st, 2025. That's according to the newly-released (proposed and tentative) rules and guidelines, listing contest goals like \"show the importance of programming style, in an ironic way\" and \"stress C compilers with unusual code.\" And the contest's home page adds an additional goal: \"to have fun with C!\" \n\nExcerpts from the official rules:\n\n\nRule 0 \nJust as C starts at 0, so the IOCCC starts at rule 0. :-) \n\nRule 1 \nYour submission must be a complete program.... \n\nRule 5 \nYour submission MUST not modify the content or filename of any part of your original submission including, but not limited to prog.c, the Makefile (that we create from your how to build instructions), as well as any data files you submit.... \n\n\nRule 6 \nI am not a rule, I am a free(void *human); \n while (!(ioccc(rule(you(are(number(6)))))) {\n ha_ha_ha();\n } \n\n \nRule 6 is clearly a reference to The Prisoner... (Some other rules are even sillier...) And the guidelines include their own jokes:\n You are in a maze of twisty guidelines, all different. \n\nThere are at least zero judges who think that Fideism has little or nothing to do with the IOCCC judging process.... \n\n\nWe suggest that you avoid trying for the 'smallest self-replicating' source. The smallest, a zero byte entry, won in 1994.\n \n\nAnd this weekend there was also a second announcement:\n\nAfter a 4 year effort by a number of people, with over 6168+ commits, the Great Fork Merge has been completed and the Official IOCCC web site has been updated! A significant number of improvements has been made to the IOCCC winning entries. A number of fixes and improvements involve the ability of reasonable modern Unix/Linux systems to be able to compile and even run them. \n\nThanks to long-time Slashdot reader &mdash; and C programmer &mdash; achowe for sharing the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='International+Obfuscated+C+Code+Contest'+Will+Relaunch%2C+Celebrating+40th+Anniversary%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F29%2F1730224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F29%2F1730224%2Finternational-obfuscated-c-code-contest-will-relaunch-celebrating-40th-anniversary%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/29/1730224/international-obfuscated-c-code-contest-will-relaunch-celebrating-40th-anniversary?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Python in 2024: Faster, More Powerful, and More Popular Than Ever","url":"https://developers.slashdot.org/story/24/12/29/0534253/python-in-2024-faster-more-powerful-and-more-popular-than-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735461240,"author":"EditorDavid","unread":true,"desc":"","content":"\"Over the course of 2024, Python has proven again and again why it's one of the most popular, useful, and promising programming languages out there,\" writes InfoWorld:\n\nThe latest version of the language pushes the envelope further for speed and power, sheds many of Python's most decrepit elements, and broadens its appeal with developers worldwide. Here's a look back at the year in Python. \n\nIn the biggest news of the year, the core Python development team took a major step toward overcoming one of Python's longstanding drawbacks: the Global Interpreter Lock or \"GIL,\" a mechanism for managing interpreter state. The GIL prevents data corruption across threads in Python programs, but it comes at the cost of making threads nearly useless for CPU-bound work. Over the years, various attempts to remove the GIL ended in tears, as they made single-threaded Python programs drastically slower. But the most recent no-GIL project goes a long way toward fixing that issue &mdash; enough that it's been made available for regular users to try out. \n\nThe no-GIL or \"free-threaded\" builds are still considered experimental, so they shouldn't be deployed in production yet. The Python team wants to alleviate as much of the single-threaded performance impact as possible, along with any other concerns, before giving the no-GIL builds the full green light. It's also entirely possible these builds may never make it to full-blown production-ready status, but the early signs are encouraging. \nAnother forward-looking feature introduced in Python 3.13 is the experimental just-in-time compiler or JIT. It expands on previous efforts to speed up the interpreter by generating machine code for certain operations at runtime. Right now, the speedup doesn't amount to much (maybe 5% for most programs), but future versions of Python will expand the JIT's functionality where it yields real-world payoffs.\n \nPython is now more widely used than JavaScript on GitHub (thanks partly to its role in AI and data science code).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Python+in+2024%3A+Faster%2C+More+Powerful%2C+and+More+Popular+Than+Ever%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F29%2F0534253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F29%2F0534253%2Fpython-in-2024-faster-more-powerful-and-more-popular-than-ever%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/29/0534253/python-in-2024-faster-more-powerful-and-more-popular-than-ever?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Bret Taylor Urges Rethink of Software Development as AI Reshapes Industry","url":"https://developers.slashdot.org/story/24/12/25/1611229/bret-taylor-urges-rethink-of-software-development-as-ai-reshapes-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735143000,"author":"msmash","unread":true,"desc":"","content":"Software development is entering an \"autopilot era\" with AI coding assistants, but the industry needs to prepare for full autonomy, argues former Salesforce co-CEO Bret Taylor. Drawing parallels with self-driving cars, he suggests the role of software engineers will evolve from code authors to operators of code-generating machines. Taylor, a board member of OpenAI and who once rewrote Google Maps over a weekend, calls for new programming systems, languages, and verification methods to ensure AI-generated code remains robust and secure. From his post: In the Autonomous Era of software engineering, the role of a software engineer will likely transform from being the author of computer code to being the operator of a code generating machine. What is a computer programming system built natively for that workflow? \n\nIf generating code is no longer a limiting factor, what types of programming languages should we build? \n\nIf a computer is generating most code, how do we make it easy for a software engineer to verify it does what they intend? What is the role of programming language design (e.g., what Rust did for memory safety)? What is the role of formal verification? What is the role of tests, CI/CD, and development workflows? \n\nToday, a software engineer's primary desktop is their editor. What is the Mission Control for a software engineer in the era of autonomous development?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bret+Taylor+Urges+Rethink+of+Software+Development+as+AI+Reshapes+Industry%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F25%2F1611229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F25%2F1611229%2Fbret-taylor-urges-rethink-of-software-development-as-ai-reshapes-industry%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/25/1611229/bret-taylor-urges-rethink-of-software-development-as-ai-reshapes-industry?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Microsoft Integrates a Free Version of Its 'Copilot' Coding AI Into GitHub, VS Code","url":"https://developers.slashdot.org/story/24/12/21/0443255/microsoft-integrates-a-free-version-of-its-copilot-coding-ai-into-github-vs-code?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734802440,"author":"EditorDavid","unread":true,"desc":"","content":"An anonymous reader shared this report from TechCrunch:\n\nMicrosoft-owned GitHub announced on Wednesday a free version of its popular Copilot code completion/AI pair programming tool, which will also now ship by default with Microsoft's popular VS Code editor. Until now, most developers had to pay a monthly fee, starting at $10 per month, with only verified students, teachers, and open source maintainers getting free access... \n\n\nThere are some limitations to the free version, which is geared toward occasional users, not major work on a big project. Developers on the free plan will get access to 2,000 code completions per month, for example, and as a GitHub spokesperson told me, each Copilot code suggestion will count against this limit &mdash; not just accepted suggestions. And while GitHub recently added the ability to switch between different foundation models, users on the free plan are limited to Anthropic's Claude 3.5 Sonnet and OpenAI's GPT-4o. (The paid plans also include Google's Gemini 1.5 Pro and OpenAI's o1-preview and -mini.) For Copilot Chat, the number of chat messages is limited to 50, but otherwise, there aren't any major limitations to the free service. Developers still get access to all Copilot Extensions and skills. \n\nThe free Copilot SKU will work in a number of editors, including VS Code, Visual Studio, and JetBrains, as well as on GitHub.com. \n\nGitHub's announcement ends with the words \"Happy coding!\" and calls the service \"GitHub Copilot Free.\" But TechCrunch points out there's already competition from services like Amazon Q Developer, as well as from companies like Tabnine and Qodo (previously known as Codium) &mdash; and they typically offer a free tier. But in addition, \"With Copilot Free, we are returning to our freemium roots,\" GitHub CEO Thomas Dohmke told TechCrunch, as well as \"laying the groundwork for something far greater: AI represents our best path to enabling a GitHub with one billion developers. \n\n\"There should be no barrier to entry for experiencing the joy of creating software. Now six years after being acquired by Microsoft, it indeed appears GitHub is still GitHub &mdash; and we are doing our thing.\" \n\nOr, as GitHub CEO Satya Nadella said in a video posted on LinkedIn, \"The joy of coding is back! And we are looking forward to bringing the same experience to so many more people around the world.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Integrates+a+Free+Version+of+Its+'Copilot'+Coding+AI+Into+GitHub%2C+VS+Code%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F21%2F0443255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F21%2F0443255%2Fmicrosoft-integrates-a-free-version-of-its-copilot-coding-ai-into-github-vs-code%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/21/0443255/microsoft-integrates-a-free-version-of-its-copilot-coding-ai-into-github-vs-code?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Amazon Says Developers Spend 'Just One Hour Per Day' on Actual Coding","url":"https://developers.slashdot.org/story/24/12/12/0414226/amazon-says-developers-spend-just-one-hour-per-day-on-actual-coding?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733977800,"author":"msmash","unread":true,"desc":"","content":"An anonymous reader shares a report: Amazon Web Services said in a post earlier this month that developers report spending an average of \"just one hour per day\" on actual coding. But that doesn't mean these workers twiddle their thumbs the remaining seven hours per day. Instead, developers spend the majority of their time on \"tedious, undifferentiated tasks such as learning codebases, writing and reviewing documentation, testing, managing deployments, troubleshooting issues or finding and fixing vulnerabilities,\" according to Amazon Web Services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Says+Developers+Spend+'Just+One+Hour+Per+Day'+on+Actual+Coding%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F12%2F0414226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F12%2F0414226%2Famazon-says-developers-spend-just-one-hour-per-day-on-actual-coding%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/12/0414226/amazon-says-developers-spend-just-one-hour-per-day-on-actual-coding?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Google's New Jules AI Agent Will Help Developers Fix Buggy Code","url":"https://developers.slashdot.org/story/24/12/11/1734248/googles-new-jules-ai-agent-will-help-developers-fix-buggy-code?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733947260,"author":"msmash","unread":true,"desc":"","content":"Google has announced an experimental AI-powered code agent called \"Jules\" that can automatically fix coding errors for developers. From a report: Jules was introduced today alongside Gemini 2.0, and uses the updated Google AI model to create multi-step plans to address issues, modify multiple files, and prepare pull requests for Python and Javascript coding tasks in GitHub workflows. \n\nMicrosoft introduced a similar experience for GitHub Copilot last year that can recognize and explain code, alongside recommending changes and fixing bugs. Jules will compete against Microsoft's offering, and also against tools like Cursor and even Claude and ChatGPT's coding abilities. Google's launch of a coding-focused AI assistant is no surprise -- CEO Sundar Pichai said in October that more than a quarter of all new code at the company is now generated by AI. \n\n\"Jules handles bug fixes and other time-consuming tasks while you focus on what you actually want to build,\" Google says in its blog post. \"This effort is part of our long-term goal of building AI agents that are helpful in all domains, including coding.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google's+New+Jules+AI+Agent+Will+Help+Developers+Fix+Buggy+Code%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F11%2F1734248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F11%2F1734248%2Fgoogles-new-jules-ai-agent-will-help-developers-fix-buggy-code%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/11/1734248/googles-new-jules-ai-agent-will-help-developers-fix-buggy-code?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Open Source Maintainers Are Drowning in Junk Bug Reports Written By AI","url":"https://developers.slashdot.org/story/24/12/10/2334221/open-source-maintainers-are-drowning-in-junk-bug-reports-written-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733878800,"author":"msmash","unread":true,"desc":"","content":"An anonymous reader shares a report: Software vulnerability submissions generated by AI models have ushered in a \"new era of slop security reports for open source\" -- and the devs maintaining these projects wish bug hunters would rely less on results produced by machine learning assistants. Seth Larson, security developer-in-residence at the Python Software Foundation, raised the issue in a blog post last week, urging those reporting bugs not to use AI systems for bug hunting. \n\n\"Recently I've noticed an uptick in extremely low-quality, spammy, and LLM-hallucinated security reports to open source projects,\" he wrote, pointing to similar findings from the Curl project in January. \"These reports appear at first glance to be potentially legitimate and thus require time to refute.\" Larson argued that low-quality reports should be treated as if they're malicious. \n\nAs if to underscore the persistence of these concerns, a Curl project bug report posted on December 8 shows that nearly a year after maintainer Daniel Stenberg raised the issue, he's still confronted by \"AI slop\" -- and wasting his time arguing with a bug submitter who may be partially or entirely automated.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Open+Source+Maintainers+Are+Drowning+in+Junk+Bug+Reports+Written+By+AI%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F10%2F2334221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F10%2F2334221%2Fopen-source-maintainers-are-drowning-in-junk-bug-reports-written-by-ai%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/10/2334221/open-source-maintainers-are-drowning-in-junk-bug-reports-written-by-ai?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Thanks to AI, the Hottest New Programming Language is... English","url":"https://developers.slashdot.org/story/24/12/08/2154224/thanks-to-ai-the-hottest-new-programming-language-is-english?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733695020,"author":"EditorDavid","unread":true,"desc":"","content":"\"Generative AI is transforming software development by enabling natural language prompts to generate code, reducing the need for traditional programming skills,\" argues Analytics India magazine.\n\n\nTraditionally, coding was the bastion of the select few who had mastered mighty languages like C++, Python, or Java. The idea of programming seemed exclusively reserved for those fluent in syntax and logic. However, the narrative is now being challenged by natural language coding being implemented in AI tools like GitHub Copilot. Andrej Karpathy, senior director of AI at Tesla predicted this trend last year.... English is emerging as the universal coding language. \n\nNVIDIA CEO Jensen Huang believes that English is becoming a new programming language thanks to AI advancements. Speaking at the World Government Summit, Huang explained, \"It is our job to create computing technology such that nobody has to program and that the programming language is human\"... He calls this a \"miracle of AI,\" emphasising how it closes the technology divide and empowers people from all fields to become effective technologists without traditional coding skills... \"In the future, you will tell the computer what you want, and it will do it,\"&#226; Huang commented. Large language models (LLMs) like OpenAI's GPT-4 and its successors have made this possible... \n\n\nMicrosoft CEO Satya Nadella has been equally vocal about the potential of English for coding. Microsoft's GitHub Copilot, an AI code assistant, enables developers to describe their needs in natural language and receive functional code in response. Nadella describes this as part of a broader mission to \"empower every person and every organisation on the planet to achieve more\".... In a discussion earlier last year, Stability AI CEO Emad Mostaque claimed, \"41% of codes on GitHub are AI-generated\"... \n\nIn 2024, the ability to program is no longer reserved for a few. It's a skill anyone can wield, thanks to the power of natural language processing and AI\n \n\"No longer is the power to create software restricted to those who can decipher programming languages,\" the article concludes. \"Anyone with a problem to solve and a clear enough articulation of that problem can now write software.\" \n\nAlthough the article also includes this consoling quote from Nvidia's Huang in March. \"There is an artistry to prompt engineering. It's how you fine-tune the instructions to get exactly what you want\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Thanks+to+AI%2C+the+Hottest+New+Programming+Language+is...+English+%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F08%2F2154224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F08%2F2154224%2Fthanks-to-ai-the-hottest-new-programming-language-is-english%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/08/2154224/thanks-to-ai-the-hottest-new-programming-language-is-english?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The 2024 'Advent Calendars' Offering Programming Language Tips, Space Photos, and Memories","url":"https://entertainment.slashdot.org/story/24/12/04/0143242/the-2024-advent-calendars-offering-programming-language-tips-space-photos-and-memories?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733672040,"author":"EditorDavid","unread":true,"desc":"","content":"Not every tech \"advent calendar\" involves programming puzzles. Instead the geek tradition of programming-language advent calendars \"seems to have started way back in 2000,\" according to one history, \"when London-based programmer Mark Fowler launched a calendar highlighting a different Perl module each day.\" \nSo the tradition continues...\n\nNearly a quarter of a century later, there's still a Perl Advent Calendar, celebrating tips and tricks like \"a few special packages waiting under the tree that can give your web applications a little extra pep in their step.\"\nAnd of course there's a separate advent calendar for Raku programmers.\nSince 2009 web performance consultant (and former Yahoo and Facebook engineer) Stoyan Stefanov has been pulling together an annual Web Performance calendar with helpful blog posts. \nThere's also a JVM Advent calendar with daily helpful hints for Java programmers.\nAnother advent calendar promises daily posts about C#.\nThe HTMHell site &mdash; which bills itself as \"a collection of bad practices in HTML, copied from real websites\" &mdash; is celebrating the season with the \"HTMHell Advent Calendar,\" promising daily articles on security, accessibility, UX, and performance.\nThere's even an advent calendar with tips for the reverse-engineering framework Radar.\nThere's still a lovely web-design themed calendar at Designcember.com.\n\n\nAnd meanwhile developers at the Svelte frontend framework are actually promising to release something new each day, \"whether it's a new feature in Svelte or SvelteKit or an improvement to the website!\" \n\n\nBut not every tech advent calendar is about programming...\n\nAdafruit's managing director is publishing a Retrocomputing Advent Calendar &mdash; daily looks at the ghosts of computers past.\n\nThe Atlantic continues its 17-year tradition of a Space Telescope advent calendar, featuring daily images from both NASA's Hubble telescope and James Webb Space Telescope\nThe gaming blog Rock Paper Shotgun has been counting down their favorite games of 2024...\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+2024+'Advent+Calendars'+Offering+Programming+Language+Tips%2C+Space+Photos%2C+and+Memories%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0143242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0143242%2Fthe-2024-advent-calendars-offering-programming-language-tips-space-photos-and-memories%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/04/0143242/the-2024-advent-calendars-offering-programming-language-tips-space-photos-and-memories?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Amazon Offers $100M in Cloud-Computing Credits for Education Projects Like 'AI Teaching Assistant'","url":"https://news.slashdot.org/story/24/12/07/1736233/amazon-offers-100m-in-cloud-computing-credits-for-education-projects-like-ai-teaching-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733593140,"author":"EditorDavid","unread":true,"desc":"","content":"This week AWS pledged up to $100 million in cloud-computing credits for educational organizations over the next five years, to help them build \"technology-based learning experiences\" on AWS, including:\n AI assistants coding curriculums\n- connectivity tools student learning platforms mobile apps chatbots\n\nOne example shared by Amazon: The nonprofit Code.org will use AWS's cloud credits to scale their AI teaching assistant that \"has already helped teachers reduce the time they spend assessing students' coding projects by up to 50%.\" (Amazon's blog post notes that \"Improved efficiency means teachers have more time to work on personalized lesson plans and coach students\" &mdash; and that Code.org's assistant uses an AWS service for building AI tools...) \n\n$100 million sounds pretty generous. But long-time Slashdot reader theodp notes the application for the cloud credits limits education organization to $100,000 in credits (though \"your organization may be able to apply for a credits expansion\" if needed). Do these figures suggest Amazon expects less than 1,000 organizations to apply for free cloud-computing over the next five years? ($100,000,000/$100,000 = 1,000) \n\ntheodp also spotted a GitHub comment from a Code.org software engineer comparing accuracy for its teaching assistant after a switch from GPT-4 Turbo to Claude. Both before and after the switch, the teaching assistant averaged an accuracy rate of 77%, the comment notes. \n\nI guess that 77% accuracy rate is what Amazon is calling \"improved efficiency\" that \"means teachers have more time to work on personalized lesson plans and coach students.\" (Maybe you're never to young to learn that AI makes mistakes?)<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Offers+%24100M+in+Cloud-Computing+Credits+for+Education+Projects+Like+'AI+Teaching+Assistant'%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F07%2F1736233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F07%2F1736233%2Famazon-offers-100m-in-cloud-computing-credits-for-education-projects-like-ai-teaching-assistant%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/12/07/1736233/amazon-offers-100m-in-cloud-computing-credits-for-education-projects-like-ai-teaching-assistant?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Mozilla Announces 'JavaScriptmas' - Daily Coding Challenges with a Chance at Prizes","url":"https://tech.slashdot.org/story/24/12/04/0138255/mozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733499240,"author":"EditorDavid","unread":true,"desc":"","content":"Mozilla's developer blog is announcing \"JavaScriptmas\".\n\n [F]rom December 1st to December 24th, we will release a fun, daily coding challenge for you to solve on [code-learning platform] Scrimba. Each challenge comes with an introductory screencast called \"scrim\", some starter code, and then it's your turn to fill in the gaps. \n\nJavaScriptmas is about coding, learning, and the chance to win exciting prizes. Two lucky coders will be chosen as winners at the end of JavaScriptmas, and each will win a MacBook Air M3, swag from MDN and Scrimba, and a lifetime Scrimba Pro membership (worth ~$200 per year). The Scrimba membership will give you access to all courses, including the Frontend Developer Career Path based on the MDN curriculum. \nMost of the challenges will evolve around JavaScript algorithms. You will also practice subjects like DOM manipulation, UI design, CSS, accessibility, and even a bit of cyber security. The challenges are a collaborative effort from Scrimba teachers, mentors, and MDN content writers, all with the goal of turning you into a more well-rounded web developer. \nWinners will be chosen randomly from everyone who submits correct solutions. We want JavaScriptmas to be accessible for both beginners and experienced developers alike. That said, the more challenges you solve, the better your chances of winning! To maximize your chances, try to solve all 24 challenges and submit them as both regular entries and social entries. You don't have to submit your solutions on the same day they're published &mdash; the deadline for any submission is midnight UTC on Christmas Eve.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mozilla+Announces+'JavaScriptmas'+-+Daily+Coding+Challenges+with+a+Chance+at+Prizes%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F04%2F0138255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F04%2F0138255%2Fmozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/12/04/0138255/mozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"The Rust Foundation's Plan to Grow the Pool of Well-Trained Rust Developers","url":"https://developers.slashdot.org/story/24/12/05/2222220/the-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733437500,"author":"EditorDavid","unread":true,"desc":"","content":"\"The Rust Foundation is dedicated to ensuring a healthy Rust ecosystem,\" according to a new announcement today, \" which depends on a growing pool of well-trained developers to thrive.\"\n\nThe latest SlashData Developer Nation survey found Rust to be the fastest-growing programming language, doubling its users over the past two years. As Rust's adoption continues to accelerate, the demand for a multifaceted ecosystem of quality training will too.\n \n\nTheir blog post highlights three examples of the Rust community \"creating new pathways for learning Rust\" and \"addressing the critical need for Rust training in academic settings...\"\n\n\nRust-Edu operates as a non-profit through Portland State University, with funding from Futurewei. Their mission is to \"spread Rust use and development through academic curricula and communities throughout the world, making Rust the language of choice for 'systems programming' in its broadest sense through shared efforts of faculty, students and the Rust community.\" They focus on three main areas: curriculum development, educational tools, and language improvements... \n\n\nteach-rs, pronounced \"teachers,\" is a modular and reusable university course designed for in-person teaching in Rust. Its mission is to introduce Rust in higher education and ensure that more students enter the job market with considerable Rust experience. The teach-rs project provides ready-to-use Rust teaching materials, including slide decks and exercises that can be adapted to various teaching contexts... As an open source permissively licensed project, teach-rs enables educators to share and improve resources, making introducing Rust instruction into their programs more accessible. Many institutions now use teach-rs in their courses, including the Slovak University of Technology, RustIEC (a collaboration between Vrije Universiteit Brussel and KU Leuven), and the University Politehnica of Bucharest. At the time of this writing, teach-rs has nearly 3000 stars on GitHub... \n\nUnder the guidance of The Rust Foundation's Global Rust Coordinator and Rust Nation UK's organizer Ernest Kissiedu, Mordecai Etukudo (Mart) has developed a guide to help educational institutions adopt Rust in their systems. This resource walks organizations through the entire implementation process, from initial assessment to community engagement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Rust+Foundation's+Plan+to+Grow+the+Pool+of+Well-Trained+Rust+Developers%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F05%2F2222220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F05%2F2222220%2Fthe-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/05/2222220/the-rust-foundations-plan-to-grow-the-pool-of-well-trained-rust-developers?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Meta Using OpenAI's GPT-4 in Internal Coding Tool Despite Llama Push","url":"https://developers.slashdot.org/story/24/12/04/0033227/meta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733333640,"author":"msmash","unread":true,"desc":"","content":"Meta is using OpenAI's GPT-4 alongside its own Llama AI model in Metamate, an internal coding assistance tool, Fortune reported Tuesday. The dual-model approach has been in place since early 2024, despite CEO Mark Zuckerberg's public promotion of Llama as a leading AI model. \n\nMetamate, previously known as Code Compose, serves Meta's developers and employees with coding support. The Chan Zuckerberg Initiative, Zuckerberg's philanthropic organization, is separately developing an educational AI tool using OpenAI's technology, with OpenAI CEO Sam Altman joining CZI's AI advisory board.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Using+OpenAI's+GPT-4+in+Internal+Coding+Tool+Despite+Llama+Push%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F04%2F0033227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F04%2F0033227%2Fmeta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/24/12/04/0033227/meta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"2024's Geek 'Advent Calendar's Offer Challenges - and a Magnus Carlsen-Signed Chessboard","url":"https://entertainment.slashdot.org/story/24/12/04/0132245/2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733326440,"author":"EditorDavid","unread":true,"desc":"","content":"The long-running Advent of Code site just entered its 10th year, with 162,809 people completing both of its Day One puzzles (which involve a hunt for the missing historian of the North Pole).\n\nBut its not the only site offering Christmas-themed programming puzzles:\n\n\nHundreds of SQL lovers are trying the daily challenges from the \"Advent of SQL\" site.\n\nYou can sign up for daily emails with webdev challenges from the Advent of JavaScript and Advent of CSS sites. \nThe \"Advent of No-Code\" site challenges you to build something new every day using no-code tools like AI-powered dev environments or the social coding site Val Town.\n TryHackMe.com is publishing \"beginner-friendly, daily gamified cyber security challenges\" in an event they're calling the \"Advent of Cyber.\"\n\nAnd Norway's biggest chess club (founded by world champion Magnus Carlsen) has even launched a site with daily chess puzzles called &mdash; what else? &mdash; Advent of Chess. (It promises at the end of the event someone will win a chessboard signed by Magnus Carlsen).\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=2024's+Geek+'Advent+Calendar's+Offer+Challenges+-+and+a+Magnus+Carlsen-Signed+Chessboard%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0132245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F12%2F04%2F0132245%2F2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/12/04/0132245/2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Greg Kroah-Hartman Sees 'Tipping Point' for Rust Drivers in Linux Kernel","url":"https://linux.slashdot.org/story/24/12/01/1837222/greg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1733081640,"author":"EditorDavid","unread":true,"desc":"","content":"Greg Kroah-Hartman noted some coming changes in Linux 6.13 will make it possible to create \"way more\" Rust-based kernel drivers. \"The veteran kernel developer believes we're at a tipping point of seeing more upstream Rust drivers ahead,\" reports Phoronix:\n\nThese Rust char/misc changes are on top of the main Rust pull for Linux 6.13 that brought 3k lines of code for providing more Rust infrastructure. Linux 6.13 separately is also bringing Rust file abstractions.\n \n\n\"Sorry for doing this at the end of the merge window,\" Greg Kroah-Hartman wrote in the pull request, explaining that \"conference and holiday travel got in the way on my side (hence the 5am pull request emails...)\"\n\nLoads of things in here... \n &mdash; Rust misc driver bindings and other rust changes to make misc drivers actually possible. I think this is the tipping point, expect to see way more rust drivers going forward now that these bindings are present. \nNext merge window hopefully we will have pci and platform drivers working, which will fully enable almost all driver subsystems to start accepting (or at least getting) rust drivers. This is the end result of a lot of work from a lot of people, congrats to all of them for getting this far, you've proved many of us wrong in the best way possible, working code :)\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Greg+Kroah-Hartman+Sees+'Tipping+Point'+for+Rust+Drivers+in+Linux+Kernel%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F01%2F1837222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F01%2F1837222%2Fgreg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/24/12/01/1837222/greg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""}]}