{"id":"82kPqomaPXmNomrHzpZWfbkQxiiNUBTAYKxHR5qZBEpf","title":"Hacker News: Show HN","displayTitle":"HN Show","url":"https://hnrss.org/show?points=60","feedLink":"https://news.ycombinator.com/shownew","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":18,"items":[{"title":"Show HN: My Attempt to Organize the World of AI Dev Tools","url":"https://aicode.danvoronov.com/tools/","date":1742556164,"author":"dan_voronov","guid":102,"unread":true,"content":"<h2>Integrated Development Environments</h2><p>Closed or unmaintained projects: <a target=\"_blank\" href=\"https://github.com/codestoryai/aide\">aide</a> (Feb 25, 2025).</p><h2>AI-Coding Extensions for IDEs</h2><p>Closed or unmaintained projects: <a target=\"_blank\" href=\"https://github.com/rubberduck-ai/rubberduck-vscode\">rubberduck</a> (Feb 4, 2024).</p><h2>Command Line Interface (CLI) Tools</h2><h2>Web AI-Powered Generators</h2><h2>AI-Enhanced Development Tools</h2><p>Instead of paying for individual  for every AI service, there are cost-effective and flexible alternatives. One option is to use&nbsp;<a target=\"_blank\" href=\"https://openrouter.ai/\">OpenRouter</a>, which acts as a unified API for various models. This can potentially consolidate costs and simplify integration.</p><p>In addition to OpenRouter's own  in the programming section, you can always check <a target=\"_blank\" href=\"https://lmarena.ai/?arena\">Chatbot Arena (formerly LMSYS)</a> to see what model is currently performing better with programming or WebDev or Copilot tasks.</p><p>If you have powerful hardware and prioritize privacy or want more control, you can run large language models (LLMs) locally. Tools like&nbsp;<a target=\"_blank\" href=\"https://ollama.com/\">Ollama</a>&nbsp;and&nbsp;<a target=\"_blank\" href=\"https://lmstudio.ai/\">LM Studio</a> make it easier to deploy and manage these models on your own machine. For code autocompletion specifically, consider solutions with local-first option like&nbsp;<a target=\"_blank\" href=\"https://www.tabbyml.com/\">TabbyML</a>.</p>","contentLength":1048,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43434325"},{"title":"Show HN: Minimalytics – a standalone minimal analytics app built on SQLite","url":"https://github.com/nafey/minimalytics","date":1742499210,"author":"nafey","guid":101,"unread":true,"content":"<p>Hi everyone! I wanted to share my analytics app with you.</p><p>This project came from requirements to track certain very frequent events. I found that the cost to do it on a regular analytics product was much more than i was willing to pay. Secondly, I also wanted to use as few resources as possible. So I thought it may be a good idea to create something that may be useful for myself (and hopefully others).</p><p>I have been able to track a great number of events with this using ~20 MB of storage and memory which is incredible. I have been really impressed by golang as a language and as an ecosystem and would love to work more in this language going forward.</p><p>Some Highlights: \n1. No dependencies \n2. CLI based management \n3. Web based UI (and the server to serve it) included in the program. \n4. 20 MB install size.   \n5. 20 MB memory use while running.  \n6. Minimal storage requirements because it aggregates events.</p><p>This can be a great fit for anyone who wants to have a lightweight minimal analytics for internal events.</p><p>I am looking forward to your comments and feedback.</p>","contentLength":1067,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43427850"},{"title":"Show HN: AgentKit – JavaScript Alternative to OpenAI Agents SDK with Native MCP","url":"https://github.com/inngest/agent-kit","date":1742491666,"author":"tonyhb","guid":100,"unread":true,"content":"<p>Hi HN! I’m Tony, co-founder of Inngest. I wanted to share AgentKit, our Typescript multi-agent library we’ve been cooking and testing with some early users in prod for months.</p><p>Although  OpenAI’s Agents SDK has been launched since, we think an Agent framework should offer more deterministic and flexible routing, work with multiple model providers, embrace MCP (for rich tooling), and support the unstoppable and growing community of TypeScript AI developers by enabling a smooth transition to production use cases.</p><p>This is why we are building AgentKit, and we’re really excited about it for a few reasons:</p><p>Firstly, it’s simple. We embrace KISS principles brought by Anthropic and HuggingFace by allowing you to gradually add autonomy to your AgentKit program using primitives:</p><p>- Agents: LLM calls that can be combined with prompts, tools, and MCP native support.</p><p>- Networks: a simple way to get Agents to collaborate with a shared State, including handoff.</p><p>- State: combines conversation history with a fully typed state machine, used in routing.</p><p>- Routers: where the autonomy lives, from code-based to LLM-based (ex: ReAct) orchestration</p><p>The routers are where the magic happens, and allow you to build deterministic, reliable, testable agents.</p><p>AgentKit routing works as follows: the network calls itself in a loop, inspecting the State to determine which agents to call next using a router.  The returned agent runs, then optionally updates state data using its tools.  On the next loop, the network inspects state data and conversation history, and determines which new agent to run.</p><p>This fully typed state machine routing allows you to deterministically build agents using any of the effective agent patterns — which means your code is easy to read, edit, understand, and debug.</p><p>This also makes handoff incredibly easy: you define when agents should hand off to each other using regular code and state (or by calling an LLM in the router for AI-based routing). This is similar to the OpenAI Agents SDK but easier to manage, plan, and build.</p><p>Then comes the local development and moving to production capabilities.</p><p>AgentKit is compatible with Inngest’s tooling, meaning that you can test agents using Inngest’s local DevServer, which provides traces, inputs, outputs, replay, tool, and MCP inputs and outputs, and (soon) a step-over debugger so that you can easily understand and visually see what's happening in the agent loop.</p><p>In production, you can also optionally combine AgentKit with Inngest for fault-tolerant execution.  Each agent’s LLM call is wrapped in a step, and tools can use multiple steps to incorporate things like human-in-the-loop.  This gives you native orchestration, observability, and out-of-the-box scale.</p><p>You will find the documentation as an example of an AgentKit SWE-bench and multiple Coding Agent examples.</p><p>It’s fully open-source under the Apache 2 license.</p><p>If you want to get started:</p><p>- npm: npm i @inngest/agent-kit</p><p>We’re excited to finally launch AgentKit; let us know what you think!</p>","contentLength":3023,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43426164"},{"title":"Show HN: I built a MCP server so Claude can play Minesweeper","url":"https://github.com/tonypan2/minesweeper-mcp-server","date":1742457537,"author":"tonypan","guid":99,"unread":true,"content":"<p>Hi! I build an MCP server that allows clients to play Minesweeper. It turns out that Claude is not very good at it (makes obvious mistakes, hasn't won a single game on a 9x9 board after many attempts).</p><p>I am curious how I can prompt Claude to do better?</p>","contentLength":251,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43420678"},{"title":"Show HN: I made a worldwide sexual life dashboard","url":"https://www.worldsexmap.com/","date":1742347951,"author":"superderevo","guid":98,"unread":true,"content":"<p>All visualizations are based on 3,213 responses from the survey. The data updates with new responses. Last updated: 21 March 2025.</p>","contentLength":130,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43407423"},{"title":"Show HN: \"Git who\" – A new CLI tool for industrial-scale Git blaming","url":"https://github.com/sinclairtarget/git-who","date":1742329209,"author":"weebst","guid":97,"unread":true,"content":"<p>I've always wanted a better way to explore the authorship data embedded in a Git commit log. I'm having fun building a CLI tool to do this.</p><p>It's a bit like the \"Contributors\" tab on Github that shows you how many commits each contributor has made but much faster and with many more options.</p><p>If you get a chance to try it out, please let me know. I'd love to hear feedback and suggestions. Thank you!</p>","contentLength":397,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43404548"},{"title":"Show HN: I made a tool to port tweets to Bluesky mantaining their original date","url":"https://bluemigrate.com/","date":1742317659,"author":"nols05","guid":96,"unread":true,"content":"<div><div><img alt=\"BlueMigrate\" loading=\"lazy\" width=\"40\" height=\"40\" decoding=\"async\" data-nimg=\"1\" srcset=\"/_next/image?url=https%3A%2F%2Fcdn.bsky.app%2Fimg%2Favatar%2Fplain%2Fdid%3Aplc%3Aiu4nttjmi4kwd3trqkeq2dku%2Fbafkreidlks5quizuwgy64ksfqlprps7wwb5cqgtjswvufyzyaog3ukx3sy%40jpeg&amp;w=48&amp;q=75 1x, /_next/image?url=https%3A%2F%2Fcdn.bsky.app%2Fimg%2Favatar%2Fplain%2Fdid%3Aplc%3Aiu4nttjmi4kwd3trqkeq2dku%2Fbafkreidlks5quizuwgy64ksfqlprps7wwb5cqgtjswvufyzyaog3ukx3sy%40jpeg&amp;w=96&amp;q=75 2x\" src=\"https://bluemigrate.com/_next/image?url=https%3A%2F%2Fcdn.bsky.app%2Fimg%2Favatar%2Fplain%2Fdid%3Aplc%3Aiu4nttjmi4kwd3trqkeq2dku%2Fbafkreidlks5quizuwgy64ksfqlprps7wwb5cqgtjswvufyzyaog3ukx3sy%40jpeg&amp;w=96&amp;q=75\"></div><p>Import your tweets to Bluesky in a few clicks 🦋\n\n👉 https://bluemigrate.com</p></div>","contentLength":80,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43401855"},{"title":"Show HN: I converted my notebook into a searchable database of IT keywords","url":"https://techbook.digital/","date":1742303077,"author":"jurajstefanic","guid":95,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43398968"},{"title":"Show HN: I made a live multiplayer Minesweeper game","url":"https://www.minesweeperpro.com/","date":1742296664,"author":"bluelegacy","guid":94,"unread":true,"content":"<div><div>*Sign in to customize player name and preserve coins balance</div></div>","contentLength":60,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43398081"},{"title":"Show HN: I Built an iOS app to locate stray animals","url":"https://apps.apple.com/us/app/straysync/id6742747753","date":1742249104,"author":"Ic3creaM","guid":93,"unread":true,"content":"<p dir=\"false\" data-test-bidi=\"\">Locate &amp; help stray animals with StraySync! Pin sightings, upload photos, and get real-time alerts—all on an interactive map. Join the community today<p>Lost paws need found hearts. StraySync is your go-to app for locating and tracking stray animals in your area. Whether it’s a curious cat or a wandering dog, you can make a difference—one pin at a time.</p><p>Spot &amp; Pin: See a stray? Snap a photo and drop a pin on the map with its exact location.</p>Share the Story: Upload the stray’s picture to help others recognize it.<p>Find &amp; Help: Tap a pin to see the animal’s photo and get directions to its spot.</p>Built with compassion in mind, StraySync empowers animal lovers to team up and support strays in need. Whether you’re reuniting pets with owners or alerting local rescuers, every pin brings us closer to a world where no stray goes unnoticed.<p>Easy-to-use map to mark and find stray animals</p>Photo uploads for quick identification<p>Directions to guide you to each pinned location</p>Community-driven: help strays, one tap at a time<p>Download StraySync today and start syncing up to save strays in your neighborhood!</p></p>","contentLength":1106,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43393198"},{"title":"Show HN: Learn where countries are on the world map with Spaced Repetition","url":"https://map.koljapluemer.com/","date":1742247337,"author":"blackbrokkoli","guid":92,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43392951"},{"title":"Show HN: We made a photo search engine for homes for sale","url":"https://news.ycombinator.com/item?id=43392875","date":1742246737,"author":"travisleestreet","guid":91,"unread":true,"content":"We're a small team of 3 engineers, and wanted to make a better way to look for for properties online. Traditional portals (esp. outside of US) are just a bit rubbish for doing anything other than basic searching.<p>- Created a crawler that reads through estate agents websites to find homes for sale</p><p>- Parses that through a series of LLMs and other models to understand each home in depth (e.g. floor type, location, total sqft)</p><p>- Parses every photo through an embeddings vector space so that people can search for whatever they want.</p><p>Currently only for home sales (not rentals), and only in the UK.</p>","contentLength":593,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43392875"},{"title":"Show HN: OpenTimes – Free travel times between U.S. Census geographies","url":"https://opentimes.org/","date":1742244052,"author":"dfsnow","guid":90,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43392521"},{"title":"Show HN: Localscope–Limit scope of Python functions for reproducible execution","url":"https://localscope.readthedocs.io/en/latest/","date":1742232794,"author":"tillahoffmann","guid":89,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43390823"},{"title":"Show HN: A bi-directional, persisted KV store that is faster than Redis","url":"https://hpkv.io/","date":1742214916,"author":"mehrant","guid":88,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43387834"},{"title":"Show HN: EnkiTask: Lightweight Project Management for Freelancers","url":"https://enkitask.com/","date":1742205742,"author":"booper","guid":87,"unread":true,"content":"<p> Agile-inspired project coordination meets unlimited collaboration. Our platform brings Scrum methodology to life, empowering teams of any size to work efficiently and communicate freely. No user limits mean you can involve everyone without breaking the bank. </p><p> Flexible, budget-friendly task management reimagined. We've ditched subscriptions in favor of a pay-for-task model. Purchase task packages that fit your workflow, and only spend when you're actively using the system. It's project management that adapts to your needs and your budget. </p><ul role=\"list\"></ul><p> Our system equips you with essential project management features to streamline your workflow. At its core, you'll find versatile boards including Backlog and Sprint views, allowing you to organize and prioritize tasks effectively. Track project progress with ease, set and monitor goals, and gain clear insights into your team's performance. </p><h2> Need more features? Add-ons are here to help! </h2><p> Boost your project management capabilities with our extensive range of add-ons. While our core system provides essential functionality, we understand that different projects may require specialized tools. That's where our add-on store comes in. </p><p> Browse through a diverse selection of powerful extensions designed to enhance your workflow. Whatever your project needs, you'll find add-ons to suit your unique requirements. Simply visit the add-on store, choose the tools that align with your goals, and seamlessly integrate them into your account. </p><a href=\"https://enkitask.com/features\">Learn More </a>","contentLength":1494,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43386745"},{"title":"Show HN: 10 teams are racing to build a pivotal tracker replacement","url":"https://bye-tracker.net/","date":1742131836,"author":"jFriedensreich","guid":86,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43378925"},{"title":"Show HN: Cascii – A portable ASCII diagram builder written in vanilla JavaScript","url":"https://github.com/casparwylie/cascii-core","date":1742119341,"author":"ftr1200","guid":85,"unread":true,"content":"<p>3 months ago I wanted to draw an ASCII diagram to include in some documentation at work. I found the few tools online to be insufficient, and was suprised there wasn't a more complete tool to get the job done.</p><p>Since, I've built Cascii from scratch in vanilla Javascript (I'm not an FE dev, it might be obvious...).</p><p>I hope it works alright. Please check out the live version at <a href=\"https://cascii.app\" rel=\"nofollow\">https://cascii.app</a>, report problems, make diagrams to improve your code's documentation. Hope you enjoy using it.</p>","contentLength":488,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43377897"}],"tags":["dev"]}