{"id":"CQdwDV8xyajeX5DKoSYfBQhN4kkXBaTmXPYgJyANUWHyjCo5BpHUjy5gJhgngST","title":"Slashdot: Linux","displayTitle":"Dev - Slashdot - Linux","url":"http://rss.slashdot.org/Slashdot/slashdotLinux","feedLink":"https://linux.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"items":[{"title":"Will Nvidia Spark a New Generation of Linux PCs?","url":"https://linux.slashdot.org/story/25/01/13/006249/will-nvidia-spark-a-new-generation-of-linux-pcs?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736730420,"author":"EditorDavid","unread":true,"content":"\"I know, I know: 'Year of the Linux desktop ... yadda, yadda',\" writes Steven Vaughan-Nichols, a ZDNet senior contributing editor. \"You've heard it all before. But now there's a Linux-powered PC that many people will want...\" \n\nHe's talking about Nvidia's newly-announced Project Digits, describing it as \"a desktop with AI supercomputer power that runs DGX OS, a customized Ubuntu Linux 22.04 distro.\"\n\nPowered by MediaTek and Nvidia's Grace Blackwell Superchip, Project DIGITS is a $3,000 personal AI that combines Nvidia's Blackwell GPU with a 20-core Grace CPU built on the Arm architecture... At CES, Nvidia CEO Jensen Huang confirmed plans to make this technology available to everyone, not just AI developers. \"We're going to make this a mainstream product,\" Huang said. His statement suggests that Nvidia and MediaTek are positioning themselves to challenge established players &mdash; including Intel and AMD &mdash; in the desktop CPU market. This move to the desktop and perhaps even laptops has been coming for a while. As early as 2023, Nvidia was hinting that a consumer desktop chip would be in its future... [W]hy not use native Linux as the primary operating system on this new chip family? \n\nLinux, after all, already runs on the Grace Blackwell Superchip. Windows doesn't. It's that simple. Nowadays, Linux runs well with Nvidia chips. Recent benchmarks show that open-source Linux graphic drivers work with Nvidia GPUs as well as its proprietary drivers. Even Linus Torvalds thinks Nvidia has gotten its open-source and Linux act together. In August 2023, Torvalds said, \"Nvidia got much more involved in the kernel. Nvidia went from being on my list of companies who are not good to my list of companies who are doing really good work.\" Canonical, Ubuntu Linux's parent company, has long worked closely with Nvidia. Ubuntu already provides Blackwell drivers.\n \nThe article strays into speculation, when it adds \"maybe you wouldn't pay three grand for a Project DIGITS PC. But what about a $1,000 Blackwell PC from Acer, Asus, or Lenovo? All three of these companies are already selling MediaTek-powered Chromebooks....\" \n\n\"The first consumer products featuring this technology are expected to hit the market later this year. I'm looking forward to running Linux on it. Come on in! The operating system's fine.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Will+Nvidia+Spark+a+New+Generation+of+Linux+PCs%3F%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F01%2F13%2F006249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F01%2F13%2F006249%2Fwill-nvidia-spark-a-new-generation-of-linux-pcs%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/25/01/13/006249/will-nvidia-spark-a-new-generation-of-linux-pcs?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Steam On Linux Ends 2024 With Small Marketshare Boost, AMD Linux CPU Use Near 74%","url":"https://linux.slashdot.org/story/25/01/05/0251206/steam-on-linux-ends-2024-with-small-marketshare-boost-amd-linux-cpu-use-near-74?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1736094840,"author":"EditorDavid","unread":true,"content":"Phoronix reports on Valve's \"Steam Survey\" results for December 2024, saying the new numbers \"reflect a nice upward trend for the Linux gaming statistics and a high point in recent times.\"\n\n In November the Steam Survey reflected a 2.03% marketshare for Linux... Roughly inline with what we have been seeing for Linux right at around the 2% threshold. With the just-published December survey numbers, there is a 0.29% increase to 2.29%...! When looking at the Linux numbers, SteamOS Holo accounts for around 36% of all Linux gamers... SteamOS Holo being the operating system of the Steam Deck and beginning to appear on other devices as well... Driven in large part by the Steam Deck relying on a custom AMD SoC/APU and AMD being popular with Linux gamers/enthusiasts for their open-source driver support, AMD CPU use on Linux commands a 73.6% marketshare. \n\n In fact, December \"saw AMD reach another record-high share among participants of Valve's survey,\" according to TechSpot &mdash; \"up 3.02% last month, taking its total to 38.7% as Intel fell slightly to 63.4%...\"\nElsewhere, Windows 11 is now comfortably the most popular OS in the survey. It pulled ahead another 2% to an almost 55% share in December as Windows 10 dropped to 42.3%... However, it's a different story when looking at global users: Windows 10's share has increased two months in a row to 62.7% while Windows 11 has declined to 34.1%.\nRounding up the rest of the survey, 16GB of RAM remains the most popular amount of system RAM but it's lead is declining as second-place 32GB grows; a trend that is mirrored in the VRAM category... \n\nPhoronix adds that the Windows percent \"pulled back by 0.51% to 96.1% while Apple macOS also gained 0.22% going up to a 1.61% marketshare.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Steam+On+Linux+Ends+2024+With+Small+Marketshare+Boost%2C+AMD+Linux+CPU+Use+Near+74%25%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F01%2F05%2F0251206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F01%2F05%2F0251206%2Fsteam-on-linux-ends-2024-with-small-marketshare-boost-amd-linux-cpu-use-near-74%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/25/01/05/0251206/steam-on-linux-ends-2024-with-small-marketshare-boost-amd-linux-cpu-use-near-74?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Is 2025 the Year of the Linux Desktop?","url":"https://linux.slashdot.org/story/24/12/31/205245/is-2025-the-year-of-the-linux-desktop?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1735676400,"author":"msmash","unread":true,"content":"The long-anticipated \"year of the Linux desktop\" could see renewed interest in 2025 as Microsoft's planned end of support for Windows 10 approaches, potentially driving users to explore alternatives. \n\nWith Windows 10 reaching end of support in October 2025, many users will face decisions about upgrading hardware for Windows 11 or considering different operating systems entirely. Linux distributions have evolved to offer increasingly polished desktop experiences, with improving hardware compatibility and familiar user interfaces. \n\n2024 saw Linux adoption grow thanks to the Steam Deck's success, reaching a 4.04% market share in December, up from 3.85% during the same time last year. More Linux laptops, improved gaming compatibility, and growing awareness of its benefits also contributed to its steady rise.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Is+2025+the+Year+of+the+Linux+Desktop%3F%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F31%2F205245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F31%2F205245%2Fis-2025-the-year-of-the-linux-desktop%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/24/12/31/205245/is-2025-the-year-of-the-linux-desktop?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"T2 Linux SDE 24.12 'Sky's the Limit!' Released With 37 ISOs For 25 CPU ISAs","url":"https://linux.slashdot.org/story/24/12/21/2143207/t2-linux-sde-2412-skys-the-limit-released-with-37-isos-for-25-cpu-isas?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1734818520,"author":"EditorDavid","unread":true,"content":"Berlin-based T2 Linux developer Ren&eacute; Rebe is also long-time Slashdot reader ReneR &mdash; and popped by with a special announcement for the holidays:\n\nThe T2 Linux team has unveiled T2 Linux SDE 24.12, codenamed \"Sky's the Limit!\", delivering a massive update for this highly portable source-based Linux distribution... With 3,280 package updates, 206 new features, and the ability to boot on systems with as little as 512MB RAM, this release further strengthens T2 Linux's position as the ultimate tool for developers working across diverse hardware and embedded systems.\n \nSome highlights from Rene's announcement:\n\n \"The release includes 37 pre-compiled ISOs with Glibc, Musl, and uClibc, supporting 25 CPU architectures like ARM(64), RISCV(64), Loongarch64, SPARC(64), and vintage retro computing platforms such as M68k, Alpha, and even initial Nintendo Wii U support added.\"\n\" The Cosmic Desktop, a modern Rust-based environment, debuts alongside expanded application support for non-mainstream RISC architectures, now featuring LibreOffice, OpenJDK, and QEMU.\"\n\nAnd T2sde.org gives this glimpse of the future: \n\n\"While initially created for the Linux kernel, T2 already has proof-of-concept support for building 'home-brew' pkg for Other OS, including: BSDs, macOS and Haiku. Work on alternative micro kernels, such as L4, Fuchsia, RedoxOS or integrating building 'AOSP' Android is being worked on as well.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T2+Linux+SDE+24.12+'Sky's+the+Limit!'+Released+With+37+ISOs+For+25+CPU+ISAs%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F21%2F2143207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F12%2F21%2F2143207%2Ft2-linux-sde-2412-skys-the-limit-released-with-37-isos-for-25-cpu-isas%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.org/story/24/12/21/2143207/t2-linux-sde-2412-skys-the-limit-released-with-37-isos-for-25-cpu-isas?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>","flags":null,"enclosureUrl":"","enclosureMime":""}]}