{"id":"CQdwDV8xyajeX5DKoSYfBQhN4kkXBaTmXPYgJyANUWHyjCo5BpHUjy5gJhgngST","title":"Slashdot: Linux","displayTitle":"Dev - Slashdot - Linux","url":"http://rss.slashdot.org/Slashdot/slashdotLinux","feedLink":"https://linux.slashdot.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"End of Windows 10 Leaves PC Charities With Tough Choice","url":"https://tech.slashdot.org/story/25/03/15/016220/end-of-windows-10-leaves-pc-charities-with-tough-choice?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742004000,"author":"BeauHD","guid":231,"unread":true,"content":"With Microsoft ending free security updates for Windows 10 in October, millions of PCs that don't meet Windows 11's hardware requirements face an uncertain fate... Charities that refurbish and distribute computers to low-income individuals must choose between providing soon-to-be-insecure Windows 10 machines, transitioning to Linux -- despite usability challenges for non-tech-savvy users -- or recycling the hardware, contributing to ewaste. Tom's Hardware reports: So how bad will it really be to run an end-of-lifed Windows 10? Should people worry? [Chester Wisniewski, who serves as Director and Global Field CISO for Sophos, a major security services company] and other experts I talked to are unequivocal. You're at risk. \"To put this in perspective, today [the day we talked] was Patch Tuesday,\" he said. \"There were 57 vulnerabilities, 6 of which have already been abused by criminals before the fixes were available. There were also 57 in February and 159 in January. Windows 10 and Windows 11 largely have a shared codebase, meaning most, if not all, vulnerabilities each month are exploitable on both OSs. These will be actively turned into digital weapons by criminals and nation-states alike and Windows 10 users will be somewhat defenseless against them.\"\n \nSo, in short, even though Windows 10 has been around since 2015, there are still massive security holes being patched. Even within the past few weeks, dozens of vulnerabilities were fixed by Microsoft. So what's a charity to do when these updates are running out and clients will be left vulnerable? \"What we decided to do is one year ahead of the cutoff, we discontinued Windows 10,\" said Casey Sorensen, CEO of PCs for People, one of the U.S.'s largest non-profit computer refurbishers. \"We will distribute Linux laptops that are 6th or 7th gen. If we distribute a Windows laptop, it will be 8th gen or newer.\" Sorensen said that any PC that's fifth gen or older will be sent to an ewaste recycler.\n \n[...] Sorensen, who founded the company in 1998, told us that he's comfortable giving clients computers that run Linux Mint, a free OS that's based on Ubuntu. The latest version of Mint, version 22.1, will be supported until 2029. \"Ten years ago if we distributed Linux, they would be like what is it,\" he said. But today, he notes that many view their computers as windows to the Internet and, for that, a user-friendly version of Linux is acceptable. Further reading: Is 2025 the Year of the Linux Desktop?","contentLength":2485,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Axiom Space and Red Hat Will Bring Edge Computing to the International Space Station","url":"https://linux.slashdot.org/story/25/03/08/205225/axiom-space-and-red-hat-will-bring-edge-computing-to-the-international-space-station?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741473240,"author":"EditorDavid","guid":230,"unread":true,"content":"Axiom Space and Red Hat will collaborate to launch Data Center Unit-1 (AxDCU-1) to the International Space Station this spring. It's a small data processing prototype (powered by lightweight, edge-optimized Red Hat Device Edge) that will demonstrate initial Orbital Data Center (ODC) capabilities. \n\n\"It all sounds rather grand for something that resembles a glorified shoebox,\" reports the Register.\n Axiom Space said: \"The prototype will test applications in cloud computing, artificial intelligence, and machine learning (AI/ML), data fusion and space cybersecurity.\" \n\nSpace is an ideal environment for edge devices. Connectivity to datacenters on Earth is severely constrained, so the more processing that can be done before data is transmitted to a terrestrial receiving station, the better. Tony James, chief architect, Science and Space at Red Hat, said: \"Off-planet data processing is the next frontier, and edge computing is a crucial component. With Red Hat Device Edge and in collaboration with Axiom Space, Earth-based mission partners will have the capabilities necessary to make real-time decisions in space with greater reliability and consistency....\" \n\nThe Red Hat Device Edge software used by Axiom's device combines Red Hat Enterprise Linux, the Red Hat Ansible Platform, and MicroShift, a lightweight Kubernetes container orchestration service derived from Red Hat OpenShift. The plan is for Axiom Space to host hybrid cloud applications and cloud-native workloads on-orbit. Jason Aspiotis, global director of in-space data and security, Axiom Space, told The Register that the hardware itself is a commercial off-the-shelf unit designed for operation in harsh environments... \"AxDCU-1 will have the ability to be controlled and utilized either via ground-to-space or space-to-space communications links. Our current plans are to maintain this device on the ISS. We plan to utilize this asset for at least two years.\" \nThe article notes that HPE has also \"sent up a succession of Spaceborne computers — commercial, off-the-shelf supercomputers — over the years to test storage, recovery, and operational potential on long-duration missions.\" (They apparently use Red Hat Enterprise Linux.) \"At the other end of the scale, the European Space Agency has run Raspberry Pi computers on the ISS for years as part of the AstroPi educational outreach program.\" \n\nAxiom Space says their Orbital Data Center is deigned to \"reduce delays traditionally associated with orbital data processing and analysis.\"\n\nBy utilizing Earth-independent cloud storage and edge processing infrastructure, Axiom Space ODCs will enable data to be processed closer to its source, spacecraft or satellites, bypassing the need for terrestrial-based data centers. This architecture alleviates reliance on costly, slow, intermittent or contested network connections, creating more secure and quicker decision-making in space. \nThe goal is to allow Axiom Space and its partners to have access to real-time processing capabilities, laying the foundation for increased reliability and improved space cybersecurity with extensive applications. Use cases for ODCs include but are not limited to supporting Earth observation satellites with in-space and lower latency data storage and processing, AI/ML training on-orbit, multi-factor authentication and cyber intrusion detection and response, supervised autonomy, in-situ space weather analytics and off-planet backup &amp; disaster recovery for critical infrastructure on Earth.\n","contentLength":3513,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Introduces Debian Linux Terminal App For Android","url":"https://linux.slashdot.org/story/25/03/08/0158226/google-introduces-debian-linux-terminal-app-for-android?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741438800,"author":"BeauHD","guid":229,"unread":true,"content":"Google has introduced a Debian Linux terminal app for Android in its ongoing effort to transform Android into a versatile desktop OS. It's initially available on Pixel devices running Android 15 but will be expanded to \"all sufficiently robust Android phones\" when Android 16 arrives later this year,\" writes ZDNet's Steven Vaughan-Nichols. An anonymous reader shares an excerpt from the report: Today, Linux is only available on the latest Pixel devices running Android 15. When Android 16 arrives later this year, it's expected that all sufficiently robust Android phones will be able to run Linux. Besides a Linux terminal, beta tests have already shown that you should be able to run desktop Linux programs from your phone -- games like Doom, for example. The Linux Terminal runs on top of a Debian Linux virtual machine. This enables you to access a shell interface directly on your Android device. And that just scratches the surface of Google's Linux Terminal. It's actually a do-it-all app that enables you to download, configure, and run Debian. Underneath Terminal runs the Android Virtualization Framework (AVF). These are the APIs that enable Android devices to run other operating systems.\n \nTo try the Linux Terminal app, you must activate Developer Mode by navigating to Settings - About Phone and tapping the build number seven times. I guess Google wants to make sure you want to do this. Once Developer Mode is enabled, the app can be activated via Settings - System - Developer options - Linux development environment. The initial setup may take a while because it needs to download Debian. Typically this is a 500MB download. Once in place, it allows you to adjust disk space allocation, set port controls for network communication, and recover the virtual machine's storage partition. However, it currently lacks support for graphical user interface (GUI) applications. For that, we'll need to wait for Android 16.\n \nAccording to Android specialist Mishaal Rahman, 'Google wants to turn Android into a proper desktop operating system, and in order to do that, it has to make it work better with traditional PC input methods and display options. Therefore, Google is now testing new external display management tools in Android 16 that bring Android closer to other desktop OSes.'","contentLength":2300,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Firefox 136 Released With Vertical Tabs, Official ARM64 Linux Binaries","url":"https://news.slashdot.org/story/25/03/04/2215249/firefox-136-released-with-vertical-tabs-official-arm64-linux-binaries?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741136400,"author":"BeauHD","guid":228,"unread":true,"content":"An anonymous reader quotes a report from 9to5Linux: Mozilla published today the final build of the Firefox 136 open-source web browser for all supported platforms ahead of the March 4th, 2025, official release date, so it's time to take a look at the new features and changes. Highlights of Firefox 136 include official Linux binary packages for the AArch64 (ARM64) architecture, hardware video decoding for AMD GPUs on Linux systems, a new HTTPS-First behavior for upgrading page loads to HTTPS, and Smartblock Embeds for selectively unblocking certain social media embeds blocked in the ETP Strict and Private Browsing modes.\n \nFirefox 136 is available for download for 32-bit, 64-bit, and AArch64 (ARM64) Linux systems right now from Mozilla's FTP server. As mentioned before, Mozilla plans to officially release Firefox 136 tomorrow, March 4th, 2025, when it will roll out as an OTA (Over-the-Air) update to macOS and Windows users. Here's a list of the general features available in this release: \n- Vertical Tabs Layout\n- New Browser Layout Section\n- PNG Copy Support\n- HTTPS-First Behavior\n- Smartblock Embeds\n- Solo AI Link\n- Expanded Data Collection &amp; Use Settings\n- Weather Forecast on New Tab Page\n- Address Autofill Expansion\n \nA full list of changes can be found here.","contentLength":1281,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux's Marketshare Drops in Monthly Steam Survey","url":"https://linux.slashdot.org/story/25/03/03/0158226/linuxs-marketshare-drops-in-monthly-steam-survey?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1740969240,"author":"EditorDavid","guid":227,"unread":true,"content":"\nWhat's Linux's marketshare on Steam? The Steam Survey numbers tell this story: \n\n11/24: 2.03%\n12/24: 2.29%\n01/25: 2.06%\n02:25: 1.45% \n\n\"The February numbers show a staggering 0.61% drop to Linux use...\" reports Phoronix. But they attribute this to an sampling error:\nAccording to the survey, it shows 50% of Steam users using the Simplified Chinese language pack [a 20% increase from the month before]. In prior months where there has been drops to Linux use, it's been correlated to wild swings in the Chinese use on Steam. This looks to be another such month. \nOf the Linux specific data, SteamOS continues to prove most popular for that Valve distribution powering the Steam Deck [at 34.67%, with Arch Linux coming in second at 9.7%]. \nAMD CPUs power around 70% of the Linux gaming systems thanks to the Steam Deck APU and AMD Ryzen being quite popular with Linux enthusiasts.\n","contentLength":881,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fedora Amicably Resolves Legal Threat From OBS Studio Over Downstream Flatpak","url":"https://news.slashdot.org/story/25/02/24/0438216/fedora-amicably-resolves-legal-threat-from-obs-studio-over-downstream-flatpak?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1740375240,"author":"EditorDavid","guid":226,"unread":true,"content":"When it comes to application packaging, earlier this month the site Its FOSS complained that Fedora Flatpaks \"are often unmaintained or broken, leading to a poor experience for users who aren't usually aware they're using them.\" And this apparently created friction with OBS Studio, the free/open-source screencasting and streaming app. \n\n\"We are now considering the Fedora Flatpaks distribution of OBS Studio a hostile fork,\" OBS Studio lead Joel Bethke posted in on GitLab's page for Fedora Flatpaks. They said they were making \"a formal request to remove all of our branding, including but not limited to, our name, our logo, any additional IP belonging to the OBS Project, from your distribution. Failure to comply may result in further legal action taken....\" (Issues with Fedora's packaging led \"to users complaining upstream thinking they are being served the official package...\" Bethke said in his original Issue. \"I would also like some sort of explanation on why someone thought it was a good idea to take a Flatpak that was working perfectly fine, break it, and publish it at a higher priority to our official builds.\") \n\n23 people clicked \"Like\" on the original Issue — but threatening legal action only happened after Bethke felt Fedora was unresponsive, according to It's FOSS:\nIn a comment on a video by Brodi Robertson (check pinned comment), Joel shared that folks from Fedora were not taking this issue seriously, with one of them even resorting to name-calling by labeling the OBS Studio devs as being \"terrible maintainers\". Since then, a major step has been taken by Neal Gompa, a well-known Fedora contributor and member of the Fedora Engineering Steering Committee (FESCo). He has opened a new issue to remove Fedora's OBS Studio flatpak from the registry as soon as possible. \nBut by Tuesday Bethke posted in a new comment on GitLab announcing that \"a very good conversation\" with the Flatpak SIG and Fedora Project Leader seemed to have cleared the tension. \"We discussed the issues, how we got here, and what next steps are... [T]he OBS Project is no longer requesting a removal of IP or rebrand of the OBS Studio application provided by Fedora Flatpaks.\" To the issue of not knowing where to report bugs for the downstream package, \"We had some very good discussion on how this might be accomplished in the medium-long term, but don't consider it a blocker at this point.\" As for other issues with Fedora's Flatpak for OBS Studio, \"The discussion was positive and they are actively working to resolve...\" \n\nAnd similar sentiments were echoed on Fedora's own issue tracker. \"We had a good conversation today, and there is a hopeful path forward that does not require the OBS Project distancing itself from Fedora Flatpaks...\"","contentLength":2754,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Greg Kroah-Hartman Supports Rust in the Kernel","url":"https://linux.slashdot.org/story/25/02/22/0543255/greg-kroah-hartman-supports-rust-in-the-kernel?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1740332040,"author":"EditorDavid","guid":225,"unread":true,"content":"An anonymous Slashdot reader shared this report from Phoronix:\n\nLinux's second-in-command Greg Kroah-Hartman has also been a big proponent of Rust kernel code. He's crafted another Linux kernel mailing list post [Wednesdsay] outlining the benefits of Rust and encouraging new kernel code/drivers to be in Rust rather than C. Greg KH makes the case that the majority of the kernel bugs are due to \"stupid little corner cases in C that are totally gone in Rust.\" \n\n\"As someone who has seen almost EVERY kernel bugfix and security issue for the past 15+ years... and who sees EVERY kernel CVE issued, I think I can speak on this topic,\" Kroah-Hartman began. Here's some excerpts from his remarks. Citing corner cases like overwrites of memory, error path cleanups, use-after-free mistakes and forgetting to check error values, Kroah-Hartman says he's \"all for... making these types of problems impossible to hit.\"\n\nThat's why I'm wanting to see Rust get into the kernel, these types of issues just go away, allowing developers and maintainers more time to focus on the REAL bugs that happen (i.e. logic issues, race conditions, etc.)... [F]or new code / drivers, writing them in Rust where these types of\nbugs just can't happen (or happen much much less) is a win for all of\nus, why wouldn't we do this...? Rust isn't a \"silver bullet\" that will solve all of our problems, but it sure will help in a huge number of places, so for new stuff going forward, why wouldn't we want that...? \n\nYes, mixed language codebases are rough, and hard to maintain, but we are kernel developers dammit, we've been maintaining and strengthening Linux for longer than anyone ever thought was going to be possible. We've turned our development model into a well-oiled engineering marvel creating something that no one else has ever been able to accomplish. Adding another language really shouldn't be a problem, we've handled much worse things in the past and we shouldn't give up now on wanting to ensure that our project succeeds for the next 20+ years. We've got to keep pushing forward when confronted with new good ideas, and embrace the people offering to join us in actually doing the work to help make sure that we all succeed together. \n\nKroah-Hartman emphasized later that \"a huge majority of the stupid things we do in C just don't happen in the same code implemented in Rust (i.e. memory leaks, error path cleanups, return value checking, etc.) \" \n\nThe complete thread contains over 140 messages — including Linus Torvalds' observation that \" #pragma is complete garbage and should never be used.\"","contentLength":2589,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Torvalds: Rust Kernel Code Isn't Forced In Over Maintainers' Objections","url":"https://linux.slashdot.org/story/25/02/22/0524210/torvalds-rust-kernel-code-isnt-forced-in-over-maintainers-objections?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1740239640,"author":"EditorDavid","guid":224,"unread":true,"content":" Linus Torvalds responded Thursday to kernel developer Christoph Hellwig, who had claimed Torvalds merged Rust code into the kernel even over his objections as the original C code's maintainer. Highlights from Torvalds' response:\n\nThe fact is, the pull request you objected to DID NOT TOUCH THE DMA LAYER AT ALL. It was literally just another user of it, in a completely separate subdirectory, that didn't change the code you maintain in _any_ way, shape, or form... Honestly, what you have been doing is basically saying \"as a DMA maintainer I control what the DMA code is used for\". \n\nAnd that is not how *any* of this works. What's next? Saying that particular drivers can't do DMA, because you don't like that device, and as a DMA maintainer you control who can use the DMA code? That's _literally_ exactly what you are trying to do with the Rust code. You are saying that you disagree with Rust — which is fine, nobody has ever required you to write or read Rust code. But then you take that stance to mean that the Rust code cannot even use or interface to code you maintain... \n\nYou don't have to like Rust. You don't have to care about it. That's been made clear pretty much from the very beginning, that nobody is forced to suddenly have to learn a new language, and that people who want to work purely on the C side can very much continue to do so. So to get back to the very core of your statement: \n\n \"The document claims no subsystem is forced to take Rust\" \n\nthat is very much true. You are not forced to take any Rust code, or care about any Rust code in the DMA code. You can ignore it... \n\nYou can't have it both ways. You can't say \"I want to have nothing to do with Rust\", and then in the very next sentence say \"And that means that the Rust code that I will ignore cannot use the C interfaces I maintain\".... So when you change the C interfaces, the Rust people will have to deal with the fallout, and will have to fix the Rust bindings. That's kind of the promise here: there's that \"wall of protection\" around C developers that don't want to deal with Rust issues in the promise that they don't *have* to deal with Rust. \n\nBut that \"wall of protection\" basically goes both ways. If you don't want to deal with the Rust code, you get no *say* on the Rust code. Put another way: the \"nobody is forced to deal with Rust\" does not imply \"everybody is allowed to veto any Rust code\".\n \nTorvalds also made sure to add some kind remarks, including \"I respect you technically, and I like working with you.\"","contentLength":2522,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}