{"id":"F7pXcmPnWkLEHkvQBb3zXkgdiHy14GQcP2RQp","title":"Aphyr: Posts","displayTitle":"Dev - Aphyr","url":"http://aphyr.com/posts.atom","feedLink":"http://aphyr.com/posts.atom","items":[{"title":"Seconds Since the Epoch","url":"https://aphyr.com/posts/378-seconds-since-the-epoch","date":1735152381,"author":"Aphyr","unread":true,"desc":"","content":"<p>This is not at all news, but it comes up often enough that I think there should be a concise explanation of the problem. People, myself included, like to say that POSIX time, also known as Unix time, is the <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date\">number</a> <a href=\"https://www.gnu.org/software/coreutils/manual/html_node/Seconds-since-the-Epoch.html\">of</a> <a href=\"https://man7.org/linux/man-pages/man2/time.2.html\">seconds</a> <a href=\"https://pkg.go.dev/time#Unix\">since</a> <a href=\"https://dev.mysql.com/doc/refman/8.4/en/datetime.html\">the</a> <a href=\"https://ruby-doc.org/core-3.0.0/Time.html\">Unix</a> <a href=\"https://docs.datastax.com/en/cql-oss/3.x/cql/cql_reference/timestamp_type_r.html\">epoch</a>, which was 1970-01-01 at 00:00:00.</p>\n<p>This is not true. Or rather, it isn’t true in the sense most people think. For example, it is presently 2024-12-25 at 18:54:53 UTC. The POSIX time is 1735152686. It has been 1735152715 seconds since the POSIX epoch. The POSIX time number is twenty-nine seconds lower.</p>\n<p>This is because POSIX time is derived <a href=\"https://nvlpubs.nist.gov/nistpubs/Legacy/FIPS/fipspub151-1.pdf\">in IEEE 1003.1</a> from <a href=\"https://en.wikipedia.org/wiki/Coordinated_Universal_Time\">Coordinated Universal Time</a>. The standard assumes that every day is exactly 86,400 seconds long. Specifically:</p>\n<blockquote>\n<p>The <em>time()</em> function returns the value of time in <b>seconds since the Epoch</b>.</p>\n</blockquote>\n<p>Which is defined as:</p>\n<blockquote>\n<p><b>seconds since the Epoch.</b> A value to be interpreted as the number of seconds between a specified time and the Epoch. A Coordinated Universal Time name (specified in terms of seconds (<em>tm_sec</em>), minutes (<em>tm_min</em>), hours (<em>tm_hour</em>), days since January 1 of the year (<em>tm_yday</em>), and calendar year minus 1900\n(<em>tm_year</em>)) is related to a time represented as <em>seconds since the Epoch</em> according to the expression below.</p>\n<p>If year &lt; 1970 or the value is negative, the relationship is undefined. If year ≥ 1970 and the value is non-negative, the value is related to a Coordinated Universal Time name according to the expression:</p>\n<p><em>tm_sec</em> + <em>tm_min</em> * 60 + <em>tm_hour</em> * 3600 + <em>tm_yday</em> * 86400 +\n(<em>tm_year</em>-70) * 31536000 + ((<em>tm_year</em> - 69) / 4) * 86400</p>\n</blockquote>\n<p>The length of the day is not 86,400 seconds, and in fact changes over time. To keep UTC days from drifting too far from solar days, astronomers periodically declare a <a href=\"https://en.wikipedia.org/wiki/Leap_second\">leap second</a> in UTC. Consequently, every few years POSIX time jumps backwards, <a href=\"https://marc.info/?l=linux-kernel&amp;m=134113577921904\">wreaking</a> <a href=\"https://www.zdnet.com/article/qantas-suffers-delays-due-to-linux-leap-second-bug/\">utter</a> <a href=\"https://blog.cloudflare.com/how-and-why-the-leap-second-affected-cloudflare-dns/\">havoc</a>. Someday it might jump forward.</p>\n<h2><a href=\"#archaeology\" id=\"archaeology\">Archaeology</a></h2>\n<p>Appendix B of IEEE 1003 has a fascinating discussion of leap seconds:</p>\n<blockquote>\n<p>The concept of leap seconds is added for precision; at the time this standard was published, 14 leap seconds had been added since January 1, 1970. These 14 seconds are ignored to provide an easy and compatible method of computing time differences.</p>\n</blockquote>\n<p>I, too, love to ignore things to make my life easy. The standard authors knew “seconds since the epoch” were not, in fact, seconds since the epoch. And they admit as much:</p>\n<blockquote>\n<p>Most systems’ notion of “time” is that of a continuously-increasing value, so this value should increase even during leap seconds. However, not only do most systems not keep track of leap seconds, but most systems are probably not synchronized to any standard time reference. Therefore, it is inappropriate to require that a time represented as seconds since the Epoch precisely represent the number of seconds between the referenced time and the Epoch.</p>\n<p>It is sufficient to require that applications be allowed to treat this time as if it represented the number of seconds between the referenced time and the Epoch. It is the responsibility of the vendor of the system, and the administrator of the system, to ensure that this value represents the number of seconds between the referenced time and the Epoch as closely as necessary for the application being run on that system….</p>\n</blockquote>\n<p>I imagine there was some debate over this point. The appendix punts, saying that vendors and administrators must make time align “as closely as necessary”, and that “this value should increase even during leap seconds”. The latter is achievable, but the former is arguably impossible: the standard requires POSIX clocks be twenty-nine seconds off.</p>\n<blockquote>\n<p>Consistent interpretation of seconds since the Epoch can be critical to certain types of distributed applications that rely on such timestamps to synchronize events. The accrual of leap seconds in a time standard is not predictable. The number of leap seconds since the Epoch will likely increase. The standard is\nmore concerned about the synchronization of time between applications of astronomically short duration and the Working Group expects these concerns to become more critical in the future.</p>\n</blockquote>\n<p>In a sense, the opposite happened. Time synchronization is <em>always</em> off, so systems generally function (however incorrectly) when times drift a bit. But leap seconds are rare, and the linearity evoked by the phrase “seconds since the epoch” is so deeply baked in to our intuition, that software can accrue serious, unnoticed bugs. Until a few years later, one of those tiny little leap seconds takes down a big chunk of the internet.</p>\n<h2><a href=\"#what-to-do-instead\" id=\"what-to-do-instead\">What To Do Instead</a></h2>\n<p>If you just need to compute the duration between two events on one computer, use <a href=\"https://docs.redhat.com/en/documentation/red_hat_enterprise_linux_for_real_time/7/html/reference_guide/sect-posix_clocks#sect-POSIX_clocks\">CLOCK_MONOTONIC</a>. If you don’t need to exchange timestamps with other systems that assume POSIX time, use <a href=\"https://www.ipses.com/eng/in-depth-analysis/standard-of-time-definition/\">TAI, GPS, or maybe LORAN</a>. If you do need rough alignment with other POSIX-timestamp systems, <a href=\"https://developers.google.com/time/smear\">smear leap seconds</a> over a longer window of time. Libraries like <a href=\"https://github.com/qntm/t-a-i\">qntm’s t-a-i</a> can convert back and forth between POSIX and TAI.</p>\n<p>There’s an ongoing effort to <a href=\"https://www.timeanddate.com/news/astronomy/end-of-leap-seconds-2022\">end leap seconds</a>, hopefully <a href=\"https://www.bipm.org/documents/20126/64811223/Resolutions-2022.pdf/281f3160-fc56-3e63-dbf7-77b76500990f\">by 2035</a>. It’ll require additional work to build conversion tables into everything that relies on the “86,400 seconds per day” assumption, but it should also make it much simpler to ask questions like “how many seconds between these two times”. At least for times after 2035!</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""},{"title":"Threads Won't Take You South of Market","url":"https://aphyr.com/posts/371-threads-wont-take-you-south-of-market","date":1733065296,"author":"Aphyr","unread":true,"desc":"","content":"<p>In June 2023, when <a href=\"https://threads.net\">Threads</a> announced their <a href=\"https://techcrunch.com/2023/07/05/adam-mosseri-says-metas-threads-app-wont-have-activitypub-support-at-launch/\">plans to federate</a> with other <a href=\"https://en.wikipedia.org/wiki/Fediverse\">Fediverse instances</a>, there was a good deal of <a href=\"https://fedipact.online/\">debate</a> around whether smaller instances should allow federation or block it pre-emptively. As one of the admins of <a href=\"https://woof.group\">woof.group</a>, I wrote about some of the <a href=\"https://blog.woof.group/announcements/considering-large-instance-federation\">potential risks and rewards</a> of federating with Threads. We decided to <a href=\"https://blog.woof.group/announcements/deferring-threads-federation\">wait and see</a>.</p>\n<p>In my queer and leather circles, Facebook and Instagram have been generally understood as hostile environments for over a decade. In 2014, their <a href=\"https://www.eff.org/deeplinks/2014/09/facebooks-real-name-policy-can-cause-real-world-harm-lgbtq-community\">“Real Name” policy</a> made life particularly difficult for trans people, drag queens, sex workers, and people who, for various reasons, needed to keep their real name disconnected from their queer life. My friends have been repeatedly suspended from both platforms for showing too much skin, or using the peach emoji. Meta’s moderation has been aggressive, opaque, and wildly inconsistent: sometimes full nudity is fine; other times a kiss or swimsuit is beyond the line. In some circles, maintaining a series of backup accounts in advance of one’s ban became de rigueur.</p>\n<p>I’d hoped that federation between Threads and the broader Fediverse might allow a <a href=\"https://blog.woof.group/mods/the-shape-of-social-space\">more nuanced spectrum</a> of moderation norms. Threads might opt for a more conservative environment locally, but through federation, allow their users to interact with friends on instances with more liberal norms. Conversely, most of my real-life friends are still on Meta services—I’d love to see their posts and chat with them again. Threads could communicate with Gay Fedi (using the term in the broadest sense), and de-rank or hide content they don’t like on a per-post or per-account basis.</p>\n<p>This world seems technically feasible. Meta reports <a href=\"https://techcrunch.com/2024/11/03/threads-now-has-275m-monthly-active-users/\">275 million Monthly Active Users (MAUs)</a>, and over <a href=\"https://www.statista.com/statistics/1092227/facebook-product-dau/\">three billion</a> accross other Meta services. Fediverse has something like <a href=\"https://fedidb.org/\">one million MAUs across various instances</a>. This is not a large jump in processing or storage; nor would it seem to require a large increase in moderation staff. Threads has already committed to doing the requisite engineering, user experience, and legal work to allow federation across a broad range of instances. Meta is swimming in cash.</p>\n<p>All this seems a moot point. A year and a half later, Threads <a href=\"https://www.theverge.com/24107998/threads-fediverse-mastodon-how-to\">is barely half federated</a>. It publishes Threads posts to the world, but only if you dig in to the settings and check the “Fediverse Sharing” box. Threads users can see replies to their posts, but can’t talk back. Threads users can’t mention others, see mentions from other people, or follow anyone outside Threads. This may work for syndication, but is essentially unusable for conversation.</p>\n<p>Despite the fact that Threads users can’t follow or see mentions from people on other instances, Threads has already <a href=\"https://www.threads.net/moderated_servers\">opted to block</a> a slew of instances where gay &amp; leather people congregate. Threads blocks <a href=\"https://hypno.social\">hypno.social</a>, <a href=\"rubber.social\">rubber.social</a>, <a href=\"https://4bear.com\">4bear.com</a>, <a href=\"https://nsfw.lgbt\">nsfw.lgbt</a>, <a href=\"https://kinkyelephant.com\">kinkyelephant.com</a>, <a href=\"https://kinktroet.social\">kinktroet.social</a>, <a href=\"https://barkclub.xyz\">barkclub.xyz</a>, <a href=\"https://mastobate.social\">mastobate.social</a>, and <a href=\"https://kinky.business\">kinky.business</a>. They also block the (now-defunct) instances <a href=\"https://bear.community\">bear.community</a>, <a href=\"https://gaybdsm.group\">gaybdsm.group</a>, and <a href=\"https://gearheads.social\">gearheads.social</a>. They block more general queer-friendly instances like <a href=\"https://bark.lgbt\">bark.lgbt</a>, <a href=\"https://super-gay.co\">super-gay.co</a>, <a href=\"https://gay.camera\">gay.camera</a>, and <a href=\"https://gaygeek.social\">gaygeek.social</a>. They block sex-positive instances like <a href=\"https://nsfwphotography.social\">nsfwphotography.social</a>, <a href=\"https://nsfw.social\">nsfw.social</a>, and <a href=\"https://net4sw.com\">net4sw.com</a>. All these instances are blocked for having “violated our Community Standards or Terms of Use”. Others like <a href=\"https://fisting.social\">fisting.social</a>, <a href=\"https://mastodon.hypnoguys.com\">mastodon.hypnoguys.com</a>, <a href=\"https://abdl.link\">abdl.link</a>, <a href=\"https://qaf.men\">qaf.men</a>, and <a href=\"https://social.rubber.family\">social.rubber.family</a>, are blocked for having “no publicly accessible feed”. I don’t know what this means: hypnoguys.social, for instance, has the usual Mastodon <a href=\"https://mastodon.hypnoguys.com/public/local\">publically accessible local feed</a>.</p>\n<p>It’s not like these instances are hotbeds of spam, hate speech, or harassment: woof.group federates heavily with most of the servers I mentioned above, and we rarely have problems with their moderation. Most have reasonable and enforced media policies requiring sensitive-media flags for genitals, heavy play, and so on. Those policies are generally speaking looser than Threads (woof.group, for instance, allows butts!) but there are plenty of accounts and posts on these instances which would be anodyne under Threads’ rules.</p>\n<p>I am shocked that woof.group is <em>not</em> on Threads’ blocklist yet. We have similar users who post similar things. Our content policies are broadly similar—several of the instances Threads blocks actually adopted woof.group’s specific policy language. I doubt it’s our size: Threads blocks several instances with less than ten MAUs, and woof.group has over seven hundred.</p>\n<p>I’ve been out of the valley for nearly a decade, and I don’t have insight into Meta’s policies or decision-making. I’m sure Threads has their reasons. Whatever they are, Threads, like all of Meta’s services, feels distinctly uncomfortable with sex, and sexual expression is a vibrant aspect of gay culture.</p>\n<p>This is part of why I started woof.group: we deserve spaces moderated with our subculture in mind. But I also hoped that by designing a moderation policy which compromised with normative sensibilities, we might retain connections to a broader set of publics. This particular leather bar need not be an invite-only clubhouse; it can be a part of a walkable neighborhood. For nearly five years we’ve kept that balance, retaining open federation with most all the Fediverse. I get the sense that Threads intends to wall its users off from our world altogether—to make “bad gays” invisible. If Threads were a taxi service, it wouldn’t take you <a href=\"https://sfleatherdistrict.org/wp-content/uploads/2021/04/Rubin-Valley-of-Kings.pdf\">South of Market</a>.</p>\n","flags":null,"enclosureUrl":"","enclosureMime":""}]}