{"id":"KZgg6v3y1EHngSu15w9ddbD2SchD7Q","title":"Dev News - Last 2 days","displayTitle":"Dev News - Last 2 days","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":60,"items":[{"title":"AdGuard Home randomly stops responding to DNS queries","url":"https://www.reddit.com/r/AdGuardHome/comments/1j74zsv/adguard_home_randomly_stops_responding_to_dns/","date":1741516679,"author":"/u/PaddyPewpew","guid":713,"unread":true,"content":"<p>I've got a strange problem: Since I am using AdGuard Home, it stops responding randomly to DNS queries.</p><p>Sometimes it is working fine for weeks and then suddenly this problem occurs every few days up to daily... The only thing that helps is then restarting the process or the server. I am using a proxmox VM with Debian 12, installed AdGuard Home via the automated install (<a href=\"https://github.com/AdguardTeam/AdGuardHome#getting-started\">GitHub - AdguardTeam/AdGuardHome: Network-wide ads &amp; trackers blocking DNS server</a>), the VM was reinstalled clean twice but the problem persists. It is a naked Debian 12 without any other software installed. The vm has 4 vCPUs assigned and 4 GiB of RAM, qemu-guest-agent is installed properly. </p><p>In the journalctl log, there is nothing to see at the time, AdGuard Home stops responding, the only thing thats remarkable is, that stopping the process fails with timeout:</p><p><code>Mar 09 00:15:00 adguard AdGuardHome[761]: 2025/03/09 00:15:00.564208 [info] Received signal \"terminated\"</code><code>Mar 09 00:15:00 adguard AdGuardHome[761]: 2025/03/09 00:15:00.564254 [info] stopping AdGuard Home</code><code>Mar 09 00:15:00 adguard AdGuardHome[761]: 2025/03/09 00:15:00.564322 [info] webapi: stopping http server</code><code>Mar 09 00:15:00 adguard AdGuardHome[761]: 2025/03/09 00:15:00.564422 [info] webapi: stopped http server</code><code>Mar 09 00:15:00 adguard AdGuardHome[761]: 2025/03/09 00:15:00.564427 [info] service: stopping: waiting for cleanup</code><code>Mar 09 00:15:00 adguard systemd[1]: Stopping AdGuardHome.service - AdGuard Home: Network-level blocker...</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: State 'stop-sigterm' timed out. Killing.</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Killing process 761 (AdGuardHome) with signal SIGKILL.</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Killing process 763 (AdGuardHome) with signal SIGKILL.</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Killing process 764 (AdGuardHome) with signal SIGKILL.</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Killing process 768 (n/a) with signal SIGKILL.</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Main process exited, code=killed, status=9/KILL</code><code>Mar 09 00:16:30 adguard systemd[1]: AdGuardHome.service: Failed with result 'timeout'.</code></p><p>Previous to AdGuard Home I was using PiHole which never had such problems. But because of my kids I like to stay at AdGuard Home because of the adult filtering system.</p><p>All other VMs on my Proxmox are running fine (checkmk, kubernetes, monocle gateway, ...).</p>","contentLength":2443,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Best CPU currently?","url":"https://www.reddit.com/r/unRAID/comments/1j72xsk/best_cpu_currently/","date":1741507467,"author":"/u/Z3dan","guid":671,"unread":true,"content":"<p>I have an unraid server that is Primarily for Plex and associated dockers, I also run game servers off it for mates and other small miscellaneous things... </p><p>I hear for Plex Intel is a must? Are the new core ultra 7s any good compared to 14th gen? What are people's thoughts </p>","contentLength":273,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FS][US-NJ] ASUS KRPA-U16 + EPYC 7D12 Combos","url":"https://www.reddit.com/r/homelabsales/comments/1j71mjy/fsusnj_asus_krpau16_epyc_7d12_combos/","date":1741501973,"author":"/u/_studebaker_","guid":695,"unread":true,"content":"<p>Thinking about letting go of an EPYC Compute Cluster. Board and Chip's were purchased as combos from tugm on eBay November 2023. Memory, heatsinks and NVME bought new. </p><p>(Bios &amp; BMC Updated / Tested / Clean)</p><p>(1100mhz base clock, 3000mhz boost clock @ 200w)</p><ul><li>Coolserver SP3 2U-P22 Heatsink (475g w/ full copper plate)</li><li>4 Channel x 8GB Samsung 2Rx8 M393A1G43DB1-CRC 2400T RDIMMs (32GB)</li><li>128GB Samsung PM961 Gen3.0 NVME</li></ul><p>I have 150w Pico PSU's for the 24-Pin w/ custom EPS cable + Custom 10 layer Breakout Boards w/ 1500w Platinum HP Server PSU's if that's something anyone desires.</p><p>105 x Combos available @ $625ea (discount on bulk) 4 x ASUS KRPA-U16 bare boards @ $475ea<p> 3 x ASUS KRPA-U16 bare boards w/ BMC issue @ $250ea</p></p><p>Message me with any questions :)</p>","contentLength":741,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stem cell therapy trial reverses \"irreversible\" damage to cornea","url":"https://newatlas.com/biology/stem-cell-therapy-reverses-irreversible-damage-cornea/","date":1741501382,"author":"01-_-","guid":142,"unread":true,"content":"<p>Eye injuries that damage the cornea are usually irreversible and cause blindness. But a new clinical trial has repaired this damage in patients thanks to a transplant of stem cells from their healthy eyes.</p><p>The cornea is the outer layer of the eye, which focuses light towards the retina. Since it’s on the frontline of potential hazards from the outside world, the cornea features a population of limbal epithelial stem cells, which repair minor damage to keep the surface smooth and functional.</p><p>Unfortunately, injuries like thermal or chemical burns can damage the cornea beyond the capability of these resident stem cells. There’s not much else that can be done – even a <a href=\"https://newatlas.com/human-corneas-3d-printed/54837/\" data-cms-ai=\"0\">cornea transplant</a> won’t take hold if the damage is too severe.</p><p>The new study, conducted by scientists at Massachusetts Eye and Ear, investigated a new treatment called cultivated autologous limbal epithelial cells (CALEC). This involves removing stem cells from a patient’s uninjured eye, growing their population in the lab for a few weeks, then surgically transplanting them into the injured eye.</p><p>The phase 1/2 trial recruited 14 patients to undergo the procedure, and followed them for 18 months afterwards. Success was primarily judged by how effectively the treatment repaired the cornea’s surface, while a secondary test analyzed improvements to visual acuity.</p><p>By the first checkup at three months, the corneas of seven (50%) of the participants had been completely restored. By the 12-month mark, that number had increased to 11 (79%) patients. Two other participants met the definition for partial success, so the team claims an overall success rate of 92% for CALEC.</p><p>It’s worth noting that three participants did require a second transplant of stem cells, with one of them going on to reach the mark of complete success by the end of the study. In tests of visual acuity in the damaged eye, the majority of patients regained some sight, with some advancing from legally blind to low vision.</p><p>No serious adverse effects that were attributed to the procedure were seen in the patients, in either the donor or recipient eyes. The researchers say that this success paves the way for further trials with larger cohorts and longer follow-ups, before CALEC is submitted for FDA approval.</p>","contentLength":2268,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43306734"},{"title":"Posthog/.cursorrules","url":"https://github.com/PostHog/posthog/blob/master/.cursorrules","date":1741491052,"author":"simonpure","guid":141,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43305919"},{"title":"My 16-month theanine self-experiment","url":"https://dynomight.net/theanine/","date":1741489692,"author":"dynm","guid":140,"unread":true,"content":"<p>The internet <a href=\"https://en.wikipedia.org/wiki/Theanine\">theanine</a>. This is an amino acid analog that’s naturally found in tea, but now sold as a nutritional supplement for anxiety or mood or memory.</p><p>Biologically speaking, it’s plausible. Theanine is structurally related to the neurotransmitter <a href=\"https://en.wikipedia.org/wiki/Glutamate_(neurotransmitter)\">glutamate</a> (theanine = C₇H₁₄N₂O₃, glutamate = C₅H₈NO₄-). For some reason, everyone is obsessed with stupid flashy dopamine and serotonin, and no one cares about glutamate. But it’s the most common neurotransmitter and theanine is both metabolized into glutamate and seems to itself have various <a href=\"https://en.wikipedia.org/wiki/Theanine#In_vitro\">complicated</a> effects on glutamate receptors.</p><p>Of course, there are lots of supplements that  act on the brain, but are useless when taken orally. That’s because your brain is isolated from your circulatory system by a <a href=\"https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier\">thin layer of cells</a> that are extremely picky about what they let through. But it appears that theanine <a href=\"https://doi.org/10.1271/bbb.63.615\"></a> get through these cells and into the brain.</p><p>So that sounds good. But do these low-level effects actually lead to changes in mood in real humans? When I looked into the academic research, I was surprised by how weak it was. Personally, on <a href=\"https://dynomight.net/aspartame/#the-european-food-safety-authority-efsa\">these kinds of issues</a>, I find the European Food Safety Authority to be the single most trustworthy scientific body. They did an <a href=\"https://www.efsa.europa.eu/en/efsajournal/pub/2238\">assessment</a> in 2011 and found:</p><table><tbody><tr><td>Improvement of cognitive function</td><td>cause and effect relationship has not been established</td></tr><tr><td>Alleviation of psychological stress</td><td>cause and effect relationship has not been established</td></tr><tr><td>Maintenance of normal sleep</td><td>cause and effect relationship has not been established</td></tr><tr><td>Reduction of menstrual discomfort</td><td>cause and effect relationship has not been established</td></tr></tbody></table><p><a href=\"https://examine.com/supplements/theanine/\">Examine</a> is an independent website that’s respected for summarizing the scientific literature on health and supplements. They looked into if theanine helped with various things, like alertness, anxiety, and attention. In all cases found  for .</p><p>A <a href=\"https://doi.org/10.1007/s11130-019-00771-5\">2020 review</a> of eight randomized double-blind placebo controlled trials found that theanine  help with stress and anxiety. While this review seems generally good, I found it to be insufficiently paranoid. One study they review found that theanine worked better than <a href=\"https://en.wikipedia.org/wiki/Alprazolam\">alprazolam</a> (xanax) for acute anxiety. The correct response would be, “That’s , and the fact that normal scientific practices could lead to such a conclusion casts doubt on everything.” But the review sort of takes it at value and moves on.</p><p>After 2020, the only major trial I could find was <a href=\"https://doi.org/10.1089/jmf.2020.4803\">this 2021 study</a> that took 52 healthy older Japanese people and gave them theanine (or placebo) for 12 weeks. They tested for improvements in a million different measures of cognitive functioning and mostly found nothing.</p><p>I’ve long found that tea makes me much less nervous than coffee, even with equal caffeine. Many people have suggested theanine as the explanation, but I’m skeptical. Most tea only has ~5 mg of theanine per cup, while when people supplement, they take 100-400 mg. Apparently grassy shade-grown Japanese teas are particularly high in theanine. And I  find those teas particularly calming. But they still only manage ~25 mg per cup. (Maybe it’s because tea is better than coffee?)</p><p>Still, I’ve supplemented theanine on and off for more than 10 years, and it seems helpful. So after seeing the weak scientific evidence, I thought: Why not do a self-experiment?</p><p>Theanine seems ideal because it’s a supplement with short term effects. So you can test it against placebo. (Try that with meditation.) And you can build up a large sample using a single human body without waiting weeks for it to build up in the body before each measurement.</p><p>Everyone agrees theanine is <a href=\"https://www.fda.gov/media/182086/download\">safe</a>. It’s biologically plausible. While academic studies haven’t proven a benefit, they haven’t  one either. Given the vast  evidence, I saw a chance to stick it to the stodgy scientific establishment, to show the power of internet people and give the first rigorous evidence that theanine really works. Stockholm, prepare thyself.</p><p>First, I needed placebos. This was super annoying. The obvious way to create them would be to buy some empty capsules and fill some with theanine and others with some inert substance. But that doesn’t sound fun. Isn’t the whole idea of modernity that we’re supposed to replace labor with capital?</p><p>So I went searching for a pair of capsules I could buy off the shelf, subject to the following constraints:</p><ol><li>Capsule A contains 200 mg of theanine.</li><li>Capsule B contains something with minimal acute effects on anxiety, stress, memory, concentration, etc.</li><li>Capsule B contains something I don’t mind putting into my body.</li><li>Both capsules are exactly the same size and weight.</li><li>Both capsules are almost but not  the same color.</li><li>Both capsules are made by some company with a history of making at least a modest effort to sell supplements that contain what they say they contain, and that don’t have terrifying levels of heavy metals.</li></ol><p>After a ludicrous amount of searching, I found that NOW® sells these veggie capsules:</p><p> 200 mg L-Theanine</p><p> 25 mcg (1,000 IU) Vitamin D</p><p>These are exactly the same size, exactly the same weight, exactly the same texture, and  close in color. They’re so close in color that under warm lighting, they’re indistinguishable. But under cold/blue lighting, the vitamin D capsules are  more yellow. Vitamin D might have some effects on mood, but no one seems to claim that they’re , that you’d feel them within an hour.</p><p>For dosing, I decided to take a capsule whenever I was feeling stressed or anxious. Some people worry this invalidates the results. Not so! I’m still choosing randomly, and this better reflects how people use theanine in practice.</p><p>Theanine is often recommended for reducing anxiety from caffeine. While I didn’t explicitly take caffeine as part of this experiment, I had almost always taken some anyway.</p><p>Statistically, it would have been best to randomize so I had a 50% chance of taking theanine and a 50% chance of taking vitamin D. But I decided that would be annoying, since I was taking these capsules when stressed. So I decided to randomize so I got theanine ⅔ of the time and vitamin D ⅓ of the time.</p><p>Randomization was very easy: I took two theanine capsules and one vitamin D capsule and put them into a little cup. I then closed my eyes, shook the cup around a bit and took one. I then covered the cup with a card.</p><p>This picture shows one vitamin D capsule (top) and two theanine capsules.</p><p>For each trial, I recorded my subjective starting stress level on a scale of 1-5, then set an alarm for an hour, which is <a href=\"https://doi.org/10.3945/jn.112.166371\">enough</a> to reach near-peak concentrations in the blood. After the alarm sounded (or occasionally later, if I missed it) I recorded the end time, my end stress level, and my percentage prediction that what I’d taken was actually theanine. Then, and only then, I looked into the cup. If the two remaining pills were different colors, I’d taken theanine. If not, it was vitamin D.</p><p>After ~14 months, I got frustrated by how slowly data was coming in. This was the first time in my life I’ve had  much chill. At that point, I decided to start taking the capsules once or twice a day, even if I wasn’t stressed. I’ll show the transition point in the graphs below.</p><p>Ultimately, I collected 94 data points, which look like this:</p><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>Here are the raw stress levels. Each line line shows one trial, with the start marked with a tiny horizontal bar. Note the clear change when I started dosing daily:</p><p>Alternatively, here’s the  in stress (end - start) as a function of time. If “Δ Stress” is negative, that means stress went down.</p><p>Here are the start and end stress levels for each trial, ignoring time. The dotted line shows equal stress levels, so anything below that line means stress went down:</p><p>Finally, here are the probabilities I gave that each capsule was in fact theanine.</p><p>My stress level  usually go down, at least provided I was stressed at the start. But it went down regardless of if I took theanine or not. And I was  at guessing what I’d taken.</p><p>Why did my stress decrease when I took vitamin D? Maybe it’s the placebo effect. But I suspect it’s mostly reversion to the mean: If you mark down the times in your life when you’re most stressed, on average you’ll be less stressed an hour later. You can see some evidence for this in that stress tended to decrease more when it started at a higher level.</p><p>So, eyeballing the above figures, theanine doesn’t appear to do anything. (We can argue about statistics below.) Why? I think these are the possibilities:</p><ol><li>Theanine works, but I got fake theanine.</li><li>Theanine works, but vitamin D works equally well.</li><li>Theanine works, but I was unlucky.</li><li>Theanine works, but I’m disembodied and unable to report my internal states.</li><li>Theanine works on some people, but not me.</li></ol><p>It’s hard to disprove the idea that theanine works. But I tell you this: I expected it to work. And I  tried. For almost 100 trials over 16 months, I paid attention to what I was feeling and tried to detect  sign that I’d taken theanine, even if it wasn’t a change in stress. I could detect nothing. Even after months of failure, I’d often feel confident that  time I could tell, only to be proven wrong.</p><table><tbody></tbody></table><p>Should I have been surprised by these results? Well, the scientific literature on theanine hasn’t found much of an effect. And the only other  self-experiment on theanine I’ve found is by <a href=\"https://niplav.site/nootropics#LTheanine\">Niplav</a>, who found it did slightly worse than chance and declared it a “hard pass”.</p><p>What about other blinded self-experiments with other substances? They’re surprisingly scarce, but here’s what I could find:</p><p>Stimulants work! But for everything else…</p><p>I particularly encourage you to read the sleep support post. He was confident it worked, he’d recommended it to lots of friends, but it totally failed when put to the test.</p><p>I’ve seen  other self-experiments (including for theanine), but they’re non-blinded and I’d be doing you a disservice if I liked to them. People often mention that  this means the results aren’t scientific, but treat it like a small niggling technicality. It’s not.</p><p>So I propose a new rule: Blind trial or GTFO.</p><p>I know many people reading this probably use and like theanine. Maybe it works for you! But given the weak academic results, and given the fact that I actually did a blinded experiment, I think you now have the burden of proof. Doing this kind of test isn’t hard. If you’re sure theanine (or anything else) works, prove it.</p><h2>Appendix: OK fine let’s argue about statistics</h2><p>Do you demand p-values? Are you outraged I just plotted the data and then started talking about it qualitatively?</p><p>I think faith in statistics follows a U-shaped curve. By default, people don’t trust them. If you learn a  statistics, they seem great. (Particularly if you’re part of a community that’s formed a little cult around one set of statistical practices and convinced each other that they’re more reliable than they are.) But if you learn a  of statistics, then you realize all the assumptions that are needed and all the ways things can go wrong and you become very paranoid.</p><p>If you want p-values, I’ll give you p-values. But first let me point out a problem.</p><p>While I was blinded during each trial, I saw the theanine/D result when I wrote it down. Over time I couldn’t help but notice that my stress dropped even when I took vitamin D, and that I was terrible at predicting what I’d taken. So while this experiment is randomized and blinded, the data isn’t  or . If I did this again, I’d make sure I couldn’t see any outcomes until the end, perhaps by making 100 numbered envelopes, putting three capsules in each, and only looking at what was left at the end.</p><p>But if you want to compute p-values anyway, OK! Here are the basic numbers for the trials when I took theanine:</p><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>Stress went down, p &lt; .0000001. But here are the the numbers for vitamin D:</p><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>Technically, I did find two significant results. But the second row says that end stress was slightly  with theanine than with vitamin D, and the last row says that I gave slightly  probabilities that I’d taken theanine when I’d actually taken vitamin D.</p><p>Of course, I don’t think this means I’ve proven theanine is harmful. I just think this confirms my general paranoia. To a first approximation, if it ain’t visible in the raw data, I ain’t going.</p><p>Speaking of raw data, you can download mine <a href=\"https://dynomight.net/img/theanine/data.csv\">here</a>.</p>","contentLength":12342,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43305803"},{"title":"Is there any way to change the color of code block text?","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6xs3m/is_there_any_way_to_change_the_color_of_code/","date":1741488120,"author":"/u/Melendrow","guid":688,"unread":true,"content":"<p>So I'm using the Obuntu theme (<a href=\"https://github.com/dmytrodubinin/Obuntu-theme-for-Obsidian\">Git hub page</a>) and the theme changes the code block text to make it red, and I'm curious if there's any way I can change it. I really like the theme for the other things it does but really don't like this part.</p>","contentLength":240,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"My first ground up projects! MOSS Modular Smart Planter","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6xcii/my_first_ground_up_projects_moss_modular_smart/","date":1741486715,"author":"/u/UselesTaste","guid":682,"unread":true,"content":"<p>I've always interested in gardening but, since I live in small apartment and work at building growing plants and seeing some green was so hard. Sooo I've started my own project of \"Modular Organic Smart System\" short for  project.</p><p>I wanted design my project with following requirement, out from previous failed attempts at growing plants in my apartment and office. (also heavily inspired by <a href=\"https://vorondesign.com/\">Voron project</a>)<strong>- Either plant or LED should be enough for lighting (also no red and purple led)</strong><strong>- Has to be modular on both electronics and pot units for different plant's requirements</strong><strong>- Parts should be easy to gather</strong><strong>- Ease of printing and assembly</strong></p><p>Designing was not really difficult but making panels and electronics parts fit was very challenging(First fully assembled model has huge gap in panel mount lol). But things went well and I'm in the process of finishing and making BOM for this project and publishing full 3d model.</p><p>Current features are <strong>led brightness control, fan speed control, soil moisture sensor</strong> powered by . After design is finished I'm looking for fork and modding <a href=\"https://www.klipper3d.org/\">klipper</a> or work on <a href=\"https://github.com/theyosh/TerrariumPI\">TerrariumPI</a> project.</p><p>Meanwhile MOSS is finishing, My friend's old commercial smart pot died and I've made \"se\" version of moss and you can download <a href=\"https://www.printables.com/model/1220936-moss-se-2u-a-simple-modular-smart-pot\">MOSS SE</a> now along with step file.</p><p>I'm planning to finish beta version of this project at march. If anyone is interested in this project or have any question and feedback I would love to have conversation!</p>","contentLength":1441,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"More like LabGore","url":"https://www.reddit.com/r/homelab/comments/1j6wxyp/more_like_labgore/","date":1741485407,"author":"/u/braziNoNo","guid":700,"unread":true,"content":"<p>Slowly getting somewhere with my setup, this might be more like LabGore than LabPorn. Something might be old, and some might be really old, but it's mine. Need to cable manage the bottom though🥲 (and make some more colour coded patch cables)</p>","contentLength":244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Raspberry Pi 5 (16GB) – SDRAM Voltage Stuck at 0.6V is this a firmware lock?","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6wknb/raspberry_pi_5_16gb_sdram_voltage_stuck_at_06v_is/","date":1741484193,"author":"/u/JoeSchmoe4umSA","guid":681,"unread":true,"content":"<p>[any advise welcome - any video walk-thrus welcome - everyone else has no issues booting up an SSD on pcie?]</p><p>I'm troubleshooting an issue where my Raspberry Pi 5 (16GB) has a locked SDRAM voltage of 0.6V instead of the expected 1.1V–1.2V. Despite multiple hardware swaps, power supply changes, and software adjustments, the issue persists. Below is a detailed list of the steps taken and the results at each stage.</p><p>Raspberry Pi 5 (8GB) - Initial Unit (Returned)</p><p>Raspberry Pi 5 (16GB) - New Unit</p><p>ABI Power Supply (5V 3.6A) → Underpowered (Warning Message)</p><p>Nintendo Switch Power Supply (5V 1.5A or 15V 2.6A) → Insufficient current at 5V</p><p>100W GaN USB-C Charger → Improved, but SDRAM voltage still at 0.6V</p><p>Official Raspberry Pi 27W USB-C Power Supply → No warning messages, but SDRAM voltage still 0.6V</p><ol><li>Initial Setup – Raspberry Pi 5 (8GB)</li></ol><p>Installed Debian 64-bit Full GUI</p><p>Power supply: ABI Power Supply (5V 3.6A)</p><p>Low power warning (Peripherals not powered)</p><p>Core voltage: 0.720V (Expected: 0.85V–1.0V)</p><p>SDRAM voltage: 0.600V (Expected: 1.1V–1.2V)</p><p>PCIe not detected properly</p><p>Returned unit and replaced with 16GB version</p><ol><li>Second Setup – Raspberry Pi 5 (16GB)</li></ol><p>Installed Debian 64-bit Full GUI (Fresh OS)</p><p>Power supply: Official 27W Raspberry Pi PSU</p><p>No low power warning (Peripherals powered)</p><table><thead><tr></tr></thead><tbody><tr></tr><tr><td align=\"left\">Nintendo Switch PSU (5V 1.5A or 15V 2.6A)</td></tr><tr></tr><tr><td align=\"left\">Core fixed, SDRAM still locked3. Power Supply TestingPower Supply Core Voltage SDRAM Voltage ResultABI Power (5V 3.6A) 0.720V 0.600V Low power warningNintendo Switch PSU (5V 1.5A or 15V 2.6A) 0.750V 0.600V Not enough current at 5V100W GaN Charger 0.919V (then dropped) 0.600V No sustained improvementOfficial Pi 27W PSU 1.0V 0.600V Core fixed, SDRAM still locked</td></tr></tbody></table><p>Added:4. Config.txt - PCIe Adjustments Added: </p><p>dtparam=pciex1_gen=3 dtparam=pciex1_aspm=0</p><p>Result: PCIe lights on Pineboards AI Hat turned on but no impact on SDRAM voltage.</p><p>B) SDRAM Voltage &amp; Frequency Tweaks</p><p>Added:SDRAM Voltage &amp; Frequency Tweaks Added:</p><p>over_voltage=6 over_voltage_sdram=6 sdram_freq=600</p><p>Result: Core voltage stable at 1.0V, but SDRAM remained at 0.6V.</p><p>Checked bootloader version:</p><ol><li>SDRAM Regulator Control Investigation</li></ol><p>Attempted to manually set SDRAM voltage using: sudo bash -c \"echo 1.2 &gt; /sys/class/regulator/regulator.4/microvolts\"</p><p>Current Status &amp; Open Issues</p><p>✅ Core voltage is stable at 1.0V with official power supply. ❌ SDRAM voltage is locked at 0.6V despite all tweaks.<p> ❌ No access to SDRAM voltage via /sys/class/regulator/.</p> ❌ No SDRAM-related logs in dmesg or vcdbg.</p>","contentLength":2476,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Portainer free upgrade to business edition","url":"https://www.reddit.com/r/selfhosted/comments/1j6w9mn/portainer_free_upgrade_to_business_edition/","date":1741483214,"author":"/u/vinesh178","guid":678,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/vinesh178\"> /u/vinesh178 </a>","contentLength":32,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FS][US-TX] AMD EPYC 7003 Processor, AsRock Rack IPMI motherboard, CPU Cooler, 32GB DDR4 RDIMM modules, NVME Drives, 128GB DDR4 3200 Destop memory, Ethernet cards, SATA cards","url":"https://www.reddit.com/r/homelabsales/comments/1j6vznf/fsustx_amd_epyc_7003_processor_asrock_rack_ipmi/","date":1741482329,"author":"/u/rmtronix","guid":694,"unread":true,"content":"<p>I am downsizing and I have the following homelab items for sale. Everything is in working condition. Please see pictures for condition.</p><table><tbody><tr><td align=\"left\">AMD EPYC 7453 28 core Processor</td><td align=\"left\">Bought for $700, used for about an year and I really don't need this much power/cores</td></tr><tr><td align=\"left\">One of the best air coolers for a 4U server</td></tr><tr><td align=\"left\">Hynix 192GB (6X32Gb) 3200 DDR4</td><td align=\"left\">I priced it at $33 each, no stability issues noticed running in the server above for about an year</td></tr><tr><td align=\"left\">Oloy 128GB (4x32GB) DDR4 3200 Desktop Memory</td><td align=\"left\">Barely used, moved to EPYC server</td></tr><tr><td align=\"left\">Western Digital NVME M.2 SN750 1TB - Gen 3, PCIe 3.0</td><td align=\"left\">I have 4 of these. Barely used in the Asus Hyper M.2 card, should have at least 90% life remaining. Will wipe and double check everything before shipping. Would like to sell all 4 of them together, hopefully with one of the Hyper M.2 Bifurcation card in this listing</td></tr><tr><td align=\"left\">Teamgroup MP44L TLC 1TB NVME m.2, PCI3 4.0</td></tr><tr><td align=\"left\">ASUS Hyper M.2 X16 PCIe 3.0 X4 Expansion Card V2 Asus Hyper M.2 X16 PCIE 3.0 card</td></tr><tr><td align=\"left\">ASUS Hyper M.2 X16 PCIe 4.0 X4 Expansion Card Supports 4 NVMe M.2</td><td align=\"left\">Missing one of the M.2 screws and base, one base got detached from the card, see pictures. Does not affect functionality.</td></tr><tr></tr><tr><td align=\"left\">Intel X520-DA2 10G 2 SFP+</td></tr><tr></tr></tbody></table><p>Would be happy to bundle all ethernet cards for $50 if anyone is interested.</p><p>I have another EPYC server that I would like to keep. It has Supermicro  motherboard and has 256GB (8x32GB) of DDR4 3200 Crucial Memory. Let me know if you are interested in this configuration (for an increased cost) instead of what I posted above.</p><p>I will post the same in servethehome forums as well. I sold and bought here a couple of times. I also sold a few items over the years at ebay - see the feedback <a href=\"https://www.ebay.com/fdbk/feedback_profile/rmtronics\">here</a>.</p><p>Please leave a message here and/or PM if you are interested. Shipping will be from US-TX DFW zip code. Prefer local transaction but I can ship if required. Cash for local and paypal for shipped items.</p>","contentLength":1841,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dont laugh or else ill bit your sata cables","url":"https://www.reddit.com/r/homelab/comments/1j6vrde/dont_laugh_or_else_ill_bit_your_sata_cables/","date":1741481633,"author":"/u/sam01236969XD","guid":701,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FS][US-CO] 2x Nvidia H100 NVL (94GB VRAM) + Dell PowerEdge R7625 -","url":"https://www.reddit.com/r/homelabsales/comments/1j6vjrl/fsusco_2x_nvidia_h100_nvl_94gb_vram_dell/","date":1741480999,"author":"/u/iShopStaples","guid":699,"unread":true,"content":"<div><p>Up for sale is a beast of a server. I am happy to sell this as configured, or sell the GPUs and/or server separately. This unit comes with a fully transferrable Dell warranty that cover all the components.</p><p>Ships in original Dell packaging.</p><ul><li><strong>2x Nvidia H100 NVL PCIe (94GB VRAM variant)</strong></li><li>2x AMD EPYC 9454 (96 cores total)</li><li>24x2.5\" HDD configuration</li><li>3Y Dell warranty (this is fully transferrable)</li></ul></div>   submitted by   <a href=\"https://www.reddit.com/user/iShopStaples\"> /u/iShopStaples </a>","contentLength":420,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Building an open-source Wi-Fi Mac layer for the ESP32","url":"https://esp32-open-mac.be/","date":1741480376,"author":"pabs3","guid":139,"unread":true,"content":"<p>The ESP32 is a low-cost microcontroller with Wi-Fi connectivity.\nCurrently, the Wi-Fi MAC layer of the ESP32 is closed-source.\nThis project aims to change that: by reverse engineering the hardware registers and software, we can build a networking stack that is open-source up to the hardware, instead of having to use the proprietary MAC layer.</p><p>This will improve security auditability, open up the possibility for features not supported in the proprietary implementation (for example, standards-compliant mesh networking), improve interoperability and make research into Wi-Fi networks with lots of nodes more affordable.</p><ul><li><a href=\"https://github.com/esp32-open-mac/esp32-open-mac\">esp32-open-mac</a> (we know it's confusing that one reference implementation has the same name as the overarching project, but bear with us)\nThis is a reference implementation that demonstrates how the hardware works, written in C and Rust: the hardware abstraction and initialization is written in C; the MAC stack (parsing packets and deciding which packets to send when) is written in Rust.\nThis relies on two FreeRTOS tasks; one to handle the hardware, one to handle the MAC stack.</li><li><a href=\"https://github.com/esp32-open-mac/FoA\">Ferris-on-Air (FoA)</a>: this is a reference implementation in pure async Rust. It builds on Embassy and the patches in the esp-hal we submitted to add support for the Wi-Fi peripheral.</li></ul><p>If you want to help out with developing or want to contact us, feel free to join <a href=\"https://matrix.to/#/#esp32-open-mac:matrix.org\">the Matrix room</a></p>","contentLength":1378,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43304962"},{"title":"Show HN: I built an app to get daily wisdom from Mr. Worldwide","url":"https://daale.club/","date":1741478687,"author":"garyreckon","guid":110,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43304785"},{"title":"GOD BLESS AMERICA EVERYONE","url":"https://www.reddit.com/r/ChatGPT/comments/1j6umun/god_bless_america_everyone/","date":1741478223,"author":"/u/NirvanaHero404","guid":710,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Journey through Hogwarts But Miniature","url":"https://v.redd.it/oqprru50wjne1","date":1741476609,"author":"/u/Sad-Ambassador-9040","guid":711,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/ChatGPT/comments/1j6u2w5/a_journey_through_hogwarts_but_miniature/"},{"title":"Forced air cooling upgrade for the closet lab","url":"https://www.reddit.com/r/homelab/comments/1j6t43h/forced_air_cooling_upgrade_for_the_closet_lab/","date":1741473873,"author":"/u/CStoEE","guid":703,"unread":true,"content":"<p>I added a jumper duct to my coat closet lab. The temperature in the closet went from 100F to 70F. The duct has a inline fan and the exhaust is in the AC return vent. Both ends of the duct were sealed with air duct sealant. There’s a filter on the intake side so I’m not just blowing unfiltered air into the return.</p>","contentLength":318,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Thought I'd share my S740 hackjob","url":"https://www.reddit.com/r/homelab/comments/1j6t3za/thought_id_share_my_s740_hackjob/","date":1741473863,"author":"/u/R3NE07","guid":704,"unread":true,"content":"<p>It's not alot. But it's mine. - Celeron J4105 4x2.5GHz - 2x NVMEs, 2x SATA SSDs - 16GB DDR4 - Powered by USB-C PD Charger - running Proxmox</p>","contentLength":139,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Axiom Space and Red Hat Will Bring Edge Computing to the International Space Station","url":"https://linux.slashdot.org/story/25/03/08/205225/axiom-space-and-red-hat-will-bring-edge-computing-to-the-international-space-station?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741473240,"author":"EditorDavid","guid":183,"unread":true,"content":"Axiom Space and Red Hat will collaborate to launch Data Center Unit-1 (AxDCU-1) to the International Space Station this spring. It's a small data processing prototype (powered by lightweight, edge-optimized Red Hat Device Edge) that will demonstrate initial Orbital Data Center (ODC) capabilities. \n\n\"It all sounds rather grand for something that resembles a glorified shoebox,\" reports the Register.\n Axiom Space said: \"The prototype will test applications in cloud computing, artificial intelligence, and machine learning (AI/ML), data fusion and space cybersecurity.\" \n\nSpace is an ideal environment for edge devices. Connectivity to datacenters on Earth is severely constrained, so the more processing that can be done before data is transmitted to a terrestrial receiving station, the better. Tony James, chief architect, Science and Space at Red Hat, said: \"Off-planet data processing is the next frontier, and edge computing is a crucial component. With Red Hat Device Edge and in collaboration with Axiom Space, Earth-based mission partners will have the capabilities necessary to make real-time decisions in space with greater reliability and consistency....\" \n\nThe Red Hat Device Edge software used by Axiom's device combines Red Hat Enterprise Linux, the Red Hat Ansible Platform, and MicroShift, a lightweight Kubernetes container orchestration service derived from Red Hat OpenShift. The plan is for Axiom Space to host hybrid cloud applications and cloud-native workloads on-orbit. Jason Aspiotis, global director of in-space data and security, Axiom Space, told The Register that the hardware itself is a commercial off-the-shelf unit designed for operation in harsh environments... \"AxDCU-1 will have the ability to be controlled and utilized either via ground-to-space or space-to-space communications links. Our current plans are to maintain this device on the ISS. We plan to utilize this asset for at least two years.\" \nThe article notes that HPE has also \"sent up a succession of Spaceborne computers — commercial, off-the-shelf supercomputers — over the years to test storage, recovery, and operational potential on long-duration missions.\" (They apparently use Red Hat Enterprise Linux.) \"At the other end of the scale, the European Space Agency has run Raspberry Pi computers on the ISS for years as part of the AstroPi educational outreach program.\" \n\nAxiom Space says their Orbital Data Center is deigned to \"reduce delays traditionally associated with orbital data processing and analysis.\"\n\nBy utilizing Earth-independent cloud storage and edge processing infrastructure, Axiom Space ODCs will enable data to be processed closer to its source, spacecraft or satellites, bypassing the need for terrestrial-based data centers. This architecture alleviates reliance on costly, slow, intermittent or contested network connections, creating more secure and quicker decision-making in space. \nThe goal is to allow Axiom Space and its partners to have access to real-time processing capabilities, laying the foundation for increased reliability and improved space cybersecurity with extensive applications. Use cases for ODCs include but are not limited to supporting Earth observation satellites with in-space and lower latency data storage and processing, AI/ML training on-orbit, multi-factor authentication and cyber intrusion detection and response, supervised autonomy, in-situ space weather analytics and off-planet backup &amp; disaster recovery for critical infrastructure on Earth.\n","contentLength":3513,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reporting undisclosed tracking script in docker image","url":"https://www.reddit.com/r/selfhosted/comments/1j6su1d/reporting_undisclosed_tracking_script_in_docker/","date":1741473086,"author":"/u/DensePineapple","guid":676,"unread":true,"content":"<p>I was testing out a new service I found on github and discovered the image was trying to connect to an external site. Not the usual telemetry suspects but a small bash script collecting somewhat benign system info and posting to a suspicious url not mentioned in the repo at all. I contacted the author who claims its just gathering usage statistics for dev purposes and dismissed the issue saying I can just turn it off. Am I wrong to report the repo / image? Not mentioning it, deliberately misrepresenting the purpose in comments, and making it opt out all point to malicious intent. Also it must be against something like GDPR, right?</p>","contentLength":638,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"“Why do you have a dashboard?”","url":"https://www.reddit.com/r/selfhosted/comments/1j6sqvo/why_do_you_have_a_dashboard/","date":1741472840,"author":"/u/-ManWhat","guid":679,"unread":true,"content":"<p>Posting this because I saw the question asked in this sub a few days ago. In short, Home Assistant makes a fantastic dashboard and with some time, patience, and creativity, the sky is the limit. I’m more than willing to help out with configs and YAML :)</p>","contentLength":255,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Presenterm: Markdown Slideshows in the Terminal","url":"https://github.com/mfontanini/presenterm","date":1741469813,"author":"pea-tear","guid":138,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43303752"},{"title":"Pi 5 Bluetooth Controller Pairing Struggles","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6qxsg/pi_5_bluetooth_controller_pairing_struggles/","date":1741467870,"author":"/u/Anti_virus_boi","guid":683,"unread":true,"content":"<p>I've been experimenting with gaming of all sorts on my Pi 5, and I've gotten everything down so far except for one thing: Bluetooth Controller Pairing. For my example, I'll use my Xbox Core Wireless Controller. The expected behavior that happens on all other computers is as follows:</p><ul><li>Controller is put into pairing mode, LED begins to flash quickly.</li><li>Controller becomes visible to computer, and is listed under devices that can be paired.</li><li>I select the controller to pair it.</li><li>Computer says pairing is successful. LED on controller stops flashing and holds solid.</li><li>Controller functions perfectly.</li></ul><p>For my Pi, however, I get through the first 3, but even though the Pi says that pairing is successful, the controller continues to flash as though it has not been paired. On Batocera, this is particularly egregious because it will fill the screen with connected/disconnected messages, constantly going back and forth. And since the controller hasn't exited pairing mode, it shuts down a short time later.</p><p>I've tried this on both Batocera and Pi OS with the same results. Both images and everything on them are 100% up-to-date. The Pi is getting a full 25W power supply. </p><p>I am aware of the existence of adapter dongles, but I have seen people use bluetooth controllers with a Pi 5 without a dongle, no issues. I have searched around to no avail to find a dongle-less solution that isn't just sudo apt update.</p><p>Any help would be greatly appreciated :)</p>","contentLength":1432,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FS][US-TX][DFW] Unifi switches and access pointsUS-16-XG, US-16-150W, US-24-POE, UAP-AC-Pro, UAP-AC-Lite, UAP-AC-LR, US-48, 10G DAC cables","url":"https://www.reddit.com/r/homelabsales/comments/1j6qsdv/fsustxdfw_unifi_switches_and_access_pointsus16xg/","date":1741467469,"author":"/u/rmtronix","guid":696,"unread":true,"content":"<p>I have the following Ubiquiti gear for sale. Everything is in working condition and most of them come with most accessories and original packaging. Please see pictures for condition.</p><p>Prefer local transaction but I can ship if required. Cash for local and paypal for shipped items.</p><table><tbody><tr></tr><tr><td align=\"left\">Gen 1, replaced power supply with higher quality version, all ports work, 150W, no LED Display</td></tr><tr><td align=\"left\">With LED Display, Near-silent cooling</td></tr><tr><td align=\"left\">Minor scratches on top from rack mounting, see pictures. Has 2x SFP+ and 2x SFP ports</td></tr><tr><td align=\"left\">Very good condition, with POE injector, ceiling mount, hardware, original packaging, see pictures</td></tr><tr><td align=\"left\">Good condition, it's clean but the plastic is a bit sticky for some reason - it's not grease, just softer plastic and a bit sticky for some reason. Comes with unopened POE injector, power cable, original packaging.</td></tr><tr></tr><tr><td align=\"left\">SFP+ cables, various lengths</td></tr></tbody></table><p>I will post the same in servethehome forums as well. I sold and bought here a couple of times. I also sold a few items over the years at ebay - see the feedback <a href=\"https://www.ebay.com/fdbk/feedback_profile/rmtronics\">here</a>. </p><p>Please leave a message here and/or PM if you are interested. Shipping will be from US-TX DFW zip code. </p>","contentLength":1104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reasonable way to make this beginner PLEX build cheaper?","url":"https://www.reddit.com/r/unRAID/comments/1j6qluu/reasonable_way_to_make_this_beginner_plex_build/","date":1741466961,"author":"/u/Ancient-Trouble-775","guid":674,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pi Zero project with display to remotely send my sister updates about her dog that I look after while she's working","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6qh20/pi_zero_project_with_display_to_remotely_send_my/","date":1741466584,"author":"/u/canakles","guid":686,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"RPi5 NAS to Use with Jellyfin","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6q7o8/rpi5_nas_to_use_with_jellyfin/","date":1741465855,"author":"/u/SerDel812","guid":685,"unread":true,"content":"<p>So after a few years of running Jellyfin off my Mac Studio through USB drives. I've decided to build a dedicated NAS for all my video files. I was looking through various YT videos and saw that you can now build a Mini NAS using RPi5 and a Sata Hat. Im fairly new to this Rpi and NAS so this will be my first project. Im mainly looking for suggestions and tips from people who have done it before me. Here are my concerns:</p><ol><li>Will this set up be fast enough to access files within my network? Im talking video files that are anywhere from 500mb to 50g going from the NAS to mostly AppleTV and iPad.</li><li>Are there any better set ups like these Im not aware of? Im looking to do the most with a small budget. I want to keep it under $600 all included (w/ SSDs)</li><li>Are budget SSDs in RAID configuration ok for this? Or too risky of failure?</li><li>Has anyone found a decent small case for this set up? Im trying to get the smallest possible and currently all I see is where people 3D printed cases themselves or the case available is not compatible for this set up.</li><li>Is there anything else Im overlooking?</li></ol>","contentLength":1079,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Omnisearch Feature request","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6pvym/omnisearch_feature_request/","date":1741464957,"author":"/u/SilentCaterpillar240","guid":687,"unread":true,"content":"<p><a href=\"https://github.com/scambier/obsidian-omnisearch\">Omnisearch</a> is nearly perfect but it's missing one key feature from Quick Switcher for me: Recent Files. </p><p>It would be amazing if there was an option to display a list of recently-opened files when Omnisearch is launched (exactly like in Quick Switcher). This added functionality would enable me to ditch quick switcher all together. </p><p>Is it already possible to do this? </p>","contentLength":366,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple Shortcut: Dictate Thoughts Directly to Your Obsidian Vault","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6puxg/apple_shortcut_dictate_thoughts_directly_to_your/","date":1741464881,"author":"/u/redmelon42","guid":691,"unread":true,"content":"<p>I wanted to share a Shortcut I created that’s been great for quickly capturing thoughts in Obsidian. With this Shortcut, I can dictate text at the push of a button, and the content gets saved directly to a static note in my vault called “Voice Memo 🎙️”.</p><p>Here’s how it works: - If I end my dictated thought with the word “hashtag”, it formats that text as a header in the note. - Any other text is simply added as a bullet point.</p><p>This makes it super easy to jot down different ideas throughout the day while keeping things organized. A couple of times a week, I review the note and move the bullet points to their appropriate place in my vault. The “Voice Memo” note just serves as an initial landing zone to get ideas out of my head quickly.</p><p>Would love to hear your thoughts or suggestions for improvement!</p>","contentLength":824,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"WALL OF SHAME - \"Why does this Proxmox node keep hanging on boot?!?\"","url":"https://www.reddit.com/r/selfhosted/comments/1j6pt3x/wall_of_shame_why_does_this_proxmox_node_keep/","date":1741464741,"author":"/u/iansaul","guid":675,"unread":true,"content":"<p>This SilverStone RM43-320-RS sounds like it's trying to take off when all three of the 120MM fans are plugged into the back of the disk controller for power. You'd think there was a mini-tornado in my office, and you can hear it all the way across the house.</p><p>I figured NO PROBLEM, nothing a little lm-sensors and fancontrol can't fix. After running into issues with this particular MOBO, I went in a totally different direction.</p><p>Why not use BIOS fan curves on the MSI MPG Z590 GAMING PLUS, to avoid worrying about any OS or docker based solutions. That appeared to work like a charm... in BIOS... with an HDMI monitor plugged in.</p><p>But on reboot.... system shows hung....</p><p>Must be the lm-sensors.... GRUB e - bypass loading components... no luck. GRUB e - emergency...... finally back in... Ok... well... lucky me I did a ZFS snapshot RIGHT before starting any of these shenanigans. Rollback the snapshot....</p><p>At this point, I'm thinking... \"Ok... this system booted up FINE before... this is either due to BIOS control of the PWM fans.... or this MONITOR is hanging the boot.... which makes ZERO SENSE.\"</p><p>On a whim, I checked if I could SSH... lo and behold:</p><p><code>root@*********'s password:</code></p><p>Blimey. She's not hung at all, never has been. I have the GPU in passthrough so that we can Sunshine to the LR TV.</p><p>I didn't need that hour of my life anyways.</p><p>Hope it brings a chuckle to others, like it did me.</p>","contentLength":1382,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FREE] [USA-TX][DFW] SuperMicro X9SR(X) MB - Xeon E5-2603 1800Mhz - 48G 1066MHz DDR3","url":"https://www.reddit.com/r/homelabsales/comments/1j6p3s0/free_usatxdfw_supermicro_x9srx_mb_xeon_e52603/","date":1741462817,"author":"/u/Ziferius","guid":698,"unread":true,"content":"<p>My brother dropped it off to me several years ago. The system does power on, has dual gig NICs. I live in Arlington, TX in Dallas/Ft.Worth Metroplex. It's housed in a extremely heavy case. 8 bay SuperMicro Case, crapton of fans and I have 4 or 5 drive cages with it. It needs a good home.</p><p>If you are definitely the tinker type, I also have a Pine64 board I backed with Kickstarter and never got around to playing with it. Never will at this point -- I'll throw it in.</p><p><a href=\"https://www.intel.com/content/www/us/en/products/sku/64592/intel-xeon-processor-e52603-10m-cache-1-80-ghz-6-40-gts-intel-qpi/specifications.html\">Xeon E5-2603 v1 1800MHz</a> It's housed in a extremely heavy case. Has a crapton of fans and I have 4 or 5 drive cages with it. It needs a good home.</p><p>Memory Details: DDR3: 1066 MHz: 48GB ECC Total</p><p>4 x 8GB Samsung: M393B1K70CH0-YH9</p><p>4 x 4GB Elpida: EBJ41HE4BAFA-DJ-E</p><p>If you are definitely the tinker type, I also have a Pine64 board I backed with Kickstarter and never got around to playing with it. Never will at this point -- I'll throw it in.</p>","contentLength":901,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"I just made a reverse Turing test game where you're the only human in a chat room filled with different gpt AI characters. Everyone knows there's a human hiding among them - and they're all trying to find and eliminate you. They turned out smarter than I expected. You can try it at turingstwist.com.","url":"https://www.reddit.com/r/ChatGPT/comments/1j6ourt/i_just_made_a_reverse_turing_test_game_where/","date":1741462174,"author":"/u/duststarziggy","guid":707,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Can anyone help figure out why my Unraid server keeps hard crashing every couple of days? - Syslog file.","url":"https://www.reddit.com/r/unRAID/comments/1j6oug6/can_anyone_help_figure_out_why_my_unraid_server/","date":1741462148,"author":"/u/Angry-_-Kid","guid":669,"unread":true,"content":"<p>I made a post a couple days ago asking about why my Unraid server keeps crashing consistently within around 5 days of the last crash.</p><p>I believe I have ruled out memory causing the issue after completing a couple full memtests which reported 0 errors.</p><p>I have since collected a syslog on the advice of some others, and am now pasting it here for someone much more experienced than me to have a look at to see what they think the problem may be!</p><p>My server crashed about half an hour ago. As usual, I couldn't access any WebUI and so I had to hold down the power button on my machine to kill it. Then I took out my flash and copied across the syslog. So the last entry in there should be right around the time it crashed, right?</p><p>If anyone can help break this down and hopefully solve this many-months-long mystery of why my server keeps hard crashing every couple of days, that would be so much appreciated !!</p>","contentLength":901,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"I paid for 60 pciE lanes, so I'm gonna use 60 pciE lanes!","url":"https://www.reddit.com/r/homelab/comments/1j6oryh/i_paid_for_60_pcie_lanes_so_im_gonna_use_60_pcie/","date":1741461965,"author":"/u/prometaSFW","guid":705,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Deploy from local to production (self-hosted)","url":"https://github.com/bypirob/airo","date":1741460057,"author":"bypirob","guid":137,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43302495"},{"title":"Is going dual transcoding GPU a bad idea? iGPU+ARC","url":"https://www.reddit.com/r/unRAID/comments/1j6nqvo/is_going_dual_transcoding_gpu_a_bad_idea_igpuarc/","date":1741459189,"author":"/u/darkandark","guid":672,"unread":true,"content":"<p>After reading some of the discussions here, is having Intel iGPU and a dedicated Intel ARC a bad ideal for transcoding in Plex and other dockers? I heard unraid will sometimes get confused which one to use?</p><p>Been thinking about getting an Intel 12th series and pairing it with an Intel ARC. Machine going to be mainly Plex and transcoding for video files and stuff. Any recommendations?</p>","contentLength":384,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kill your Feeds – Stop letting algorithms dictate what you think","url":"https://usher.dev/posts/2025-03-08-kill-your-feeds/","date":1741457506,"author":"tom_usher","guid":173,"unread":true,"content":"<div data-intro=\"\">\nWe are being boiled like frogs. It happened gradually, one algorithmic tweak at a time. What started as a way to connect with friends has become a system that gives the corporations that run social media control over what we consume and the ability to subtly shape how we think.\n</div><p>We used to control apps like Facebook and Instagram with our own choices. They became daily comforts, making the world seem a little bit smaller and closer by bringing the people that we cared about together in to one place.</p><p>But from the perspective of these companies, that’s a problem. Our personal worlds, our friends, family, and connections, are finite. Once we’ve caught up, we put the app down. That’s bad for business.</p><p>Social media companies need us flicking through their apps as long as they can keep us there. More eyes on ads is more money. So they play the system a bit. You’ve lingered on enough photos of cute puppies, they know what you like.</p><p>Before long those feeds of finite content are replaced by infinite algorithmic content pulled from millions of users trying to optimise their posts to be picked up by the omnipotent algorithms. Algorithms which are completely opaque to us.</p><p>Sci-fi imagines megacorporations controlling our minds with brain implants. Some worry that companies are already listening in. But they don’t have to - they already control our eyes.</p><p>The creators of TikTok, Instagram etc. have gained control over exactly what we see. What we see strongly influences how we think. <a href=\"https://en.m.wikipedia.org/wiki/2021_Facebook_leak\">They know</a> that their feeds make us angry, they know the negative effects on our mental health (particularly that of teens), and they know that they have an influence on our opinion.</p><p>With the power to shape what we see comes the power to shape what we believe. Whether through deliberate manipulation or the slow creep of algorithmic recommendations, engagement is fueled by outrage, and outrage breeds extremism. The result is a feedback loop that isolates users, reinforces beliefs, and deprioritises opposing viewpoints.</p><p>We live in times where being able to form our own opinion is more important than ever. Where knowing how to source and identify truthful information is a critical skill.</p><p>Our reliance on being spoon fed ideas is destroying those abilities, Alec of Technology Connections calls this <a href=\"https://youtu.be/QEJpZjg8GuA\">algorithmic complacency</a>, referencing our increasing inability to look outside our algorithmically created bubble. The social media companies don’t care, the only person who has any interest in fixing this is you.</p><p>It’s time to take back control of how we think. We’ve identified the problem, now it’s time to take action.</p><p>We don’t all have the freedom, interest or willpower to delete social media from our lives entirely. It’s still where our friends are, an occasional distraction from reality and a source of entertainment. You don’t have to become a digital outcast to hold back this influence.</p><ol><li>Go directly to the source - if you like a particular TikTok creator, Facebook page or YouTube channel, skip the feed and go directly to their pages. Consider bookmarking their profiles individually.</li><li>Learn to find information and entertainment without a feed - try to find a creator making videos or writing about a topic of interest without having to stumble across them in a feed.</li><li>Use platforms and platform features that let you control your experience - Instagram’s ‘Following’ feed, YouTube’s Subscriptions page, <a href=\"https://bsky.app\">Bluesky</a>, <a href=\"https://mastodon.social\">Mastodon</a> and <a href=\"https://zapier.com/blog/how-to-use-rss-feeds/\">RSS feeds</a></li><li>Be mindful of engagement traps - recognise how algorithmic feeds are designed to keep you engaged and scrolling. Take a breath and stop the cycle.</li><li>Talk about it - if you’re reading this you a already know this is a problem. Your friends and family may not be aware of how their feeds are manipulating their attention and beliefs. Without intervention, the radicalisation of opinions, and the consequences we’re already seeing, will only escalate.</li></ol><p>The internet should serve you, not the other way around. Take back control. Kill your feeds before they kill your ability to think independently.</p>","contentLength":4057,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43302132"},{"title":"People with powerful or enterprise grade hardware in their home lab, what are you running that consumes so many resources?","url":"https://www.reddit.com/r/homelab/comments/1j6myd7/people_with_powerful_or_enterprise_grade_hardware/","date":1741457113,"author":"/u/LinkDude80","guid":702,"unread":true,"content":"<p>After three years of home lab on a single mini-PC (Proxmox, Plex, ADS-B, Paperless, Home Assistant, etc) I’m just now running into enough resource constraints to deploy a second node. But I see so many people with these huge Xenon powered server racks that I have to ask, what are you doing with that power? AI stuff? Mining? Tons of users? Gaming servers? What am I missing out on by sticking with low power consumer hardware?</p>","contentLength":429,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Can Now Create 3D Meshes from Sketches! What Would You Draw with 'Meshpad'?","url":"https://v.redd.it/bvhtpjqd2ine1","date":1741455587,"author":"/u/nitkjh","guid":708,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/ChatGPT/comments/1j6mdfn/ai_can_now_create_3d_meshes_from_sketches_what/"},{"title":"33k nodes graph Sherlock-like project","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6ly0j/33k_nodes_graph_sherlocklike_project/","date":1741454416,"author":"/u/Mrbedroomgetsdinner","guid":692,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A definitive list of open source","url":"https://www.reddit.com/r/selfhosted/comments/1j6kz8p/a_definitive_list_of_open_source/","date":1741451813,"author":"/u/ConsistentCan4633","guid":680,"unread":true,"content":"<p>Hey everyone! I've been building this list of definitive opensource software and I'm super proud of it so far - it serves as a single centralized location for the best of opensource, a lot of which are self hosted.</p><p>Why I made it: Over the last couple months I've had this sudden obsession with replacing everything proprietary with opensource. After hundreds of hours over months of searching I finally settled on around 80 opensource apps. What I realized though was that almost all the apps I went with were found through Reddit posts, google searches, or just random sources across the web.</p><p>All the GitHub Awesome Lists I went through didn't even include a lot of the \"best\" and most popular OSS projects out there and were instead filled with smaller projects - a lot of which were abandoned. </p><p>I have yet to find any resource that serves as a centralized location for the best of opensource - and that's what this list aims to be. </p>","contentLength":932,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Discovering errors in Donald Knuth's TAOCP","url":"https://glthr.com/discovering-errors-in-donald-knuths-taocp","date":1741451220,"author":"glth","guid":136,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43301342"},{"title":"HELP: Zero 2W Bare Metal Rust","url":"https://www.reddit.com/r/raspberry_pi/comments/1j6kj2f/help_zero_2w_bare_metal_rust/","date":1741450591,"author":"/u/MrBear179","guid":684,"unread":true,"content":"<p>What I have so far is based off this <a href=\"https://harmonicss.co.uk/rust/rust-on-a-raspberry-pi-part-1/\">tutorial</a>. Is 0x8000 the correct kernel boot address? Do I have the correct <a href=\"https://cs140e.sergio.bz/docs/BCM2837-ARM-Peripherals.pdf\">datasheet </a>for the Zero 2W? From what I have <a href=\"https://www.raspberrypi.com/documentation/computers/processors.html#rp3a0\">read</a>, it should be correct but no matter what I do I cannot turn on and off a gpio pin. The pi has a solid green led once plugged in. What am I doing wrong?</p><pre><code>// main.rs #![no_std] #![no_main] use core::ptr::write_volatile; use core::arch::asm; #[no_mangle] #[link_section = \".text._start\"] pub unsafe extern \"C\" fn _start() -&gt; ! { // Turn GPIO 21 into ouput write_volatile(0x3f20_0008 as *mut u32, 1&lt;&lt;3); loop { // Set high write_volatile(0x3f20_001c as *mut u32, 1&lt;&lt;21); for _ in 0..50_000 { asm!(\"nop\") } // Set low write_volatile(0x3f20_0028 as *mut u32, 1&lt;&lt;21); for _ in 0..50_000 { asm!(\"nop\") } } } #[panic_handler] fn panic(_info: &amp;core::panic::PanicInfo) -&gt; ! { loop {} } // linker.ld ENTRY(_start) SECTIONS { . = 0x80000; .text : { KEEP(*(.text._start)) *(.text*) } .rodata : ALIGN(8) { *(.rodata*) } .data : { *(.data*) } .bss (NOLOAD) : ALIGN(16) { __bss_start = .; *(.bss*); . = ALIGN(16); __bss_end_exclusive = .; } .got : { *(.got*) } /DISCARD/ : { *(.comment*) } } # config.toml [build] target = \"aarch64-unknown-none\" rustflags = [ \"-C\", \"target-cpu=cortex-a53\", \"-C\", \"link-arg=./linker.ld\" ] [profile.dev] panic = \"abort\" debug = 0 [profile.release] panic = \"abort\" debug = 0 </code></pre><p>After , I'm using the following command to create the .img in ELF64-littleaarch64 format:</p><p><code>aarch64-linux-gnu-objcopy target/aarch64-unknown-none/debug/rp-zero-project kernel8.img</code></p><p>On the sd card (fat32) I have the kernel image, bootcode.bin, start.elf, fixup.dat, and config.txt from the raspberry pi frimware <a href=\"https://github.com/raspberrypi/firmware/tree/master/boot\">repo</a>.</p><p>In the config, arm_64bit=1 is set.</p><p>Any help is greatly appreciated. </p>","contentLength":1726,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Upgraded my cache, now I have a small issue.","url":"https://www.reddit.com/r/unRAID/comments/1j6jnac/upgraded_my_cache_now_i_have_a_small_issue/","date":1741448107,"author":"/u/ollie_olsson","guid":670,"unread":true,"content":"<p>I upgraded my cache drive, and I followed all the instructions I could find (I looked at 3-4 different ones, to see if there any bonus tips/tricks). There were some hiccups, but I resolved the big ones. </p><p>Now there are som shares that have icons like this. Any way to fix it, or is it nothing to be worried about?</p><p>And also, I can access delugevpn container through my phone, when I'm on my local wifi. But if I'm not, and I wireguard into my server, I can access all of my containers GUI, except for delugevpn. I didn't have the problem before. What could be the problem? </p>","contentLength":569,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Innovation comes from necessity! Automate Liked Songs downloads from Spotify!","url":"https://github.com/riAs-g/Spot-Down","date":1741447691,"author":"/u/SIRAJ_114","guid":677,"unread":true,"content":"<p>Hello everyone, with the increasing monopoly of the Big Tech on our lives and attention I believe it is time to make use of the old ways. I have created a python script to automate song downloads from spotify Liked playlist. It will take some time depending on the number of songs you have in your Liked playlist.</p><p>I was fed up of ads, so I just had to figure something out myself. I am sure all the devs will have no problem running this script and also modifying it to their liking but I have tried my best to write a good Readme for all the common folks. Please make sure to read the entire Readme before running the script.</p><p>Also, if you are going to use this script in any way shape or form, please consier starring it on Github and if you don't have a github account please upvote my comment in the comment section, so that I can get a number on how many people are using it.</p>","contentLength":877,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/selfhosted/comments/1j6ji16/innovation_comes_from_necessity_automate_liked/"},{"title":"Unraid to backup to Google drive.","url":"https://www.reddit.com/r/unRAID/comments/1j6j0if/unraid_to_backup_to_google_drive/","date":1741446259,"author":"/u/WolfBeiderman","guid":673,"unread":true,"content":"<p>I'm trying to backup data on Unraid to google drive since I have 2tb of storage already. I can't find what app to use to backup to it. I tried Cloudberry but can't the app to link to google drive. What app do you use to backup to google drive? If I have to I'll switch to B2 but rather use google drive since I'm already paying for the storage.</p>","contentLength":344,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Uhmm oookay awkward","url":"https://www.reddit.com/r/ChatGPT/comments/1j6hc56/uhmm_oookay_awkward/","date":1741441103,"author":"/u/DannyGekkouga","guid":709,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[FS] [USA-CT] Minisforum MS-01 | CWWK N100 6-Bay NAS motherboard | Zimaboard | QNAP TL=D400S | 8-Bay NAS case","url":"https://www.reddit.com/r/homelabsales/comments/1j6h1b2/fs_usact_minisforum_ms01_cwwk_n100_6bay_nas/","date":1741440117,"author":"/u/flanconleche","guid":697,"unread":true,"content":"<p>Miniusforum MS-01 12600H (CPU repaste with thermal grizzly Aeronaut)</p><p>$360 OBO Barebones (No Ram, No GPU) Shipped within the US</p><p>$620 Fully Loaded (With 32GB Crucial DDR5 RAM and RTX 3050 GPU) Shipped within the US</p><p>################################################</p><p>################################################</p><p>################################################</p><p>Edit: Adding the 8 Bay Nas case</p><p>AUDHEID 8 Bay Nas Case for Sale</p><p>Asking $75 shipped within the US, $150 with 300 Watt flex ATX PSU.</p>","contentLength":482,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Introduces Debian Linux Terminal App For Android","url":"https://linux.slashdot.org/story/25/03/08/0158226/google-introduces-debian-linux-terminal-app-for-android?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1741438800,"author":"BeauHD","guid":175,"unread":true,"content":"Google has introduced a Debian Linux terminal app for Android in its ongoing effort to transform Android into a versatile desktop OS. It's initially available on Pixel devices running Android 15 but will be expanded to \"all sufficiently robust Android phones\" when Android 16 arrives later this year,\" writes ZDNet's Steven Vaughan-Nichols. An anonymous reader shares an excerpt from the report: Today, Linux is only available on the latest Pixel devices running Android 15. When Android 16 arrives later this year, it's expected that all sufficiently robust Android phones will be able to run Linux. Besides a Linux terminal, beta tests have already shown that you should be able to run desktop Linux programs from your phone -- games like Doom, for example. The Linux Terminal runs on top of a Debian Linux virtual machine. This enables you to access a shell interface directly on your Android device. And that just scratches the surface of Google's Linux Terminal. It's actually a do-it-all app that enables you to download, configure, and run Debian. Underneath Terminal runs the Android Virtualization Framework (AVF). These are the APIs that enable Android devices to run other operating systems.\n \nTo try the Linux Terminal app, you must activate Developer Mode by navigating to Settings - About Phone and tapping the build number seven times. I guess Google wants to make sure you want to do this. Once Developer Mode is enabled, the app can be activated via Settings - System - Developer options - Linux development environment. The initial setup may take a while because it needs to download Debian. Typically this is a 500MB download. Once in place, it allows you to adjust disk space allocation, set port controls for network communication, and recover the virtual machine's storage partition. However, it currently lacks support for graphical user interface (GUI) applications. For that, we'll need to wait for Android 16.\n \nAccording to Android specialist Mishaal Rahman, 'Google wants to turn Android into a proper desktop operating system, and in order to do that, it has to make it work better with traditional PC input methods and display options. Therefore, Google is now testing new external display management tools in Android 16 that bring Android closer to other desktop OSes.'","contentLength":2300,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The DOJ still wants Google to sell off Chrome","url":"https://www.wired.com/story/the-doj-still-wants-google-to-divest-chrome/","date":1741438638,"author":"hydrolox","guid":135,"unread":true,"content":"<p>The proposal, filed Friday afternoon, says that Google must “promptly and fully divest Chrome, along with any assets or services necessary to successfully complete the divestiture, to a buyer approved by the Plaintiffs in their sole discretion, subject to terms that the Court and Plaintiffs approve.” It also would require Google to stop paying partners for preferential treatment of its search engine.</p><p>The DOJ also demands that Google provide prior notification of any new joint venture, collaboration, or partnership with any company that competes with Google in search or in search text ads. However, the company no longer has to divest its artificial intelligence investments, which was part of an initial set of recommendations issued by the plaintiffs last November. The company would still be required to give prior notification of future AI investments.</p><p>“Through its sheer size and unrestricted power, Google has robbed consumers and businesses of a fundamental promise owed to the public—their right to choose among competing services,” the DOJ statement accompanying the filing claims. “Google’s illegal conduct has created an economic goliath, one that wreaks havoc over the marketplace to ensure that—no matter what occurs—Google always wins.”</p><p>The DOJ formally brought its case against Google back in 2020, the most significant tech antitrust case since the DOJ’s years-long battle against Microsoft in the 1990s. The lawsuit alleged that Google has used anticompetitive tactics to protect its search dominance and forge contracts that ensure it’s the default search engine on web browsers and smartphones. Because of its hold on search, the lawsuit claimed, Google can adjust the auction system through which it sells ads and increase prices for advertisers, and rake in more revenue from that.</p><p>Google has argued that its overwhelming success in search—it has a nearly 90 percent share in the US market—stems from the company offering the best search technology. It also says consumers are easily able to change their default search engine, and that Google does face competition from Microsoft and others.</p><p>“DOJ’s sweeping proposals continue to go miles beyond the court’s decision, and would harm America’s consumers, economy and national security,” said Google spokesperson Peter Schottenfels in an emailed statement.</p><p>Much of the ruling centered on the contracts Google has with device makers and browser partners, which use Google as their default search technology. According to Mehta’s ruling, around 70 percent of search queries in the US happen through portals in which Google is the default search engine. Google then shares revenues with those partners, paying out billions of dollars to them, which disincentivizes smaller search rivals who can’t compete with those contracts, Mehta said.</p>","contentLength":2847,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43299886"},{"title":"Honest AI","url":"https://www.reddit.com/r/ChatGPT/comments/1j6gj0m/honest_ai/","date":1741438347,"author":"/u/Fabulous_Bluebird931","guid":706,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Discworld Rules","url":"https://contraptions.venkateshrao.com/p/discworld-rules","date":1741438091,"author":"jger15","guid":134,"unread":true,"content":"<p><a href=\"https://protocolized.summerofprotocols.com/p/strange-new-rules\" rel=\"\">Chiang’s Law</a></p><p>This is no way for a high-agency technological species to live, and thankfully it doesn’t have to be.</p><p><a href=\"https://www.full-stop.net/2020/10/21/features/essays/macon-holt/hyperstitional-theory-fiction/\" rel=\"\">hyperstitional theory-fictions</a></p><p>No, you have to tell different sorts of stories altogether.</p><p><em>as an allegory for technology and society, </em></p><p>The rest of humanity, thankfully, has more imaginative and generative models of reality to draw on. </p><p>You just have to learn to look past the wizards, dragons, elves, and such. There is even a “Science of Discworld” meta-series to help with that.</p><p>The irony is not subtle. It’s in-your-face. For instance, the core world-building premise is that of a literal “flat earth” disc-shaped planet, resting on the back of four elephants that stand on the back of a giant turtle swimming through space. But this parody of the cosmologies of antiquity is put through its paces with deadpan faux-scientific earnestness. There’s an entire novel about how there was once a fifth elephant, whose fossilized remains are the basis of the fossil fuel industry of Discworld.</p><p>And it only gets sillier from there.</p><p>I have a rule-of-thumb: The more seriously you take Discworld, the smarter you get about Roundworld.</p><p>The silliness is a feature, not a bug. Our universe is a vast, crazy place, and we haven’t even begun to scratch the surface of the endless weirdness it harbors. As Douglas Adams noted, “If life is going to exist in a Universe of this size, then the one thing it cannot afford to have is a sense of proportion.” </p><p>Discworld is about curing yourself of the allure of a “sense of proportion.” There is no surer of way of becoming detached from reality and addicted to some notion of manufactured normalcy.</p><p>Revealingly, Roundworld isn’t even modeled in the Middle Earth cosmology, except via vaguely racist and lazy allusions (In Middle Earth, I’m presumably one of those turbaned men-from-the-east riding an Oliphaunt and uncritically allied with Sauron). </p><p>If you double down on the LOTR brainrot, and add things like Ayn Rand and Rene Girard to the soup, you get a profoundly stupid vision of the world that it takes real genius to buy into. Which is what, as it happens, a lot of real geniuses (and I don’t mean this snarkily — Peter Thiel is a legit genius who happens to have bought into a really stupid vision of the world) have in fact done as of 2025, as they try to meme a revanchist Great Power world back into existence.</p><p>I’ve thought about this a lot in the last few months, and I’ve concluded the whole program is in fact exactly as stupid as it sounds, and will fail in profoundly stupid ways, doing a lot of irreversible damage (Brexit was a small scale model of what’s in store for us here in the US). </p><p>But to some extent I’ve made my peace with what’s coming, and have no desire to convince you that this is where things are headed. If you’ve bought into that, have fun being miserable in Middle Earth.</p><p>Instead, I want to sketch out for you how you can truly learn to think in pluralist there-are-many-alternatives ways.</p><p>The place to start is with the rules of Discworld.</p><p><a href=\"https://en.wikipedia.org/wiki/Discworld_(world)\" rel=\"\">from Wikipedia</a></p><p><em><strong>People who think they are Special and Chosen are dangerous and bad for the world.</strong></em></p><p><a href=\"https://en.wikipedia.org/wiki/Sourcery\" rel=\"\">Wikipedia entry</a></p><blockquote></blockquote><p><a href=\"https://www.amazon.com/Carrier-Theory-Fiction-Terra-Ignota/dp/1999675991\" rel=\"\">carrier-bag</a></p><p>Discworld is essentially a kind place though, so the antagonists are usually just contained and neutralized, and sometimes even redeemed. They’re not vengefully made an example of by protagonists. That’s a Chosen One move. Discworlders are kinder, even if it costs them. That’s a point we’ll say more about.</p><p>The Rincewind stories are one of four major sequences in the Discworld universe. These are:</p><ul><li><p><a href=\"https://en.wikipedia.org/wiki/Sam_Vimes\" rel=\"\">Sam Vimes</a></p></li><li><p><a href=\"https://en.wikipedia.org/wiki/Death_(Discworld)\" rel=\"\">Death</a></p></li></ul><p>I like this as acerbic commentary on the longevity fetish and Eternalism of the Tech Right. </p><p>I have no issues with individuals simply making an extreme sport of literally trying to live as long as possible. Bryan Johnson is a friend and occasional client of mine, and Vitalik Buterin, whom I have interactions with through my protocols work, is also a longevity maven. At more regular-people level, friends of this newsletter like Sarah Constantin are into longevity. </p><p><em>thar be ossified Asimovian spacer worlds</em></p><p><em>as part of a Chosen One script </em></p><p>I prefer a world run by ordinary mortals who have embraced both their ordinariness and mortality.</p><p>While most core Discworld characters are either mediocre anti-heroes or parodied Chosen One antagonists, there is a big supporting cast of colorful characters who are neither, but not NPCs either. </p><p><em>be at the mercy of the gods </em></p><p>There is also an array of occasional antagonists who periodically show up with grand Thielean “determinate optimism” type plans, convinced they know better than average shmucks, and threatening the freedom of Discworld for its own good. </p><p>These last named are perhaps the closest thing Discworld has to unredeemed and unredeemable villains. </p><p><a href=\"https://discworld.fandom.com/wiki/Elves\" rel=\"\">Discworld wiki</a></p><blockquote><p>[Elves] are not native to the Disc, but come from a \"parasite universe\", sometimes called Fairyland. This pocket dimension can latch onto different universes at certain times… </p><p>…Elves have no proper imagination or real emotions, and therefore such things fascinate them. Because they cannot create they steal musicians and artists. Because they cannot have children (although they are capable of breeding with humans, resulting in offspring with superficially elvish characteristics - skinny, pointy ears, a tendency to giggle and burn easily in the sun - but fundamentally human traits i.e. empathy) they steal children from the Disc to be their toys. Because they cannot feel empathy they enjoy the suffering of others. Even if an elf is, for reasons of its own, trying to be nice, its lack of understanding of humans mean there's always something \"off\" about it.</p><p>Mostly they get away with this, due to the illusion-creating glamour they cast. While elves are, as mentioned above, not musical, elfsong is perceived as beautiful by humans, and is highly hypnotic. Elves are generally seen as innately beautiful and stylish, but this is just another aspect of the glamour. Some of them are only vaguely humanoid.</p></blockquote><p>At one point, the elves migrate to Roundworld and cause havoc there, by killing the narrative vigor of history with their empty and superficial illusions, until Discworlders save the day. I like to pretend this actually happened.</p><p>Everything satirized and parodied in Discworld, all the ironically deployed tropes of fantasy, are accounted for as the workings of narrativium. That means in-world, all the effects of narrativium are made fun of, but not treated as existential threats. Within the meta-story of Discworld, narrativium adds some of the coherence and discipline that the Auditors of Reality yearn for, but not in a deadening, joyless way. Narrativium is life-affirming narrative irony embodied and embraced.</p><p>The essential property of Narrativium is that it ensures that the history of Discworld will unfold in satisfying ways that make it a good story. This property is most on display in the fifth major sequence of novels in the map: the Industrial Revolution sequence, which feature one of the most interesting characters, Moist Von Lipwig, who is Vetinari’s fixer, nudging technological progress along.</p><p>The details of these developments usually feature absurd (and absurdly entertaining) twists on the corresponding Roundworld historical events, while largely staying true to the logic of Roundworld history. For example, film technology on Discworld relies on some faux-science built around small goblins who sit in the cameras painting really fast (magical, but in an inconsequential way).</p><p>And it’s all very satisfying, in ways the corresponding histories on Roundworld are not. The story also feels a lot more forcefully inevitable and necessary, but not in a restrictive or totalizing way. It is intensified rather than revisionist Roundworld history. </p><p>That’s what makes narrativium good to have around.</p><p>This process is one of generative discovery and continuously improvised contingency. The rule that governs this evolutionary process on Discworld, in Pratchett’s own words, is “Our minds make stories, and stories make our minds.”</p><p>This is the Pratchett version of “hyperstitional theory fiction” which applies with much greater force in Discworld, such that far more consequential things can be memed into existence. </p><p>In the most extreme case, as we’ve seen, the gods of Discworld themselves are memed into existence by belief, like over-powered versions of the subjects of Roundworld cults of personality. Roundworld religions, thankfully, don’t have this kind of power to create Roundworld gods of equal substance, since unlike the retiring and lazy Discworld gods, we tend to imagine very interventionist and opinionated gods for ourselves.</p><p><a href=\"https://www.ribbonfarm.com/2019/04/25/worlding-raga-5-world-how/\" rel=\"\">as part of an extended series</a></p><blockquote><p><em>narratives tell archetypes how to evolve, archetypes tell narratives how to curve.</em><a href=\"https://www.ribbonfarm.com/2019/04/25/worlding-raga-5-world-how/#1\" rel=\"\"></a></p></blockquote><p>Roundworld, sadly, does not have more than trace quantities of narrativium, which is why Roundworld histories are often so unsatisfying and so easily fall prey to Discworld elves, or humans possessed by them.</p><p><em>what does Discworld want?</em></p><p>The sentiment behind the aspiration is perhaps a mark of British culture at its best. The high conceit of Discworld is that the infinite game always prevails and cannot truly be derailed by even by the most powerful forces. The mediocre efforts of ordinary characters powered by narrativium is enough to keep the infinite game going.</p><p><em>always try to be nice, but never fail to be kind. </em></p><p>The history of Roundworld in recent centuries has, at least empirically, exhibited such tendencies, but unlike the denizens of Discworld, we cannot trust in that being the intrinsic nature of our world. Certainly those currently in power are trying to prove it isn’t.</p><p><em>greater generativity and complexity and more alternatives.</em></p><p>Or to put it another way, Discworld has an astounding, unbreakable resistance to Chosen Ones at any scale except the scale of the world itself. Discworld is powered by the anthropic principle on steroids. It keeps discovering new ways in which its entire reality is special.</p><p>This is one reason Discworld can afford to be such a kind world. As a world that is intrinsically pre-disposed to reject totalizing narratives and protect multiple possibilities in an ever-expanding garden of forking paths, reality is on the side of pluralism and against totalizing conceits.</p><p>This is why, on Discworld, even the weakest, most mediocre protagonists, when going up against a powerful Chosen One who wants to capture and enslave reality, can afford to be gracious. Even when they are at the lowest, and cowering before a Chosen One who thinks he has won. Because thanks to the narrativium levels in the environment, the protagonists know they will win, and need never despair. </p><p>The Discworld protagonist seems to know that though they must always scramble comically and improvise energetically to save it from the monstrous Chosen One of the Week, the arc of their moral universe bends in their favor. </p><p>Discworld is a world that knows what it wants, and how to get it. With some nudging along by Vetinari, Death, and Time Monks, and a lot of reluctant anti-heroic adventuring by the likes of Rincewind, Vimes, Granny Weatherwax, and Moist von Lipwig. Narrativium helps those who help themselves. </p><p>Unlike Discworld, our own Roundworld has no such specific disposition. The ideas that the arc of moral history on Roundworld bends towards justice, or that “reality” has a well-known liberal bias (a comforting premise of the late-lamented hyperstitional theory fiction of traditional American politics known as “normalcy”) that are popular with us are no more than thin, wishful fictions. Probably planted in our heads by the Discworld elves.</p><p>Roundworld does not want anything in particular, and no future is necessary. As Discworld scientists have discovered on their trips here, life and civilization have evolved and been destroyed multiple times on Roundworld, in a meaningless process of fragile evolution.</p><p>Because kindness is worth it for its own sake, even if Roundworld lacks the narrativium leverage to turn it into a world-protecting force.</p><p>The idea that there are many alternatives is the second most politically loaded one I’ve ever put out, after the idea that with the right technological scaffolding, a proper reckoning with history is in fact possible and desirable, and not necessarily an exercise in bad-faith book-keeping of resentments and grievances. </p><p><a href=\"https://www.youtube.com/watch?v=ow43pFm9GLQ\" rel=\"\">Bloodcoin</a><a href=\"https://www.youtube.com/watch?v=FxBA_9dm6xk\" rel=\"\">Civilizational Hypercomplexity</a></p><p>But at least we’re exploring many alternatives for the moment and not locking into one. And at least the value of real attempts to reckon with history, of the sort I gesture at in the Bloodcoin talk, is becoming crystal clear, given the barrage of wild and transparently motivated confabulations we are now enduring. </p><p><a href=\"https://substack.com/@contraptions/note/c-98520101\" rel=\"\">a note</a></p><blockquote><p>If you want peace, prepare for war. If you want war, prepare for peace.</p><p>If you want the benefits of war without the costs of peace, lie through your teeth about everything</p></blockquote><p>Vetinari, incidentally, did not believe the popular first epigram; he thought the truth was more banal — If you want peace, prepare for peace, if you want war, prepare for war. But I think he would agree with my second thought. Whatever the causal pattern linking war and peace, it is clear that those possessed by elves (or Auditors of Reality) lie through their teeth about everything to justify doing whatever they please, as Chosen Ones.</p><p>Should you live by Discworld rules of kindness and grace, when all that might get you is contempt and destruction? </p><p>Or should you tell yourself stories that make your mind of sterner stuff? </p><p>The Culture is a galactic-scale post-scarcity anarcho-capitalist mongrel utopia under the benevolent protection of superintelligent spaceships. The closest fully realized fictional universe to that meme about fully automated luxury gay space communism.</p><p>The Culture’s AIs and drones have no compunctions about killing and destruction — this is no gentle Three Laws of Robotics Asimovian universe. In fact, the series opens in the aftermath of a bloody war between the Culture and a peer civilization.</p><p>In the Culture, what is a natural property of reality in Discworld is enforced with extreme prejudice and violence. The entirety of the Culture is like an Assassin’s Guild, with the agents and minds of Special Circumstances acting collectively like a much more forceful Vetinari. </p><p>While life inside the Culture is something like a high-abundance version of an Ursula Le Guin style peaceful anarchy, its actions in foreign space resemble those of the CIA and KGB at the height of the Cold War, rolled into one. Fomenting revolutions, deposing leaders, assassinations — the whole shebang.</p><p>Should we play by Discworld Rules or Culture Rules in the coming years? Should we try to become strong before choosing to be kind, or should we choose kindness whether or not we happen to be strong or weak at any given time?</p><p>I don’t know, but I like that I have at least two good alternatives to ponder. That is the power of not being tied to one narrative with no alternatives being admissible. </p><p>I may never end up choosing, but I think either set of rules would be better than LOTR rules.</p>","contentLength":15167,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43299815"},{"title":"Other e-readers besides Kindle","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6g5u6/other_ereaders_besides_kindle/","date":1741437018,"author":"/u/featheryHope","guid":689,"unread":true,"content":"<p>I've been reading mostly on Kindle Android and using the Kindle sync community plugin to pull in notes &amp; highlights. </p><p>Does similar functionality exist with other ebook platforms (Google or Barnes &amp; Noble)? </p><p>If sync is not available then can I export highlights and notes as markdown?</p>","contentLength":281,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sanderson's bracket technique","url":"https://www.reddit.com/r/ObsidianMD/comments/1j6ftcz/sandersons_bracket_technique/","date":1741435700,"author":"/u/whatamanlikethat","guid":690,"unread":true,"content":"<p>Do you know the bracket technique created by the writer Brandon Sanderson? In short terms, every time you create a thing while writing you \"open a bracket\". It could be a place, an item, an historical event. This opened bracket should get eventually a closing one. The place ends being the local of the final battle, the item ends being something that it needed to diffuse the bomb, etc. </p><p>I want to keep track of my brackets. Can you thing of ways to do that? I first thought of using a front matter content. \"Date of creation\" and \"date of conclusion\" but I don't know it's the best way of doing such thing.</p><p>Can you think of alternatives?</p>","contentLength":637,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Volkswagen reintroducing physical controls for vital functions","url":"https://www.autocar.co.uk/car-news/new-cars/volkswagen-reintroducing-physical-controls-vital-functions","date":1741418749,"author":"zfg","guid":133,"unread":true,"content":"<p>All future <a href=\"https://www.autocar.co.uk/car-review/volkswagen\">Volkswagen</a> models will feature physical controls for the most important functions, design chief Andreas Mindt has said.</p><p>The German firm has been criticised over the past few&nbsp;years for moving many of the vital controls in its cars from physical buttons and dials to the infotainment touchscreen. Volkswagen also introduced haptic ‘sliders’ below the touchscreen for the heating and volume&nbsp;and it started using haptic panels instead of buttons for controls mounted on the steering wheel.</p><p>More recently, the firm has reintroduced physical steering wheel buttons and Mindt said it is committed to reintroducing physical buttons, starting with the production version of the <a href=\"https://www.autocar.co.uk/car-news/new-cars/2025-volkswagen-id-2-will-be-even-better-concept\">ID 2all concept</a> that will arrive next year.</p><p>“From the ID 2all onwards, we will have physical buttons for the five most important functions – the volume, the heating on each side of the car, the fans and the hazard light – below the screen,” said Mindt. “They will be in every car that we make from now on. We understood this.</p><p>“We will never, ever make this mistake any more. On the steering wheel, we will have physical buttons. No guessing any more. There's feedback, it's real, and people love this. Honestly, it's a car. It's not a phone: it's a car.”</p><p>Mindt said VW will continue to offer cars with touchscreens, in part due to new legal requirements that, as in the US, will require all cars to feature a reversing camera.&nbsp;</p><p>“There are a lot of functions you have to deliver in certain areas, so the screen will be big and you will find a lot of HMI [human-machine interface] contents in the depths of the system,” he added. “But the five main things will always be on the first physical layer. That’s very important.”</p>","contentLength":1726,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43298271"},{"title":"Show HN: Open-Source DocumentAI with Ollama","url":"https://rlama.dev/","date":1741399933,"author":"Dontizi","guid":109,"unread":true,"content":"<p>Open-source project. All rights reserved.</p>","contentLength":41,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43296918"},{"title":"AI tools are spotting errors in research papers","url":"https://www.nature.com/articles/d41586-025-00648-5","date":1741388098,"author":"kgwgk","guid":132,"unread":true,"content":"<figure><picture><img alt=\"A large stack of papers and folders with coloured tabs.\" loading=\"lazy\" src=\"//media.nature.com/lw767/magazine-assets/d41586-025-00648-5/d41586-025-00648-5_50703894.jpg\"><figcaption></figcaption></picture></figure><p>Late last year, media outlets worldwide warned that black plastic cooking utensils contained worrying levels of cancer-linked flame retardants. The risk was found to be overhyped – a mathematical error in the underlying research suggested a key chemical exceeded the safe limit when in fact it was ten times lower than the limit. Keen-eyed researchers quickly showed that an artificial intelligence (AI) model could have spotted the error in seconds.</p><p>The incident has spurred two projects that use AI to find mistakes in the scientific literature. The Black Spatula Project is an open-source AI tool that has so far analysed around 500 papers for errors. The group, which has around eight active developers and hundreds of volunteer advisers, hasn’t made the errors public yet; instead, it is approaching the affected authors directly, says Joaquin Gulloso, an independent AI researcher based in Cartagena, Colombia, who helps to coordinate the project. “Already, it’s catching many errors,” says Gulloso. “It’s a huge list. It’s just crazy.”</p><p>The other effort is called YesNoError and was inspired by the Black Spatula Project, says founder and AI entrepreneur Matt Schlicht. The initiative, funded by its own dedicated cryptocurrency, has set its sights even higher. “I thought, why don’t we go through, like, all of the papers?” says Schlicht. He says that their AI tool has analysed more than 37,000 papers in two months. Its website flags papers in which it has found flaws – many of which have yet to be verified by a human, although Schlicht says that YesNoError has a plan to eventually do so at scale.</p><p>Both projects want researchers to use their tools before submitting work to a journal, and journals to use them before they publish, the idea being to avoid mistakes, as well as fraud, making their way into the <a href=\"https://www.nature.com/articles/d41586-025-00026-1\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-025-00026-1\" data-track-category=\"body text link\">scientific literature</a>.</p><p>The projects have tentative support from academic sleuths who work in research integrity. But there are also concerns over the potential risks. How well the tools can spot mistakes, and whether their claims have been verified, must be made clear, says Michèle Nuijten, a researcher in metascience at Tilburg University in the Netherlands. “If you start pointing fingers at people and then it turns out that there was no mistake, there might be reputational damage,” she says.</p><p>Others add that although there are risks and the projects need to be cautious about what they claim, the goal is the right one. It is much easier to churn out shoddy papers than it is to retract them, says James Heathers, a forensic metascientist at Linnaeus University in Växjö, Sweden. As a first step, AI could be used to triage papers for further scrutiny, says Heathers, who has acted as a consultant for the Black Spatula Project. “It’s early days, but I’m supportive” of the initiatives, he adds.</p><p>Both the Black Spatula Project and YesNoError use large language models (LLMs) to spot a range of errors in papers, including ones of fact as well as in calculations, methodology and referencing.</p><p>The systems first extract information, including tables and images, from the papers. They then craft a set of complex instructions, known as a prompt, which tells a ‘reasoning’ model — a specialist type of LLM — what it is looking at and what kinds of error to hunt for. The model might analyse a paper multiple times, either scanning for different types of error each time, or to cross-check results. The cost of analysing each paper ranges from 15 cents to a few dollars, depending on the length of the paper and the series of prompts used.</p><p>The rate of false positives, instances when the AI claims an error where there is none, is a major hurdle. Currently, the Black Spatula Project’s system is wrong about an error around 10% of the time, says Gulloso. Each alleged error must be checked with experts in the subject, and finding them is the project’s greatest bottleneck, says Steve Newman, the software engineer and entrepreneur who founded the Black Spatula Project.</p><p>So far, Schlicht’s YesNoError team has quantified the false positives in only around 100 mathematical errors that the AI found in an initial batch of 10,000 papers. Of the 90% of authors who responded to Schlicht, all but one agreed that the error detected was valid, he says. Eventually, YesNoError is planning to work with ResearchHub, a platform which pays PhD scientists in cryptocurrency to carry out peer review. When the AI has checked a paper, YesNoError will trigger a request to verify the results, although this has not yet started.</p>","contentLength":4583,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43295692"},{"title":"Age Verification Laws: A Backdoor to Surveillance","url":"https://www.eff.org/deeplinks/2025/03/first-porn-now-skin-cream-age-verification-bills-are-out-control","date":1741372442,"author":"hn_acker","guid":172,"unread":true,"content":"<h3><b>Age Verification Laws: A Backdoor to Surveillance</b></h3><p><a href=\"https://www.route-fifty.com/digital-government/2025/02/alabama-house-bills-would-limit-social-media-access-minors/403172/?oref=rf-homepage-river\"></a></p><ol><li><a href=\"https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB728\"></a></li><li><a href=\"https://www.nysenate.gov/legislation/bills/2025/A3323\"></a></li><li><a href=\"https://app.leg.wa.gov/billsummary?BillNumber=5622&amp;Initiative=False&amp;Year=2025\"></a></li></ol><h3><b>The Problem with Age Verification: No Solution Is Safe</b></h3><p><b>no method of age verification is both privacy-protective and entirely accurate</b><a href=\"https://www.eff.org/deeplinks/2024/10/eff-new-york-age-verification-threatens-everyones-speech-and-privacy\"></a></p><p><a href=\"https://www.eff.org/deeplinks/2025/01/face-scans-estimate-our-age-creepy-af-and-harmful\"></a><a href=\"https://www.eff.org/deeplinks/2024/06/hack-age-verification-company-shows-privacy-danger-social-media-laws\"></a></p><p><a href=\"https://www.eff.org/deeplinks/2024/03/analyzing-kosas-constitutional-problems-depth\"></a><a href=\"https://www.eff.org/wp/privacy-first-better-way-address-online-harms\"></a></p>","contentLength":181,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43292820"}],"tags":["dev"]}