{"id":"USgKoryE83j5SszZjyr68sh7DjLn4j6MWUckh4V9BHd8VFvyhTMUW31KA1puTBCFGhS4TzMjShH3jpXxMAYW7X","title":"top scoring links : unRAID","displayTitle":"Reddit - UnRAID","url":"https://www.reddit.com/r/unRAID/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/unRAID/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Best CPU currently?","url":"https://www.reddit.com/r/unRAID/comments/1j72xsk/best_cpu_currently/","date":1741507467,"author":"/u/Z3dan","guid":671,"unread":true,"content":"<p>I have an unraid server that is Primarily for Plex and associated dockers, I also run game servers off it for mates and other small miscellaneous things... </p><p>I hear for Plex Intel is a must? Are the new core ultra 7s any good compared to 14th gen? What are people's thoughts </p>","contentLength":273,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reasonable way to make this beginner PLEX build cheaper?","url":"https://www.reddit.com/r/unRAID/comments/1j6qluu/reasonable_way_to_make_this_beginner_plex_build/","date":1741466961,"author":"/u/Ancient-Trouble-775","guid":674,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Can anyone help figure out why my Unraid server keeps hard crashing every couple of days? - Syslog file.","url":"https://www.reddit.com/r/unRAID/comments/1j6oug6/can_anyone_help_figure_out_why_my_unraid_server/","date":1741462148,"author":"/u/Angry-_-Kid","guid":669,"unread":true,"content":"<p>I made a post a couple days ago asking about why my Unraid server keeps crashing consistently within around 5 days of the last crash.</p><p>I believe I have ruled out memory causing the issue after completing a couple full memtests which reported 0 errors.</p><p>I have since collected a syslog on the advice of some others, and am now pasting it here for someone much more experienced than me to have a look at to see what they think the problem may be!</p><p>My server crashed about half an hour ago. As usual, I couldn't access any WebUI and so I had to hold down the power button on my machine to kill it. Then I took out my flash and copied across the syslog. So the last entry in there should be right around the time it crashed, right?</p><p>If anyone can help break this down and hopefully solve this many-months-long mystery of why my server keeps hard crashing every couple of days, that would be so much appreciated !!</p>","contentLength":901,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is going dual transcoding GPU a bad idea? iGPU+ARC","url":"https://www.reddit.com/r/unRAID/comments/1j6nqvo/is_going_dual_transcoding_gpu_a_bad_idea_igpuarc/","date":1741459189,"author":"/u/darkandark","guid":672,"unread":true,"content":"<p>After reading some of the discussions here, is having Intel iGPU and a dedicated Intel ARC a bad ideal for transcoding in Plex and other dockers? I heard unraid will sometimes get confused which one to use?</p><p>Been thinking about getting an Intel 12th series and pairing it with an Intel ARC. Machine going to be mainly Plex and transcoding for video files and stuff. Any recommendations?</p>","contentLength":384,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Upgraded my cache, now I have a small issue.","url":"https://www.reddit.com/r/unRAID/comments/1j6jnac/upgraded_my_cache_now_i_have_a_small_issue/","date":1741448107,"author":"/u/ollie_olsson","guid":670,"unread":true,"content":"<p>I upgraded my cache drive, and I followed all the instructions I could find (I looked at 3-4 different ones, to see if there any bonus tips/tricks). There were some hiccups, but I resolved the big ones. </p><p>Now there are som shares that have icons like this. Any way to fix it, or is it nothing to be worried about?</p><p>And also, I can access delugevpn container through my phone, when I'm on my local wifi. But if I'm not, and I wireguard into my server, I can access all of my containers GUI, except for delugevpn. I didn't have the problem before. What could be the problem? </p>","contentLength":569,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unraid to backup to Google drive.","url":"https://www.reddit.com/r/unRAID/comments/1j6j0if/unraid_to_backup_to_google_drive/","date":1741446259,"author":"/u/WolfBeiderman","guid":673,"unread":true,"content":"<p>I'm trying to backup data on Unraid to google drive since I have 2tb of storage already. I can't find what app to use to backup to it. I tried Cloudberry but can't the app to link to google drive. What app do you use to backup to google drive? If I have to I'll switch to B2 but rather use google drive since I'm already paying for the storage.</p>","contentLength":344,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}