{"id":"USgKoryE83j5SszZjyr68sh7DjLn4j6MWUckh4V9BHd8VFvyhTMUW31KA1puTBCFGhS4TzMjShH3jpXxMAYW7X","title":"top scoring links : unRAID","displayTitle":"Reddit - UnRAID","url":"https://www.reddit.com/r/unRAID/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/unRAID/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"How does mover work with VMs and what's the best way to back VMs up?","url":"https://www.reddit.com/r/unRAID/comments/1jgyqiw/how_does_mover_work_with_vms_and_whats_the_best/","date":1742611805,"author":"/u/Proper-Novel4527","guid":683,"unread":true,"content":"<p>I created a Windows VM on my cache drive a while ago, and I booted up a game to test something out, and it gave me a warning stating that the game was running off of an HDD and it was highly recommended to run it on an SSD instead. I thought mover might have moved the vdisk to the array, and so I checked the settings of the domains share and saw it was set up to move things from the cache to the array. But then I double checked and the VMs were actually on the cache drive and in the VM it was showing the storage as an SSD. I imagine the warning in the game was because it got confused by running in a VM or something.</p><p>But then that got me wondering, why didn't mover move the VMs to the array if the share was configured to do so?</p><p>Also, that got me thinking I would like the VMs to be backed up to the array occasionally. Is there a tool or a good way to back them up on a schedule, keeping them on the cache drive and having one copy of each on the array that gets replaced during the next backup? </p><p>Sorry if this is a basic question, I haven't played around with VMs very much yet. </p>","contentLength":1086,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"unRAID's flexibility is why I love it so much (follow up to my failing drive post)","url":"https://www.reddit.com/r/unRAID/comments/1jgoens/unraids_flexibility_is_why_i_love_it_so_much/","date":1742583164,"author":"/u/daggah","guid":686,"unread":true,"content":"<p>A few weeks back, one of my 6 TB WD Reds started showing reallocated sectors. Since all of my 6 TB drives were years old (most of them were well over 7 years old) I decided to get new 14 TB drives from ServerPartDeals. I was trying to work out the best way to migrate data from a 6x6 TB array to a 4x14 TB one.</p><p>I built a new server a while back to upgrade the hardware, and happened to still have my old server hardware laying around (4790k with 8 GB of DDR3 RAM (lol) in a mATX Fractal Define Mini case), so I brought it back online with a 30 day unRAID trial and moved the new 14 TB drives into it. Preclearing was all successful, so I created shares on it to match my main server and started copying data over (thank you tmux command!)</p><p>Of course, we had a power outage while I was copying data over, for no discernable reason (weather was good) and sadly, while my main server is protected by an UPS, this temporary one was not. So I had to restart some of the data transfer, and I had some parity sync issues, which hopefully were all corrected by the parity check. We'll see in about 20 hours.</p><p>But now the new drives are back in my main server, and one \"new config\" later, everything is up and running!</p><p>I don't think most other home server platforms would be this flexible...</p>","contentLength":1276,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"First UnRAID Build - Spec Check","url":"https://www.reddit.com/r/unRAID/comments/1jgj7ux/first_unraid_build_spec_check/","date":1742570205,"author":"/u/ChezTX","guid":684,"unread":true,"content":"<p>I am looking to build my first UnRAID server. My primary uses will be media storage, Plex, \"*arr\" apps and maybe Home Assistant.</p><p>Component choice is limited where I live (Iceland), but I have come up with what I think is a decent spec that will allow for expansions later and would appreciate any feedback/advice anyone may have.</p><p>The Node 304 is the only ITX/MATX small-ish case available here with more than 4 3.5\" bays.</p><p>I went for the 12400 as I wanted an Intel iGPU for transcodes (rarely needed, but nice to have) and the 14400 costs more.</p><p>The motherboard is overkill, but it's the only ITX board available here that has 2.5GBE built in and allows PCI bifurcation, which seems like a good idea given the single PCI slot (thinking I may want/need to add more M.2/SATA later, or maybe a 10GB NIC). Also, it has both NVMe slots on the front side (I was worried about overheating with one on the back of the board in the Node 304).</p><p>RAM/Cooler are just the cheapest available that will do the job (and RAM is on the QVL for the motherboard).</p><p>PSU - cheapest modular PSU available here that has at least 6 SATA connections. Also, the SFX form factor will allow a little more space in the case.</p><p>My plan (from my initial reading - will try to learn more before I actually set it up) is to use the WD Blue NVMe drives mirrored as a cache for appdata/docker/VMs/transfer cache (is it OK to do all of this from one pool or would I be better splitting them and using them differently?).</p><p>Regarding the drives, the WD Red Plus 12TB (WD120EFBX) are actually quite expensive here but I want to try to minimise noise. I figure I can start with 3 (single parity drive) and then add more data drives as needed and another parity drive at some point.</p><p>I could get Ironwolf Pro 16TB (ST16000NE000) or Toshiba MG08 16TB (MG08ACA16TE) for the same as the 12TB Red Plus or could get Ironwolf 12TB (ST12000VN0008) or MG07 14TB (MG07ACA14TE) for less.</p><p>My understanding is that all of these options are louder (or have a more annoying noise) than the Red Plus though?</p><p>Thanks in advance for any tips/suggestions/thoughts!</p>","contentLength":2084,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New to unRaid","url":"https://www.reddit.com/r/unRAID/comments/1jgiiv1/new_to_unraid/","date":1742568414,"author":"/u/alvis68","guid":685,"unread":true,"content":"<p>I am setting unRaid server and have some quick questions:</p><p>I am a little reluctant to set it up instead of TrueNas because system runs on an USB stick. If the USB stick fails is there an easy recovery? Will I lose the data on the array(s)?</p><p>Over the years I have had USB sticks go bad for no good reason that can identify. Is there a high quality USB stick that someone can recommend?</p>","contentLength":380,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel arc b580 transcoding not working","url":"https://www.reddit.com/r/unRAID/comments/1jghui5/intel_arc_b580_transcoding_not_working/","date":1742566598,"author":"/u/Impossible_Case_7517","guid":682,"unread":true,"content":"<p>Unraid 7.1.0 beta.1 Plex &amp; jellyfin, --device=/dev/dri:/dev/dri, Intel gpu top is installed, GPU Statistics is installed, Yea I have Plex pass,</p><p>Hallo guys Did any of you get it to work i can see my gpu but when i start transcoding it will just use my cpu Hope one of you got it to work</p><p>The b580 is showing in Plex but it's still using CPU when transcoding</p>","contentLength":353,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Does unRaid 7.0.1 support intel a310 for plex transcoding","url":"https://www.reddit.com/r/unRAID/comments/1jgh2t5/does_unraid_701_support_intel_a310_for_plex/","date":1742564463,"author":"/u/pvtmatchsticks","guid":681,"unread":true,"content":"<div><p>I have an a310 that I am trying to use in a plex container.</p><p>If I add this --device=/dev/dri/card1 then I get the a310 within plex as the Hardware transcoding device but selecting it still doesn't get plex to actually use the a310 for transcodes. </p><p>Yes the a310 is definitely card1.</p></div>   submitted by   <a href=\"https://www.reddit.com/user/pvtmatchsticks\"> /u/pvtmatchsticks </a>","contentLength":315,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}