{"id":"x7L2VSNEiyAFPo5H6bnPWAveyi4npegYaNeyr78Gjr6vQqtjp4cKiAbg9y6hcgadVzEqXA589jFXfyD","title":"Podcast Archives - Software Engineering Daily","displayTitle":"Podcast - Software Engineering Daily","url":"https://softwareengineeringdaily.com/category/podcast/feed","feedLink":"http://softwareengineeringdaily.com/category/all-episodes/exclusive-content/podcast/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":9,"items":[{"title":"React Remix with Ryan Florence","url":"https://softwareengineeringdaily.com/2025/03/20/react-remix-with-ryan-florence/?utm_source=rss&utm_medium=rss&utm_campaign=react-remix-with-ryan-florence","date":1742461245,"author":"SEDaily","guid":792,"unread":true,"content":"<p><a href=\"https://x.com/JoshuaKGoldberg\">Josh Goldberg</a> is an independent full time open source developer in the TypeScript ecosystem. He works on projects that help developers write better TypeScript more easily, most notably on typescript-eslint: the tooling that enables ESLint and Prettier to run on TypeScript code. Josh regularly contributes to open source projects in the ecosystem such as ESLint and TypeScript. Josh is a Microsoft MVP for developer technologies and the author of the acclaimed <a href=\"https://www.learningtypescript.com/\">Learning TypeScript</a> (O’Reilly), a cherished resource for any developer seeking to learn TypeScript without any prior experience outside of JavaScript. Josh regularly presents talks and workshops at bootcamps, conferences, and meetups to share knowledge on TypeScript, static analysis, open source, and general frontend and web development.</p>","contentLength":802,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED1529782856.mp3","enclosureMime":"","commentsUrl":null},{"title":"Turing Award Special: A Conversation with Jack Dongarra","url":"https://softwareengineeringdaily.com/2025/03/18/turing-award-special-a-conversation-with-jack-dongarra/?utm_source=rss&utm_medium=rss&utm_campaign=turing-award-special-a-conversation-with-jack-dongarra","date":1742288446,"author":"SEDaily","guid":791,"unread":true,"content":"<div><p><a href=\"https://www.linkedin.com/in/jack-dongarra-028544/\">Jack Dongarra</a> is an American computer scientist who is celebrated for his pioneering contributions to numerical algorithms and high-performance computing. He developed essential software libraries like LINPACK and LAPACK, which are widely used for solving linear algebra problems on advanced computing systems. Dongarra is also a co-creator of the TOP500 list, which ranks the world’s most powerful supercomputers. His work has profoundly impacted computational science, enabling advancements across numerous research domains.</p></div><div><p>Jack received the 2021 Turing Award “for pioneering contributions to numerical algorithms and libraries that enabled high performance computational software to keep pace with exponential hardware improvements for over four decades.”</p></div><div><p>He joins the podcast with Sean Falconer to talk about his life and career.</p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div></div>","contentLength":1136,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9175294479.mp3","enclosureMime":"","commentsUrl":null},{"title":"Quantum Computing at Rigetti with David Rivas","url":"https://softwareengineeringdaily.com/2025/03/13/quantum-computing-at-rigetti-with-david-rivas/?utm_source=rss&utm_medium=rss&utm_campaign=quantum-computing-at-rigetti-with-david-rivas","date":1741856429,"author":"SEDaily","guid":790,"unread":true,"content":"<div><p><a href=\"https://www.rigetti.com/\">Rigetti</a> Computing is an American company specializing in quantum computing, founded in 2013. The company develops quantum processors and hybrid quantum-classical computing systems, and aims to make quantum computing more accessible for research and commercial applications.</p></div><div><p><a href=\"https://x.com/jdrivas\">David Rivas</a> is the CTO at Rigetti Computing. He joins the podcast with Kevin Ball to talk about the company, the fundamentals of quantum computing, the state of the technology, and where we’re headed.</p><div><div><div><p><a href=\"https://www.kball.llc/\">Kevin Ball</a> or KBall, is the vice president of engineering at Mento and an independent coach for engineers and engineering leaders. He co-founded and served as CTO for two companies, founded the San Diego JavaScript meetup, and organizes the AI inaction discussion group through Latent Space.</p></div></div></div></div>","contentLength":766,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED4292642620.mp3","enclosureMime":"","commentsUrl":null},{"title":"The State of the Ethereum Blockchain with Andrew Koller","url":"https://softwareengineeringdaily.com/2025/03/11/the-state-of-the-ethereum-blockchain-with-andrew-koller/?utm_source=rss&utm_medium=rss&utm_campaign=the-state-of-the-ethereum-blockchain-with-andrew-koller","date":1741683616,"author":"SEDaily","guid":789,"unread":true,"content":"<div><p>Ethereum is a decentralized blockchain platform that was created by <a href=\"https://x.com/VitalikButerin?\">Vitalik Buterin</a> and <a href=\"https://x.com/gavofyork/?lang=eu\">Gavin Wood</a> in 2015. It uses a cryptocurrency called Ether as its native token to power transactions and operations on the Ethereum network. Ethereum’s proponents envision a future where the network forms the foundation for a second platform layer, called L2, where decentralized applications are run.</p></div><div><p>As we approach the 10th anniversary of Ethereum’s creation we wanted to understand the state of the technology so we spoke with Andrew Koller who is an engineer at <a href=\"https://www.kraken.com/\">Kraken</a>, which is a software company and popular cryptocurrency exchange. In this conversation Andrew talks about Kraken, security considerations at an exchange, the history of Ethereum, L2, and the future of Ethereum.</p></div>","contentLength":773,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED4255543830.mp3","enclosureMime":"","commentsUrl":null},{"title":"StackHawk and Shift-Left API Security with Scott Gerlach","url":"https://softwareengineeringdaily.com/2025/03/06/stackhawk-and-shift-left-api-security-with-scott-gerlach/?utm_source=rss&utm_medium=rss&utm_campaign=stackhawk-and-shift-left-api-security-with-scott-gerlach","date":1741255258,"author":"SEDaily","guid":788,"unread":true,"content":"<div><p>APIs are a fundamental part of modern software systems and enable communication between services, applications, and third-party integrations. However, their openness and accessibility also make them a prime target for security threats, and this makes APIs a growing focus on software teams.</p></div><div><a href=\"https://www.stackhawk.com/\">StackHawk</a> is a company that scans and monitors source code to obtain the full scope of an organization’s APIs and applications, and runs tests to identify vulnerabilities and address them pre-production.</div><div><p><a href=\"https://x.com/sgerlach\">Scott Gerlach</a> is the Co-Founder and Chief Security Officer at StackHawk and previously worked at SendGrid and GoDaddy. He has an extensive background running security operations and engineering and, in this episode, he joins the show to talk about the challenges around API security and leading-edge strategies to address them.</p><p><em><em>Full Disclosure: This episode is sponsored by</em></em></p></div>","contentLength":867,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED1603999548.mp3","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA RAPIDS and Open Source ML Acceleration with Chris Deotte and Jean-Francois Puget","url":"https://softwareengineeringdaily.com/2025/03/04/nvidia-rapids-and-open-source-ml-acceleration-with-chris-deotte-and-jean-francois-puget/?utm_source=rss&utm_medium=rss&utm_campaign=nvidia-rapids-and-open-source-ml-acceleration-with-chris-deotte-and-jean-francois-puget","date":1741082439,"author":"SEDaily","guid":787,"unread":true,"content":"<div><p><a href=\"https://developer.nvidia.com/rapids\">NVIDIA RAPIDS</a> is an open-source suite of GPU-accelerated data science and AI libraries. It leverages CUDA and significantly enhances the performance of core Python frameworks including Polars, pandas, scikit-learn and NetworkX.</p></div><div><p><a href=\"https://x.com/chrisdeotte\">Chris Deotte</a> is a Senior Data Scientist at NVIDIA and <a href=\"https://x.com/jfpuget\">Jean-Francois Puget</a> is the Director and a Distinguished Engineer at NVIDIA. Chris and Jean-Francois are also Kaggle Grandmasters, which is the highest rank a data scientist or machine learning practitioner can achieve on Kaggle, a competitive platform for data science challenges.</p></div><div><p>In this episode, they join the podcast with Sean Falconer to talk about Kaggle, GPU-acceleration for data science applications, where they’ve achieved the biggest performance gains, the unexpected challenges with tabular data, and much more.</p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div></div>","contentLength":1102,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED6685234821.mp3","enclosureMime":"","commentsUrl":null},{"title":"Browser Security with Jeswin Mathai","url":"https://softwareengineeringdaily.com/2025/02/27/browser-security-with-jeswin-mathai/?utm_source=rss&utm_medium=rss&utm_campaign=browser-security-with-jeswin-mathai","date":1740650432,"author":"SEDaily","guid":786,"unread":true,"content":"<div><p>Browser security aims to protect users from cyber threats encountered online, such as phishing, malicious extensions, and malware. It’s a complex, multifaceted challenge that’s increasingly important as cloud-based tools, SaaS platforms, and collaborative applications become the backbone of modern workflows.</p></div>","contentLength":313,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED2491544065.mp3","enclosureMime":"","commentsUrl":null},{"title":"Troubleshooting Microservices with Julia Blase","url":"https://softwareengineeringdaily.com/2025/02/25/troubleshooting-microservices-with-julia-blase/?utm_source=rss&utm_medium=rss&utm_campaign=troubleshooting-microservices-with-julia-blase","date":1740477608,"author":"SEDaily","guid":785,"unread":true,"content":"<div><p>A distributed system is a network of independent services that work together to achieve a common goal. Unlike a monolithic system, a distributed system has no central point of control, meaning it must handle challenges like data consistency, network latency, and system failures.</p></div><div><p>Debugging distributed systems is conventionally considered challenging because modern architectures consist of numerous microservices communicating across networks, making failures difficult to isolate. The challenges and maintenance burdens can magnify as systems grow in size and complexity.</p></div><div><p><a href=\"https://www.linkedin.com/in/julia-blase-77842342/\">Julia Blase</a> is a Product Manager at <a href=\"http://chronosphere.io/sed\">Chronosphere</a> where she works on features to help developers troubleshoot distributed systems more efficiently, including Differential Diagnosis, or DDx. DDx provides tooling to troubleshoot distributed systems, and emphasizes automation and developer experience. In this episode Julia joins Sean Falconer to talk about the challenges and emerging strategies to troubleshoot distributed systems.</p><p><em><em>Full Disclosure: This episode is sponsored by</em></em></p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div></div>","contentLength":1345,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9767140288.mp3","enclosureMime":"","commentsUrl":null},{"title":"Vercel’s Developer Frameworks with Ary Khandelwal and Max Leiter","url":"https://softwareengineeringdaily.com/2025/02/20/vercels-developer-frameworks-with-ary-khandelwal-and-max-leiter/?utm_source=rss&utm_medium=rss&utm_campaign=vercels-developer-frameworks-with-ary-khandelwal-and-max-leiter","date":1740045644,"author":"SEDaily","guid":784,"unread":true,"content":"<div><p>The availability of high-quality AI model APIs has drastically lowered the barriers developing AI applications. These tools abstract away complex tasks such as model deployment, scaling, data retrieval, natural language processing, and text generation.</p></div><div><p><a href=\"https://vercel.com/\">Vercel</a> has developed a complementary set of tools for building AI web applications, including their AI SDK, v0, and the shadcn/ui component framework.</p></div>","contentLength":402,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED3153874783.mp3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}