{"id":"x7L2VSNEiyAFPo5H6bnPWAveyi4npegYaNeyr78Gjr6vQqtjp4cKiAbg9y6hcgadVzEqXA589jFXfyD","title":"Podcast Archives - Software Engineering Daily","displayTitle":"Podcast - Software Engineering Daily","url":"https://softwareengineeringdaily.com/category/podcast/feed","feedLink":"http://softwareengineeringdaily.com/category/all-episodes/exclusive-content/podcast/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"StackHawk and Shift-Left API Security with Scott Gerlach","url":"https://softwareengineeringdaily.com/2025/03/06/stackhawk-and-shift-left-api-security-with-scott-gerlach/?utm_source=rss&utm_medium=rss&utm_campaign=stackhawk-and-shift-left-api-security-with-scott-gerlach","date":1741255258,"author":"SEDaily","guid":775,"unread":true,"content":"<div><p>APIs are a fundamental part of modern software systems and enable communication between services, applications, and third-party integrations. However, their openness and accessibility also make them a prime target for security threats, and this makes APIs a growing focus on software teams.</p></div><div><a href=\"https://www.stackhawk.com/\">StackHawk</a> is a company that scans and monitors source code to obtain the full scope of an organization’s APIs and applications, and runs tests to identify vulnerabilities and address them pre-production.</div><div><p><a href=\"https://x.com/sgerlach\">Scott Gerlach</a> is the Co-Founder and Chief Security Officer at StackHawk and previously worked at SendGrid and GoDaddy. He has an extensive background running security operations and engineering and, in this episode, he joins the show to talk about the challenges around API security and leading-edge strategies to address them.</p><p><em><em>Full Disclosure: This episode is sponsored by</em></em></p></div>","contentLength":867,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED1603999548.mp3","enclosureMime":"","commentsUrl":null},{"title":"NVIDIA RAPIDS and Open Source ML Acceleration with Chris Deotte and Jean-Francois Puget","url":"https://softwareengineeringdaily.com/2025/03/04/nvidia-rapids-and-open-source-ml-acceleration-with-chris-deotte-and-jean-francois-puget/?utm_source=rss&utm_medium=rss&utm_campaign=nvidia-rapids-and-open-source-ml-acceleration-with-chris-deotte-and-jean-francois-puget","date":1741082439,"author":"SEDaily","guid":774,"unread":true,"content":"<div><p><a href=\"https://developer.nvidia.com/rapids\">NVIDIA RAPIDS</a> is an open-source suite of GPU-accelerated data science and AI libraries. It leverages CUDA and significantly enhances the performance of core Python frameworks including Polars, pandas, scikit-learn and NetworkX.</p></div><div><p><a href=\"https://x.com/chrisdeotte\">Chris Deotte</a> is a Senior Data Scientist at NVIDIA and <a href=\"https://x.com/jfpuget\">Jean-Francois Puget</a> is the Director and a Distinguished Engineer at NVIDIA. Chris and Jean-Francois are also Kaggle Grandmasters, which is the highest rank a data scientist or machine learning practitioner can achieve on Kaggle, a competitive platform for data science challenges.</p></div><div><p>In this episode, they join the podcast with Sean Falconer to talk about Kaggle, GPU-acceleration for data science applications, where they’ve achieved the biggest performance gains, the unexpected challenges with tabular data, and much more.</p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div></div>","contentLength":1102,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED6685234821.mp3","enclosureMime":"","commentsUrl":null},{"title":"Browser Security with Jeswin Mathai","url":"https://softwareengineeringdaily.com/2025/02/27/browser-security-with-jeswin-mathai/?utm_source=rss&utm_medium=rss&utm_campaign=browser-security-with-jeswin-mathai","date":1740650432,"author":"SEDaily","guid":773,"unread":true,"content":"<div><p>Browser security aims to protect users from cyber threats encountered online, such as phishing, malicious extensions, and malware. It’s a complex, multifaceted challenge that’s increasingly important as cloud-based tools, SaaS platforms, and collaborative applications become the backbone of modern workflows.</p></div>","contentLength":313,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED2491544065.mp3","enclosureMime":"","commentsUrl":null},{"title":"Troubleshooting Microservices with Julia Blase","url":"https://softwareengineeringdaily.com/2025/02/25/troubleshooting-microservices-with-julia-blase/?utm_source=rss&utm_medium=rss&utm_campaign=troubleshooting-microservices-with-julia-blase","date":1740477608,"author":"SEDaily","guid":772,"unread":true,"content":"<div><p>A distributed system is a network of independent services that work together to achieve a common goal. Unlike a monolithic system, a distributed system has no central point of control, meaning it must handle challenges like data consistency, network latency, and system failures.</p></div><div><p>Debugging distributed systems is conventionally considered challenging because modern architectures consist of numerous microservices communicating across networks, making failures difficult to isolate. The challenges and maintenance burdens can magnify as systems grow in size and complexity.</p></div><div><p><a href=\"https://www.linkedin.com/in/julia-blase-77842342/\">Julia Blase</a> is a Product Manager at <a href=\"http://chronosphere.io/sed\">Chronosphere</a> where she works on features to help developers troubleshoot distributed systems more efficiently, including Differential Diagnosis, or DDx. DDx provides tooling to troubleshoot distributed systems, and emphasizes automation and developer experience. In this episode Julia joins Sean Falconer to talk about the challenges and emerging strategies to troubleshoot distributed systems.</p><p><em><em>Full Disclosure: This episode is sponsored by</em></em></p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div></div>","contentLength":1345,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9767140288.mp3","enclosureMime":"","commentsUrl":null},{"title":"Vercel’s Developer Frameworks with Ary Khandelwal and Max Leiter","url":"https://softwareengineeringdaily.com/2025/02/20/vercels-developer-frameworks-with-ary-khandelwal-and-max-leiter/?utm_source=rss&utm_medium=rss&utm_campaign=vercels-developer-frameworks-with-ary-khandelwal-and-max-leiter","date":1740045644,"author":"SEDaily","guid":771,"unread":true,"content":"<div><p>The availability of high-quality AI model APIs has drastically lowered the barriers developing AI applications. These tools abstract away complex tasks such as model deployment, scaling, data retrieval, natural language processing, and text generation.</p></div><div><p><a href=\"https://vercel.com/\">Vercel</a> has developed a complementary set of tools for building AI web applications, including their AI SDK, v0, and the shadcn/ui component framework.</p></div>","contentLength":402,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED3153874783.mp3","enclosureMime":"","commentsUrl":null},{"title":"Docusign for Developers with Dan Selman and Larry Jin","url":"https://softwareengineeringdaily.com/2025/02/18/the-docusign-developer-api-with-dan-selman-and-larry-jin/?utm_source=rss&utm_medium=rss&utm_campaign=the-docusign-developer-api-with-dan-selman-and-larry-jin","date":1739872828,"author":"SEDaily","guid":770,"unread":true,"content":"<p>Agreements and contracts are a fundamental innovation and govern everything from personal commitments to major financial decisions. They function as trusted artifacts to capture the nature of a commitment and provide clarity and accountability. Software has revolutionized many business functions, including the basic mechanics of digitally signing an agreement. However, the process of managing agreements systematically and at scale with type definitions, programmatic document creation, and storage schemas remains a complex and largely unsolved challenge.</p><p><a href=\"https://x.com/danielselman\">Dan Selman</a> is the product architect at <a href=\"https://www.docusign.com/\">Docusign</a> and was previously co-founder and CTO of the Smart Agreements Platform, Clause. <a href=\"https://www.linkedin.com/in/elj4y/\">Larry Jin</a> is the VP of Product Management at Docusign and previously worked at Amazon, Microsoft, and Google. Docusign recently released a developer API focused on fully modernizing and scaling the agreements process. In this episode, Dan and Larry joined Sean Falconer to talk about the frontier of digital agreements.</p><p><em>Full Disclosure: This episode is sponsored by</em></p><div><div><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div></div></div>","contentLength":1349,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED7418083051.mp3","enclosureMime":"","commentsUrl":null},{"title":"The Subsea Cable Network with Josh Dzieza","url":"https://softwareengineeringdaily.com/2025/02/12/the-subsea-cable-network-with-josh-dzieza/?utm_source=rss&utm_medium=rss&utm_campaign=the-subsea-cable-network-with-josh-dzieza","date":1739354459,"author":"SEDaily","guid":769,"unread":true,"content":"<div><p>Subsea cables are high-capacity fiber-optic lines laid along the ocean floor to enable global communication by transmitting data between continents. Spanning thousands of miles, they carry an estimated 95% of international internet, phone, and data transmissions.</p></div><div><p>Critically, these cables are vulnerable to sabotage by state actors, as they form critical infrastructure for global communication and economic stability. Indeed, Russia and China have been implicated in activities targeting subsea cables as recently as November 2024, and experts warn that these networks are likely to be focal points in future conflicts, heightening geopolitical tensions.</p></div><div><p><a href=\"https://x.com/joshdzieza\">Josh Dzieza</a> is a reporter for The Verge and has covered the subsea cable industry and the strategic importance of subsea cables. He joins the podcast alongside Gregor Vand to discuss this invisible, and increasingly important, network infrastructure.</p><div><p>You can check out Josh’s reporting <a href=\"https://www.theverge.com/c/24070570/internet-cables-undersea-deep-repair-ships\">here</a>.</p></div></div>","contentLength":946,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED7608490746.mp3","enclosureMime":"","commentsUrl":null},{"title":"LangChain and Agentic AI Engineering with Erick Friis","url":"https://softwareengineeringdaily.com/2025/02/11/langchain-and-agentic-ai-engineering-with-erick-friis/?utm_source=rss&utm_medium=rss&utm_campaign=langchain-and-agentic-ai-engineering-with-erick-friis","date":1739268011,"author":"SEDaily","guid":768,"unread":true,"content":"<div><p><a href=\"https://www.langchain.com/\">LangChain</a> is a popular open-source framework to build applications that integrate LLMs with external data sources like APIs, databases, or custom knowledge bases. It’s commonly used for chatbots, question-answering systems, and workflow automation. Its flexibility and extensibility have made it something of a standard for creating sophisticated AI-driven software.</p></div><div><p><a href=\"https://x.com/eyfriis\">Erick Frii</a><a href=\"https://x.com/eyfriis\">s</a> is a Founding Engineer at LangChain and he leads their integrations and open source efforts. Erick joins the podcast to talk about what inspired the creation of LangChain, agentic flows vs. chained flows, emerging patterns of agentic AI design, and much more.</p></div>","contentLength":639,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED4262555283.mp3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}